
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Задание",ПараметрКоманды);
	Оповещение = Новый ОписаниеОповещения("ЧатПослеЗакрытия", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.Форма.ФормаЧата", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ЧатПослеЗакрытия(РезультатЗакрытия, ДопПараметры) Экспорт
	Оповестить("ЗакрытиеЧата");
КонецПроцедуры
