#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Куратор") Тогда
		Руководитель = Параметры.Куратор;
		Отбор = Направления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		Отбор.ПравоеЗначение = Руководитель;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Руководитель");
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

		Если ЗначениеЗаполнено(Руководитель) Тогда
			Отбор.Использование = Истина;
		Иначе
			ОТбор.Использование = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти   

#Область ОбработчикКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ТекущиеДанные = Элементы.Направления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Закрыть(ТекущиеДанные.Направление);
КонецПроцедуры  

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НаправленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(ВыбраннаяСтрока);
КонецПроцедуры 

#КонецОбласти    

