#Область ОписаниеТипов

Функция ОписаниеТипаСтрока(ДлинаСтроки = 0) Экспорт
	Возврат Новый ОписаниеТипов("Строка",,кСтрока(ДлинаСтроки));
КонецФункции

Функция ОписаниеТипаЧисло(ДлинаЧисла = 15,ТочностьЧисла = 2) Экспорт
	Возврат Новый ОписаниеТипов("Число",кЧисло(ДлинаЧисла,ТочностьЧисла));
КонецФункции

Функция ОписаниеТипаДатаВремя(ДатаВремя = "ДатаВремя") Экспорт
	Возврат Новый ОписаниеТипов("Дата",,,кДатаВремя(ДатаВремя));
КонецФункции

Функция ОписаниеТипаТаблицаЗначений() Экспорт
	
	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	Возврат Новый ОписаниеТипов(МассивТипаВыбора);	
	
КонецФункции

Функция ОписаниеТипаДинамическийСписок() Экспорт
	
	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ДинамическийСписок"));
	Возврат Новый ОписаниеТипов(МассивТипаВыбора);	
	
КонецФункции

Функция ОписаниеТипаБулево() Экспорт
	
	Возврат Новый ОписаниеТипов("Булево");	
	
КонецФункции

Функция ОписаниеТипаДокумент(ИмяДокумента) Экспорт
	
	Возврат Новый ОписаниеТипов("ДокументСсылка." + ИмяДокумента);	
	
КонецФункции

Функция ОписаниеТипаСправочник(ИмяСправочника) Экспорт
	
	Возврат Новый ОписаниеТипов("СправочникСсылка." + ИмяСправочника);	
	
КонецФункции

Функция ОписаниеТипаПеречисление(ИмяПеречисления) Экспорт
	
	Возврат Новый ОписаниеТипов("ПеречислениеСсылка." + ИмяПеречисления);	
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////////
//Создание квалификаторов

Функция кСтрока(ДлинаСтроки = 0) Экспорт
	Возврат Новый КвалификаторыСтроки(ДлинаСтроки);
КонецФункции

Функция кЧисло(ДлинаЧисла = 15,ТочностьЧисла = 2) Экспорт
	Возврат Новый КвалификаторыЧисла(ДлинаЧисла,ТочностьЧисла);
КонецФункции

Функция кДатаВремя(ДатаВремя = "ДатаВремя") Экспорт
	Возврат Новый КвалификаторыДаты(ЧастиДаты[ДатаВремя]);
КонецФункции

#КонецОбласти

#Область СозданиеРеквизитовКоманд

Процедура СоздатьРеквизит(Форма,ИмяРеквизита,ОписаниеТипа) Экспорт
	
	структураРеквизитов = Новый Структура;
	структураРеквизитов.Вставить(ИмяРеквизита,ОписаниеТипа);
	СоздатьРеквизиты(Форма,структураРеквизитов); 
	
КонецПроцедуры

Процедура СоздатьРеквизиты(Форма,структураРеквизитов) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого тРеквизит Из структураРеквизитов Цикл 
		НовыйРеквизит = Новый РеквизитФормы(тРеквизит.Ключ,тРеквизит.Значение); 
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	КонецЦикла;
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
КонецПроцедуры

Процедура СоздатьРеквизитыТаблицы(Форма,ИмяТаблицы,структураРеквизитов) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого тРеквизит Из структураРеквизитов Цикл 
		НовыйРеквизит = Новый РеквизитФормы(тРеквизит.Ключ,тРеквизит.Значение,ИмяТаблицы); 
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	КонецЦикла;
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
КонецПроцедуры

Процедура СоздатьКоманду(Форма,ИмяКоманды,Заголовок,ИмяДействия) Экспорт
    НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
    НоваяКоманда.Заголовок = Заголовок;
	НоваяКоманда.Действие = ИмяДействия;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции

Процедура ЕслиСтруктураНеопределеноТоНовая(текущаяСруктура)
	Если текущаяСруктура = Неопределено Тогда
		текущаяСруктура = Новый Структура;
	КонецЕсли;
КонецПроцедуры

Процедура ОпределитьЭлементФормы(Форма,Элемент)
	Если Элемент = Неопределено Тогда Возврат КонецЕсли;
	Если ТипЗнч(Элемент) = Тип("Строка") Тогда
		Элемент = Форма.Элементы[Элемент];	
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьСостояниеРастягиванияЭлементаПоГоризонтали(Элемент,Состояние)
	Если Состояние = 1 Тогда
		Элемент.РастягиватьПоГоризонтали = ИСТИНА;	
	ИначеЕсли Состояние = 2 Тогда
		Элемент.РастягиватьПоГоризонтали = ЛОЖЬ;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПолучитьСостояниеРастягиванияЭлементаПоВертикали(Элемент,Состояние)
	Если Состояние = 1 Тогда
		Элемент.РастягиватьПоВертикали = ИСТИНА;	
	ИначеЕсли Состояние = 2 Тогда
		Элемент.РастягиватьПоВертикали = ЛОЖЬ;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПолучитьСостояниеГруппировкиЭлемента(Элемент,Состояние)
	Если Состояние = 1 Тогда
		Элемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;		
	ИначеЕсли Состояние = 2 Тогда
		Элемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;	
	ИначеЕсли Состояние = 3 Тогда
		Элемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;			
	КонецЕсли;	
КонецПроцедуры

Процедура ПолучитьСостояниеГруппировкиКолонкиЭлемента(Элемент,Состояние)
	Если Состояние = 1 Тогда
		Элемент.Группировка = ГруппировкаКолонок.Горизонтальная;		
	ИначеЕсли Состояние = 2 Тогда
		Элемент.Группировка = ГруппировкаКолонок.Вертикальная;	
	ИначеЕсли Состояние = 3 Тогда
		Элемент.Группировка = ГруппировкаКолонок.ВЯчейке;			
	КонецЕсли;	
КонецПроцедуры

Процедура УстановитьМножествоСтруктурСвойствЭлементу(Элемент,
	СтруктураСвойств1,
	СтруктураСвойств2 = Неопределено,
	СтруктураСвойств3 = Неопределено,
	СтруктураСвойств4 = Неопределено,
	СтруктураСвойств5 = Неопределено,
	СтруктураСвойств6 = Неопределено,
	СтруктураСвойств7 = Неопределено,
	СтруктураСвойств8 = Неопределено,
	СтруктураСвойств9 = Неопределено,
	СтруктураСвойств10 = Неопределено) Экспорт
	
	УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств1);
	Если СтруктураСвойств2 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств2) КонецЕсли;
	Если СтруктураСвойств3 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств3) КонецЕсли;
	Если СтруктураСвойств4 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств4) КонецЕсли;
	Если СтруктураСвойств5 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств5) КонецЕсли;
	Если СтруктураСвойств6 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств6) КонецЕсли;
	Если СтруктураСвойств7 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств7) КонецЕсли;
	Если СтруктураСвойств8 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств8) КонецЕсли;
	Если СтруктураСвойств9 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств9) КонецЕсли;
	Если СтруктураСвойств10 <> Неопределено Тогда УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств10) КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементу(Элемент,СтруктураСвойств) Экспорт
	Для Каждого тСвойство Из СтруктураСвойств Цикл
		Элемент[тСвойство.Ключ] = тСвойство.Значение;	
	КонецЦикла;	
КонецПроцедуры

Процедура УстановитьСобытияЭлементу(Элемент,СтруктураСобытий) Экспорт
	Для Каждого тСвойство Из СтруктураСобытий Цикл	
		Элемент.УстановитьДействие(тСвойство.Ключ,тСвойство.Значение);
	КонецЦикла;	
КонецПроцедуры

Процедура УстановитьПараметрыЗапросу(РеквизитДинамическийСписок,ПараметрыЗапроса) Экспорт
	Для Каждого Параметра из ПараметрыЗапроса Цикл
			РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра(Параметра.Ключ,Параметра.Значение);	
	КонецЦикла;		 
КонецПроцедуры

Функция СоздатьЭлементФормы(Форма,ИмяЭлемента,ТипЭлемента,РодительЭлемента,ЭлементПеред = Неопределено)	
	Если ЭлементПеред = Неопределено Тогда
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента,ТипЭлемента,РодительЭлемента);
	Иначе
		НовыйЭлемент = Форма.Элементы.Вставить(ИмяЭлемента,ТипЭлемента,РодительЭлемента,ЭлементПеред);		
	КонецЕсли;
	Возврат НовыйЭлемент;
КонецФункции

Процедура СоздатьКолонкиДляТаблицыФормы(Форма,ТаблицаФормы,СтруктураКолонок,ЭтоДС = ЛОЖЬ)
	
	ИмяСписка = ТаблицаФормы.Имя; 
	Для Каждого тКолонка Из СтруктураКолонок Цикл
		ИмяКолонки = тКолонка.Ключ;
		НоваяКолонкаТаблицы = СоздатьЭлементФормы(Форма,ИмяСписка + ИмяКолонки,Тип("ПолеФормы"),ТаблицаФормы);
		НоваяКолонкаТаблицы.Вид = ?(ЭтоДС,ВидПоляФормы.ПолеНадписи,ВидПоляФормы.ПолеВвода);
		Если тКолонка.Значение <> "" Тогда НоваяКолонкаТаблицы.Заголовок = тКолонка.Значение КонецЕсли;
		НоваяКолонкаТаблицы.ПутьКДанным = ИмяСписка + "." + ИмяКолонки;
	КонецЦикла;		
		
КонецПроцедуры

Функция ПолучитьГоризонтальноеПоложение(ШифрПоложения)
	Если ШифрПоложения = 1 Тогда
		нГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	ИначеЕсли ШифрПоложения = 2 Тогда
		нГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ИначеЕсли ШифрПоложения = 3 Тогда
		нГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	Иначе
		нГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Авто;
	КонецЕсли;
	Возврат нГоризонтальноеПоложение;
КонецФункции

#КонецОбласти

#Область СозданиеЭлементов                                    

Функция СздГруппаОбычнаяБезОтображения(Форма,
	ИмяГруппы,
	РодительГруппы,
	ГруппировкаОбычнойГруппы = 0,
	РастягиватьГоризонтально = 0,
	РастягиватьВертикально = 0,
	СтруктураСвойств = Неопределено,
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);		
	ОпределитьЭлементФормы(Форма,РодительГруппы);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяГруппы,Тип("ГруппаФормы"),РодительГруппы,ЭлементПеред);                  
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = ЛОЖЬ;
	
	ПолучитьСостояниеГруппировкиЭлемента(НовыйЭлемент,ГруппировкаОбычнойГруппы);
	ПолучитьСостояниеРастягиванияЭлементаПоГоризонтали(НовыйЭлемент,РастягиватьГоризонтально);	
	ПолучитьСостояниеРастягиванияЭлементаПоВертикали(НовыйЭлемент,РастягиватьВертикально);
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздГруппаОбычная(Форма,
	ИмяГруппы,
	РодительГруппы,
	Заголовок = "",
	ГруппировкаОбычнойГруппы = 0,
	РастягиватьГоризонтально = 0,
	РастягиватьВертикально = 0,
	СтруктураСвойств = Неопределено,
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);		
	ОпределитьЭлементФормы(Форма,РодительГруппы);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяГруппы,Тип("ГруппаФормы"),РодительГруппы,ЭлементПеред);                  
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = ИСТИНА;
	
	ПолучитьСостояниеГруппировкиЭлемента(НовыйЭлемент,ГруппировкаОбычнойГруппы);
	ПолучитьСостояниеРастягиванияЭлементаПоГоризонтали(НовыйЭлемент,РастягиватьГоризонтально);	
	ПолучитьСостояниеРастягиванияЭлементаПоВертикали(НовыйЭлемент,РастягиватьВертикально);	

	Если Заголовок <> "" Тогда НовыйЭлемент.Заголовок = Заголовок КонецЕсли;
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздГруппаСтраниц(Форма,
	ИмяГруппы,
	РодительГруппы,
	РастягиватьГоризонтально = 0,
	РастягиватьВертикально = 0,
	ПриСменеСтраницы = "",	//FIXME GVGold Котов Д.В. 26.03.2020 
	СтруктураСвойств = Неопределено,
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);		
	ОпределитьЭлементФормы(Форма,РодительГруппы);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);
	
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяГруппы,Тип("ГруппаФормы"),РодительГруппы,ЭлементПеред);	                  
	НовыйЭлемент.Вид = ВидГруппыФормы.Страницы;
		
	ПолучитьСостояниеРастягиванияЭлементаПоГоризонтали(НовыйЭлемент,РастягиватьГоризонтально);	
	ПолучитьСостояниеРастягиванияЭлементаПоВертикали(НовыйЭлемент,РастягиватьВертикально);	
	
	Если ПриСменеСтраницы <> "" Тогда НовыйЭлемент.ПриСменеСтраницы = ПриСменеСтраницы КонецЕсли;	
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздСтраница(Форма,
	ИмяСтраницы,
	ГруппаСтраницы,
	Заголовок = "",
	ГруппировкаОбычнойГруппы = 0,
	РастягиватьГоризонтально = 0,
	РастягиватьВертикально = 0,
	СтруктураСвойств = Неопределено,
	СтраницаПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);		
	ОпределитьЭлементФормы(Форма,ГруппаСтраницы);
	ОпределитьЭлементФормы(Форма,СтраницаПеред);	
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяСтраницы,Тип("ГруппаФормы"),ГруппаСтраницы,СтраницаПеред);	                  
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	
	ПолучитьСостояниеГруппировкиЭлемента(НовыйЭлемент,ГруппировкаОбычнойГруппы);
	ПолучитьСостояниеРастягиванияЭлементаПоГоризонтали(НовыйЭлемент,РастягиватьГоризонтально);	
	ПолучитьСостояниеРастягиванияЭлементаПоВертикали(НовыйЭлемент,РастягиватьВертикально);	

	Если Заголовок <> "" Тогда НовыйЭлемент.Заголовок = Заголовок КонецЕсли;
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздГруппаКоманднаяПанель(Форма,
	ИмяПанели,
	РодительПанели,
	СтруктураСвойств = Неопределено,
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);		
	ОпределитьЭлементФормы(Форма,РодительПанели);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяПанели,Тип("ГруппаФормы"),РодительПанели,ЭлементПеред);
	НовыйЭлемент.Вид = ВидГруппыФормы.КоманднаяПанель;	
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздГруппа(Форма,
	ИмяГруппы,
	РодительГруппы,	
	СтруктураСвойств,
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);		
	ОпределитьЭлементФормы(Форма,РодительГруппы);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяГруппы,Тип("ГруппаФормы"),РодительГруппы,ЭлементПеред);
	                  	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздПоле(Форма,
	ИмяПоля,
	РодительПоля,
	Заголовок,
	ШифрВидаПоля = 0,
	ПутьКДанным = "",
	СтруктураСвойств = Неопределено,
	СтруктураСобытий = Неопределено,
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСобытий);
	ОпределитьЭлементФормы(Форма,РодительПоля);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяПоля,Тип("ПолеФормы"),РодительПоля,ЭлементПеред);
	
	Если ШифрВидаПоля <> 0 Тогда
		НаборВидов = "ПолеВвода
		|ПолеФлажка		
		|ПолеИндикатора
		|ПолеПереключателя
		|ПолеПериода
		|ПолеHTMLДокумента";
		ВидПоля = СокрЛП(СтрПолучитьСтроку(НаборВидов,ШифрВидаПоля));
		НовыйЭлемент.Вид = ВидПоляФормы[ВидПоля];
	КонецЕсли;
		
	Если Заголовок <> "" Тогда НовыйЭлемент.Заголовок = Заголовок КонецЕсли;	
	Если ПутьКДанным <> "" Тогда НовыйЭлемент.ПутьКДанным = ПутьКДанным КонецЕсли;
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	УстановитьСобытияЭлементу(НовыйЭлемент,СтруктураСобытий);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздПолеФлажок(Форма,
	ИмяПоля,
	РодительПоля,
	Заголовок,
	тВидФлажка = 0,
	ПутьКДанным = "",
	СтруктураСвойств = Неопределено,
	СтруктураСобытий = Неопределено,
	ЭлементПеред = Неопределено) Экспорт
	
	НовыйЭлемент = СздПоле(Форма,ИмяПоля,РодительПоля,Заголовок,2,ПутьКДанным,СтруктураСвойств,СтруктураСобытий,ЭлементПеред);
	Если тВидФлажка <> 0 Тогда
		НаборВидов = "Флажок
		|Тумблер		
		|Выключатель";
		ВидПоля = СокрЛП(СтрПолучитьСтроку(НаборВидов,тВидФлажка));
		НовыйЭлемент.ВидФлажка = ВидФлажка[ВидПоля];
	КонецЕсли;	
	
КонецФункции
	
Функция СздДекорацияНадпись(Форма,
	ИмяДекорации,
	РодительДекорации,
	ЗаголовокДекорации,
	РастягиватьПоГоризонтали = ИСТИНА,
	ЭлементПеред = Неопределено) Экспорт
	
	ОпределитьЭлементФормы(Форма,РодительДекорации);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);	
	
	НовыйЭлемент = СздДекорация(Форма,ИмяДекорации,РодительДекорации,,,ЭлементПеред);
	
	НовыйЭлемент.Заголовок = ЗаголовокДекорации;
	
	Если РастягиватьПоГоризонтали Тогда
		НовыйЭлемент.АвтоМаксимальнаяШирина = ЛОЖЬ;
		НовыйЭлемент.РастягиватьПоГоризонтали = ИСТИНА;	
	КонецЕсли;
		
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздДекорацияКартинка(Форма,
	ИмяДекорации,
	РодительДекорации,
	ИмяКартинки,
	ЭлементПеред = Неопределено) Экспорт
	
	НовыйЭлемент = СздДекорация(Форма,ИмяДекорации,РодительДекорации,,,ЭлементПеред);
	
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок[ИмяКартинки];
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздДекорация(Форма,
	ИмяДекорации,
	РодительДекорации,
	СтруктураСвойств = Неопределено,
	СтруктураСобытий = Неопределено,                                            
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСобытий);
	ОпределитьЭлементФормы(Форма,РодительДекорации);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяДекорации,Тип("ДекорацияФормы"),РодительДекорации,ЭлементПеред);
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	УстановитьСобытияЭлементу(НовыйЭлемент,СтруктураСобытий);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздКнопка(Форма,
	ИмяКнопки,
	РодительКнопки,
	ЗаголовокКнопки = "",
	ИмяКоманды = "",	
	ВидКнопки = 0,
	СтруктураСвойств = Неопределено,	
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);
	ОпределитьЭлементФормы(Форма,РодительКнопки);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);	
	
	//НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяКнопки,Тип("ДекорацияФормы"),РодительКнопки,ЭлементПеред);
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяКнопки,Тип("КнопкаФормы"),РодительКнопки,ЭлементПеред);
	Если ВидКнопки <> 0 Тогда
		НаборВидов = "ОбычнаяКнопка
		|Гиперссылка";
		ВидПоля = СокрЛП(СтрПолучитьСтроку(НаборВидов,ВидКнопки));
		НовыйЭлемент.Вид = ВидКнопкиФормы[ВидПоля];
	КонецЕсли;		
	
	Если ЗаголовокКнопки <> "" Тогда НовыйЭлемент.Заголовок = ЗаголовокКнопки; КонецЕсли;
	Если ИмяКоманды <> "" Тогда НовыйЭлемент.ИмяКоманды = ИмяКоманды; КонецЕсли;
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);

	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздДинамическийСписок(Форма,
	ИмяСписка = "Список", 
	РодительСписка,
	ТекстЗапроса = "", 			
	ПараметрыЗапроса = Неопределено,
	ТаблицаСписка = "",
	СтруктураКолонок = Неопределено,                 
	СтруктураСвойств = Неопределено,
	СтруктураСобытий = Неопределено,
	СвояКоманднаяПанель = ЛОЖЬ,
	ЭлементПеред = Неопределено
	) Экспорт
																																				
	СоздатьРеквизит(Форма,ИмяСписка,ОписаниеТипаДинамическийСписок());             
	РеквизитДинамическийСписок = Форма[ИмяСписка]; 
	Если ТекстЗапроса = "" Тогда
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ЛОЖЬ;
		РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка;
	Иначе
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ИСТИНА;
		РеквизитДинамическийСписок.ТекстЗапроса = ТекстЗапроса;
		Если ТаблицаСписка <> "" Тогда РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка; КонецЕсли;		
	КонецЕсли;
	
	ЕслиСтруктураНеопределеноТоНовая(ПараметрыЗапроса);
	УстановитьПараметрыЗапросу(РеквизитДинамическийСписок,ПараметрыЗапроса);
	
	ТаблицаФормы = СздТаблицаФормы(Форма,ИмяСписка,РодительСписка,ИмяСписка,СтруктураКолонок,СтруктураСвойств,СтруктураСобытий,СвояКоманднаяПанель,ЭлементПеред); 
	
	Возврат ТаблицаФормы;
	
КонецФункции 

Функция СздКолонкаТаблицыФормы(Форма,
	ИмяКолонки,
	Родитель,
	ТипКолонки = 0,
	Заголовок = "",
	ПутьКДанным,
	ОтображатьШапку = ИСТИНА,
	ОтображатьПодвал = ЛОЖЬ,
	СтруктураСвойств = Неопределено,
	СтруктураСобытий = Неопределено,
	ЭлементПеред = Неопределено
	) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСобытий);
	ОпределитьЭлементФормы(Форма,Родитель);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);

	Если ТипКолонки <> 0 Тогда
		НаборВидов = "ПолеНадписи		
		|ПолеФлажка
		|ПолеКартинки";
		ВидПоля = СокрЛП(СтрПолучитьСтроку(НаборВидов,ТипКолонки));
	Иначе
		ВидПоля = "ПолеВвода";
	КонецЕсли;	
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяКолонки,Тип("ПолеФормы"),Родитель,ЭлементПеред);
	НовыйЭлемент.Вид = ВидПоляФормы[ВидПоля];	
	НовыйЭлемент.ПутьКДанным = ПутьКДанным;
	НовыйЭлемент.ОтображатьВШапке = ОтображатьШапку;
	НовыйЭлемент.ОтображатьВПодвале = ОтображатьПодвал;

	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	УстановитьСобытияЭлементу(НовыйЭлемент,СтруктураСобытий);
	
	Возврат НовыйЭлемент;
		
КонецФункции	

Функция СздТаблицаФормы(Форма,
	ИмяТаблицы,
	РодительТаблицы,
	ПутьКДанным,
	СтруктураКолонок = Неопределено,                 
	СтруктураСвойств = Неопределено,
	СтруктураСобытий = Неопределено,
	СвояКоманднаяПанель = ЛОЖЬ,
	ЭлементПеред = Неопределено
	) Экспорт	
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураКолонок);
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСобытий);
	ОпределитьЭлементФормы(Форма,РодительТаблицы);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);	
	
	Если СвояКоманднаяПанель Тогда
		ГруппаДинамическогоСписка = СздГруппаОбычнаяБезОтображения(Форма,"ДополнительнаяГруппаКоманднаяПанель" + ИмяТаблицы,РодительТаблицы,1,1,1,,ЭлементПеред);
		КоманднаяПанельСписка  = СздГруппаКоманднаяПанель(Форма,ИмяТаблицы + "КоманднаяПанель2",ГруппаДинамическогоСписка);
		ТаблицаФормы = СоздатьЭлементФормы(Форма,ИмяТаблицы,Тип("ТаблицаФормы"),ГруппаДинамическогоСписка);
		ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Иначе
		ТаблицаФормы = СоздатьЭлементФормы(Форма,ИмяТаблицы,Тип("ТаблицаФормы"),РодительТаблицы,ЭлементПеред);
	КонецЕсли;
				
	ТаблицаФормы.ПутьКДанным = ПутьКДанным; 
	 
	СоздатьКолонкиДляТаблицыФормы(Форма,ТаблицаФормы,СтруктураКолонок);
	
	УстановитьСвойстваЭлементу(ТаблицаФормы,СтруктураСвойств);
	УстановитьСобытияЭлементу(ТаблицаФормы,СтруктураСобытий);
	
	Возврат ТаблицаФормы;
	
КонецФункции

Функция СздГруппаКолонокТаблицыФормы(Форма,
	ИмяГруппы,
	РодительГруппы,
	ГруппировкаГруппы = 0,
	РастягиватьГоризонтально = 0,
	ОтображатьВШапке = ЛОЖЬ,
	Заголовок = "",
	СтруктураСвойств = Неопределено,
	ЭлементПеред = Неопределено) Экспорт
	
	ЕслиСтруктураНеопределеноТоНовая(СтруктураСвойств);		
	ОпределитьЭлементФормы(Форма,РодительГруппы);
	ОпределитьЭлементФормы(Форма,ЭлементПеред);
	
	НовыйЭлемент = СоздатьЭлементФормы(Форма,ИмяГруппы,Тип("ГруппаФормы"),РодительГруппы,ЭлементПеред);                  
	НовыйЭлемент.Вид = ВидГруппыФормы.ГруппаКолонок;
	НовыйЭлемент.ОтображатьВШапке = ОтображатьВШапке;
	НовыйЭлемент.Заголовок = Заголовок;
	
	ПолучитьСостояниеГруппировкиКолонкиЭлемента(НовыйЭлемент,ГруппировкаГруппы);
	ПолучитьСостояниеРастягиванияЭлементаПоГоризонтали(НовыйЭлемент,РастягиватьГоризонтально);	
	
	УстановитьСвойстваЭлементу(НовыйЭлемент,СтруктураСвойств);
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция СздВыпадающийСписок(Форма,
	ИмяСписка,
	РодительСписка,
	ЗаголовокЭлемента = "",
	МассивЗначений,
	РедактированиеТекста = ЛОЖЬ,
	СтруктураСвойств = Неопределено,
	СтруктураСобытий = Неопределено,
	ЭлементПеред = Неопределено
	) Экспорт
	
	СоздатьРеквизит(Форма,ИмяСписка,ОписаниеТипаСтрока(100)); 
	НовыйРеквизит = Форма[ИмяСписка]; 
	НовыйЭлемент = СздПоле(Форма,ИмяСписка,РодительСписка,ЗаголовокЭлемента,1,ИмяСписка,СтруктураСвойств,СтруктураСобытий,ЭлементПеред);
	НовыйЭлемент.КнопкаВыпадающегоСписка = ИСТИНА; 
	
	Для Каждого текЭлемент Из МассивЗначений Цикл
		НовыйЭлемент.СписокВыбора.Добавить(текЭлемент);	
	КонецЦикла;
	
	Если ЗаголовокЭлемента <> "" Тогда НовыйЭлемент.Заголовок = ЗаголовокЭлемента; КонецЕсли;

	НовыйЭлемент.РедактированиеТекста = РедактированиеТекста;
	
	Возврат НовыйЭлемент;	
		
КонецФункции

//@skip-check method-too-many-params
Функция СздПереключатель(Форма,
	ИмяПереключателя,
	РодительЭлемента,
	ЗаголовокЭлемента = "",
	МассивЗначений,
	тВидПереключателя,
	СтруктураСвойств = Неопределено,
	СтруктураСобытий = Неопределено,
	ЭлементПеред = Неопределено
	) Экспорт
	
	СоздатьРеквизит(Форма,ИмяПереключателя,ОписаниеТипаЧисло(10,0)); 
//	НовыйРеквизит = Форма[ИмяПереключателя]; 
	НовыйЭлемент = СздПоле(Форма,ИмяПереключателя,РодительЭлемента,ЗаголовокЭлемента,4,ИмяПереключателя,СтруктураСвойств,СтруктураСобытий,ЭлементПеред);

	Если ЗаголовокЭлемента <> "" Тогда НовыйЭлемент.Заголовок = ЗаголовокЭлемента; КонецЕсли;
	
	Если тВидПереключателя <> 0 Тогда
		НаборВидов = "Переключатель
		|Тумблер";		
		ВидПоля = СокрЛП(СтрПолучитьСтроку(НаборВидов,тВидПереключателя));
		НовыйЭлемент.ВидПереключателя = ВидПереключателя[ВидПоля];
	КонецЕсли;	
	
	Счетчик = 0;
	Для Каждого текЭлемент Из МассивЗначений Цикл
		НовыйЭлемент.СписокВыбора.Добавить(Счетчик,текЭлемент);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Возврат НовыйЭлемент;	
		
КонецФункции

#КонецОбласти

#Область УдалениеЭлементовИРеквизитов

Процедура УдлРеквизиты(Форма,МассивУдаляемыхРеквизитов) Экспорт
	Форма.ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов); 	
КонецПроцедуры
	
Процедура УдлРеквизит(Форма,ИмяРеквизита) Экспорт 
	МассивУдаляемыхРеквизитов = Новый Массив;
	МассивУдаляемыхРеквизитов.Добавить(ИмяРеквизита);
	УдлРеквизиты(Форма,МассивУдаляемыхРеквизитов);	
КонецПроцедуры

Процедура УдлЭлементы(Форма,МассивУдаляемыхЭлементов) Экспорт
	Для Каждого текЭлемент Из МассивУдаляемыхЭлементов Цикл
		Если Форма.Элементы.Найти(текЭлемент) <> Неопределено Тогда
			Форма.Элементы.Удалить(Форма.Элементы[текЭлемент]);
		КонецЕсли;		
	КонецЦикла;	 	
КонецПроцедуры
	
Процедура УдлЭлемент(Форма,ИмяЭлемента) Экспорт 
	МассивУдаляемыхЭлементов = Новый Массив;
	МассивУдаляемыхЭлементов.Добавить(ИмяЭлемента);
	УдлЭлементы(Форма,МассивУдаляемыхЭлементов);	
КонецПроцедуры

Процедура УдлРеквизитИЭлемент(Форма,ИмяРеквизитаЭлемента) Экспорт
	УдлРеквизит(Форма,ИмяРеквизитаЭлемента);
	УдлЭлемент(Форма,ИмяРеквизитаЭлемента);
КонецПроцедуры

#КонецОбласти

#Область Свойства

Функция СтруктураСвойствОсновные(Заголовок = "",
	Вид = Неопределено,
	ПутьКДанным = "",
	ПоложениеЗаголовка = Неопределено,
	Видимость = Неопределено,
	Доступность = Неопределено,
	ТолькоПросмотр = Неопределено,
	ПропускатьПриВводе = Неопределено,
	АктивизироватьПоУмолчанию = Неопределено,
	Маска = "",
	РежимПароля = Неопределено,
	МногострочныйРежим = Неопределено,
	РасширенноеРедактирование = Неопределено,
	Гиперссылка = Неопределено) Экспорт
	
	СтруктураСвойств = Новый Структура;
	
	Если Заголовок <> "" Тогда СтруктураСвойств.Вставить("Заголовок",Заголовок) КонецЕсли;
	Если Вид <> Неопределено Тогда СтруктураСвойств.Вставить("Вид",Вид) КонецЕсли;
	Если ПутьКДанным <> "" Тогда СтруктураСвойств.Вставить("ПутьКДанным",ПутьКДанным) КонецЕсли;
	Если ПоложениеЗаголовка <> Неопределено Тогда СтруктураСвойств.Вставить("ПоложениеЗаголовка",ПоложениеЗаголовка) КонецЕсли;
	Если Видимость <> Неопределено Тогда СтруктураСвойств.Вставить("Видимость",Видимость) КонецЕсли;
	Если Доступность <> Неопределено Тогда СтруктураСвойств.Вставить("Доступность",Доступность) КонецЕсли;
	Если ТолькоПросмотр <> Неопределено Тогда СтруктураСвойств.Вставить("ТолькоПросмотр",ТолькоПросмотр) КонецЕсли;
	Если ПропускатьПриВводе <> Неопределено Тогда СтруктураСвойств.Вставить("ПропускатьПриВводе",ПропускатьПриВводе) КонецЕсли;
	Если АктивизироватьПоУмолчанию <> Неопределено Тогда СтруктураСвойств.Вставить("АктивизироватьПоУмолчанию",АктивизироватьПоУмолчанию) КонецЕсли;
	Если Маска <> "" Тогда СтруктураСвойств.Вставить("Маска",Маска) КонецЕсли;
	Если РежимПароля <> Неопределено Тогда СтруктураСвойств.Вставить("РежимПароля",РежимПароля) КонецЕсли;
	Если МногострочныйРежим <> Неопределено Тогда СтруктураСвойств.Вставить("МногострочныйРежим",МногострочныйРежим) КонецЕсли;
	Если РасширенноеРедактирование <> Неопределено Тогда СтруктураСвойств.Вставить("РасширенноеРедактирование",РасширенноеРедактирование) КонецЕсли;
	Если Гиперссылка <> Неопределено Тогда СтруктураСвойств.Вставить("Гиперссылка",Гиперссылка) КонецЕсли;
	
	Возврат СтруктураСвойств;
	
КонецФункции

Функция СтруктураСвойствПодсказка(Подсказка = Неопределено,
	ОтображениеПодсказки = Неопределено,
	ПодсказкаВвода = Неопределено) Экспорт
	
	СтруктураСвойств = Новый Структура;
	
	Если Подсказка <> Неопределено Тогда СтруктураСвойств.Вставить("Подсказка",Подсказка) КонецЕсли;
	Если ОтображениеПодсказки <> Неопределено Тогда СтруктураСвойств.Вставить("ОтображениеПодсказки",ОтображениеПодсказки) КонецЕсли;
	Если ПодсказкаВвода <> Неопределено Тогда СтруктураСвойств.Вставить("ПодсказкаВвода",ПодсказкаВвода) КонецЕсли;
	
	Возврат СтруктураСвойств;
	
КонецФункции

Функция СтруктураСвойствРасположение(Ширина = Неопределено,
	Высота = Неопределено,
	АвтоМаксимальнаяШирина = Неопределено,
	МаксимальнаяШирина = Неопределено,
	АвтоМаксимальнаяВысота = Неопределено,
	МаксимальнаяВысота = Неопределено,
	РастягиватьПоГоризонтали = Неопределено,
	РастягиватьПоВертикали = Неопределено,
	тГоризонтальноеПоложение = Неопределено,
	тГоризонтальноеПоложениеВШапке = Неопределено,
	тГоризонтальноеПоложениеВПодвале = Неопределено) Экспорт
	
	СтруктураСвойств = Новый Структура;
	
	Если Ширина <> Неопределено Тогда СтруктураСвойств.Вставить("Ширина",Ширина) КонецЕсли;
	Если Высота <> Неопределено Тогда СтруктураСвойств.Вставить("Высота",Высота) КонецЕсли;
	Если АвтоМаксимальнаяШирина <> Неопределено Тогда СтруктураСвойств.Вставить("АвтоМаксимальнаяШирина",АвтоМаксимальнаяШирина) КонецЕсли;
	Если МаксимальнаяШирина <> Неопределено Тогда СтруктураСвойств.Вставить("МаксимальнаяШирина",МаксимальнаяШирина) КонецЕсли;
	Если АвтоМаксимальнаяВысота <> Неопределено Тогда СтруктураСвойств.Вставить("АвтоМаксимальнаяВысота",АвтоМаксимальнаяВысота) КонецЕсли;
	Если МаксимальнаяВысота <> Неопределено Тогда СтруктураСвойств.Вставить("МаксимальнаяВысота",МаксимальнаяВысота) КонецЕсли;	
	Если РастягиватьПоГоризонтали <> Неопределено Тогда СтруктураСвойств.Вставить("РастягиватьПоГоризонтали",РастягиватьПоГоризонтали) КонецЕсли;
	Если РастягиватьПоВертикали <> Неопределено Тогда СтруктураСвойств.Вставить("РастягиватьПоВертикали",РастягиватьПоВертикали) КонецЕсли;	
	Если тГоризонтальноеПоложение <> Неопределено Тогда СтруктураСвойств.Вставить("ГоризонтальноеПоложение",ПолучитьГоризонтальноеПоложение(тГоризонтальноеПоложение)) КонецЕсли;	
	Если тГоризонтальноеПоложениеВШапке <> Неопределено Тогда СтруктураСвойств.Вставить("ГоризонтальноеПоложениеВШапке",ПолучитьГоризонтальноеПоложение(тГоризонтальноеПоложениеВШапке)) КонецЕсли;	
	Если тГоризонтальноеПоложениеВПодвале <> Неопределено Тогда СтруктураСвойств.Вставить("ГоризонтальноеПоложениеВПодвале",ПолучитьГоризонтальноеПоложение(тГоризонтальноеПоложениеВПодвале)) КонецЕсли;	
	
	Возврат СтруктураСвойств;
	
КонецФункции                                     

Функция СтруктураСвойствТаблицыФормы(Отображение = Неопределено,
	РежимВводаСтрок = Неопределено,
	РежимВыделения = Неопределено,
	РежимВыделенияСтроки = Неопределено,
	Шапка = Неопределено,
	Подвал = Неопределено,
	АвтоВводНовойСтроки = Неопределено,
	ВысотаВСтрокахТаблицы = Неопределено) Экспорт
	
	СтруктураСвойств = Новый Структура;
	
	Если Отображение <> Неопределено Тогда СтруктураСвойств.Вставить("Отображение",Отображение) КонецЕсли;
	Если РежимВводаСтрок <> Неопределено Тогда СтруктураСвойств.Вставить("РежимВводаСтрок",РежимВводаСтрок) КонецЕсли;
	Если РежимВыделения <> Неопределено Тогда СтруктураСвойств.Вставить("РежимВыделения",РежимВыделения) КонецЕсли;
	Если РежимВыделенияСтроки <> Неопределено Тогда СтруктураСвойств.Вставить("РежимВыделенияСтроки",РежимВыделенияСтроки) КонецЕсли;
	Если Шапка <> Неопределено Тогда СтруктураСвойств.Вставить("Шапка",Шапка) КонецЕсли;
	Если Подвал <> Неопределено Тогда СтруктураСвойств.Вставить("Подвал",Подвал) КонецЕсли;
	Если АвтоВводНовойСтроки <> Неопределено Тогда СтруктураСвойств.Вставить("АвтоВводНовойСтроки",АвтоВводНовойСтроки) КонецЕсли;	
	Если ВысотаВСтрокахТаблицы <> Неопределено Тогда СтруктураСвойств.Вставить("ВысотаВСтрокахТаблицы",ВысотаВСтрокахТаблицы) КонецЕсли;
	
	Возврат СтруктураСвойств;	
	
КонецФункции

#КонецОбласти