#Область ОбработчикиСобытий

#Область ОбработчикиФормы

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.Стандартная Тогда
		Представление = СтрШаблон("%1; %2", Данные.Заказчик, Данные.Наименование);
	ИначеЕсли Данные.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.ДляКомпании Тогда
		Представление = СтрШаблон("%1: %2", "Для компании", Данные.Наименование); 
	ИначеЕсли Данные.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.Демо Тогда
		Представление = СтрШаблон("%1: %2; %3", "ДЕМО", Данные.Заказчик, Данные.Наименование); 
	ИначеЕсли Данные.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.Аутсорс Тогда
		Представление = СтрШаблон("%1: %2; %3", "АУТСОРС", Данные.Заказчик, Данные.Наименование); 
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры //ОбработкаПолученияПредставления

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Заказчик");
	Поля.Добавить("ТипЗадачи");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры //ОбработкаПолученияПолейПредставления

#КонецОбласти

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеФункцииИПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
КонецПроцедуры //ДобавитьКомандыПечати

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры //Печать

#КонецОбласти

#КонецЕсли