
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда                     
		
		ЗаполнитьСписокКураторов();
		ЗаполнитьСписокРуководителейЗадачи();
		
		СостояниеЗадачи = Перечисления.ЦБР_Состояние.Черновик;     
		
		ЗаполнитьИсполнителейПоШаблону();
		
		Элементы.ВидЗадачиСтандартная.Пометка = Истина;  
		Элементы.ВидЗадачиПоБазе.Пометка = Ложь; 
		Объект.ВидЗадачи = Перечисления.ЦБР_ВидЗадачи.Стандартная; 
		Объект.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.Стандартная; 
	Иначе       
		СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, Пользователи.АвторизованныйПользователь());
		Если СостояниеЗадачи = Перечисления.ЦБР_Состояние.Черновик Тогда 
			ЗаполнитьСписокКураторов();
		КонецЕсли;
	КонецЕсли;

	УстановитьВидимостьЭлементов();    

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьРольВЗадаче();
	УстановитьТипЗаказчика(Объект.ВидЗадачи);
    УстановитьПометкиКнопокТипЗадачиИТипОценки(); 
	ОбновитьЗадачу(); 

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОписаниеЗадачи        = ТекущийОбъект.ОписаниеЗадачи.Получить();
	СостояниеЗадачи       = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, Пользователи.АвторизованныйПользователь());
	ПредсогласованныеЧасы = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПредсогласованныеЧасы(Объект.Ссылка);       
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если ПараметрыЗаписи.Свойство("БезВопросов") Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ОписаниеЗадачи = Новый ХранилищеЗначения(ОписаниеЗадачи);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьЗадачу();
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_Файл" Тогда
		ЗаполнитьИконкиФайлов();
	ИначеЕсли ИмяСобытия = "Запись_ЗаписьКалендаря" ИЛИ 
				ИмяСобытия = "Задача_Согласование" ИЛИ
				ИмяСобытия = "ЗакрытиеЧата" ИЛИ
				ИмяСобытия = "ЗакрытиеДокЗадания" Тогда
		ЭтаФорма.Прочитать();
        ОбновитьЗадачу();      
		УстановитьВидимостьЭлементов();	    
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		Оповестить("Запись_ЗаписьЗадания");   
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КураторПриИзменении(Элемент)

	Роль = ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.КураторИсполнителя");
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Куратор) Тогда

		НайденаяСтрока = Объект.Команда.НайтиСтроки(Новый Структура("Роль", Роль));
		Если НайденаяСтрока.Количество() Тогда
			Для Каждого Строка Из НайденаяСтрока Цикл
				Строка.Исполнитель = Объект.Куратор;
			КонецЦикла;
		КонецЕсли;
		Объект.РуководительЗадачи = Объект.Куратор;
	Иначе
		ПоискПользователяВКоманде(Объект.Куратор, Роль);
	КонецЕсли;
	
	Если Не Объект.Стартовала Тогда
		Объект.Стартовала = ВРаботе(Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьСрокиПриИзменении(Элемент)
	//УстановитьВидимостьЭлементовДереваЗаданий();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	
	ЗаполнитьИсполнителейПоШаблону();
	ЗаполнитьДанныеПоКонфигурациям();

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Не ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		Возврат;
	КонецЕсли;

	Если Лев(ДанныеСобытия.Href, СтрДлина("v8doc:")) <> "v8doc:" Тогда
		НавигационнаяСсылкаПоля = ДанныеСобытия.Href;
	Иначе
		НавигационнаяСсылкаПоля = Сред(ДанныеСобытия.Href, СтрДлина("v8doc:") + 1);
	КонецЕсли;

	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаПоля);

КонецПроцедуры

&НаКлиенте
Процедура ТипОценкиЗадачиПриИзменении(Элемент)
	
	Если Объект.ТипОценкиЗадачи <> ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.Предсогласованные") Тогда
		Объект.ПредсогласованныеЧасы = 0;
		ВидимостьЭлементаПредсогласованныеЧасы = Ложь;
	Иначе
		ВидимостьЭлементаПредсогласованныеЧасы = Истина;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредсогласованныеЧасы", "Видимость", ВидимостьЭлементаПредсогласованныеЧасы); 
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадачиПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоВидуЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительАутсорсПриИзменении(Элемент)
	УстановитьКуратораПоИсполнителю();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЗаданий

&НаКлиенте
Процедура ДеревоЗаданийПриАктивизацииСтроки(Элемент)
    ТекущаяСтрока = Элементы.ДеревоЗаданий.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда 
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоКонтекстноеМеню", "Видимость", Ложь); 
        Возврат;
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоКонтекстноеМеню", "Видимость", Истина);   
    КонецЕсли;
    
    Если ТекущаяСтрока <> Неопределено Тогда
       Если ТекущаяСтрока.Состояние <> Неопределено И ТекущаяСтрока.ЭтоГруппа <> Неопределено И ТекущаяСтрока.ПометкаУдаления <> Неопределено Тогда 
           СвойстваЭтапа = Новый Структура;
           СвойстваЭтапа.Вставить("Состояние",         ТекущаяСтрока.Состояние);
           СвойстваЭтапа.Вставить("ЭтоГруппа",         ТекущаяСтрока.ЭтоГруппа);
           СвойстваЭтапа.Вставить("ПометкаУдаления",   ТекущаяСтрока.ПометкаУдаления);
		   СвойстваЭтапа.Вставить("ЕстьЗадание",       ЗначениеЗаполнено(ТекущаяСтрока.СсылкаНаЗадание));
            
           ЦБР_ВидимостьДоступностьЭлементовФормыКлиент.ВидимостьКонтекстногоМенюВЗадаче(ЭтотОбъект, РольВЗадаче, СвойстваЭтапа); 
       КонецЕсли;
    КонецЕсли;  
        
    Если ТекущаяСтрока.Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.НаСогласованииОценки")
        ИЛИ ТекущаяСтрока.Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.НаСогласованииСроков")
        ИЛИ ТекущаяСтрока.Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.НаСогласовании") Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийСогласованиеОтменить", "Видимость", Не ТекущаяСтрока.ЭтоГруппа);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийСогласованиеОтменить", "Видимость", Ложь);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ТекущаяСтрока.СсылкаНаЗадание) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость",  Не ТекущаяСтрока.ЭтоГруппа);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийСогласованиеОтменить", "Видимость", Ложь);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Ложь);
    КонецЕсли;
    
    Если ТекущаяСтрока.Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Выполнен") Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗаданийКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Ложь);
    КонецЕсли; 
                
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданийДеревоОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
		
	Если Не ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		СтандартнаяОбработка = Ложь;            
	Иначе  
		УстановитьВидимостьКонтектногоМенюВспискеЗаданий(Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонфигурации

&НаКлиенте
Процедура КонфигурацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Конфигурации.ТекущиеДанные;

	МассивКонструктораКлюча = Новый Массив;
	МассивКонструктораКлюча.Добавить(Новый Структура("Клиент,Конфигурация,РегистрационныйНомер", Объект.Заказчик,
		ТекущаяСтрока.Конфигурация, ТекущаяСтрока.РегистрационныйНомер));

	КлючЗаписиРегистра = Новый ("РегистрСведенийКлючЗаписи._центрКонфигурацииКлиентов", МассивКонструктораКлюча);
	Оповещение = Новый ОписаниеОповещения("ОбновитьКонфигурацииВЗадаче", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений._центрКонфигурацииКлиентов.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписиРегистра),
		ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
          
&НаКлиенте
Процедура ОтменитьСогласованныйЭтап(Команда)
 
	//ОчиститьСообщения();  
    
	//ТекущаяСтрока = Элементы.ДеревоЗаданий.ТекущиеДанные; 
	//Сообщение = Новый СообщениеПользователю;
	//Если ТекущаяСтрока.Состояние <> ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Согласован")Тогда
	//    Сообщение.Текст = СтрШаблон("Вы не можете отменить согласование этапа: %1
	//                                |Так как его состояние не ""Согласован""", 
	//                                "" + ТекущаяСтрока.НомерЗаданияВУровне + " " + "" + ТекущаяСтрока.СсылкаНаСтруктуру);  
	//    Сообщение.Сообщить();
	//    Возврат;                            

	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;
	
	ТрудозатратыФакт = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные, "ТрудозатратыФакт");  

	Если ТрудозатратыФакт > 0 Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя отменить согласование этапа, так как есть выполненные часы.");	
        Возврат;
    КонецЕсли; 
    
    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("СсылкаНаЗадание", ТекущиеДанные);
        Оповещение = Новый ОписаниеОповещения("ОтменитьЭтапПослеОтвета", ЭтотОбъект, ДополнительныеПараметры);
    
    ПоказатьВопрос(Оповещение, 
    "Отменяем согласованный этап?", 
    РежимДиалогаВопрос.ДаНет, 
    0 , 
    КодВозвратаДиалога.Нет);
    
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьВзаимодействие(Команда)
	
	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ВариантРаботыФормы, ФизЛицоСотрудника, ЗадачаСсылка, ЗаданиеСсылка", "КалендарьСотрудника",
		ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПользователиКлиент.ТекущийПользователь(),
		"ФизическоеЛицо"), Объект.Ссылка, ТекущиеДанные);
	
	ИмяФормыКалендаря = "Справочник.ЦБР_ЗаписиРабочегоКалендаря.Форма.Календарь";
	ФормаКалендаря = ПолучитьФорму(ИмяФормыКалендаря, ПараметрыФормы);
	Если ФормаКалендаря.Открыта() Тогда
		ФормаКалендаря.ЗадачаСсылка  = ПараметрыФормы.ЗадачаСсылка;
		ФормаКалендаря.ЗаданиеСсылка = ПараметрыФормы.ЗаданиеСсылка;
		ФормаКалендаря.Открыть();
	Иначе
		ФормаКалендаря = Неопределено; 
		ОткрытьФорму(ИмяФормыКалендаря, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)

	//ТекущаяСтрока = Элементы.ДеревоЗаданий.ТекущиеДанные;
	Оповещение = Новый ОписаниеОповещения("ОбновитьДеревоЗаданийОповещение", ЭтотОбъект);
	//Если ТекущаяСТрока <> Неопределено Тогда
		//ПараметрыОткрытия = Новый Структура("Ссылка, Задание, ЭтоГруппа", Объект.Ссылка,
		//	ТекущаяСтрока.СсылкаНаСтруктуру, Истина);
	//Иначе
		ПараметрыОткрытия = Новый Структура("Ссылка, ЭтоГруппа", Объект.Ссылка, Истина);
	//КонецЕсли;
	//ОткрытьФорму("Справочник.ЦБР_СтруктураЗадач.ФормаГруппы", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение,
	//	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадание(Команда)
	
	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьДеревоЗаданийОповещение", ЭтотОбъект);

	Если ЗначениеЗаполнено(ТекущиеДанные) И  ТипЗнч(ТекущиеДанные) = Тип("СправочникСсылка.ЦБР_СтруктураЗадач") Тогда
		ПараметрыОткрытия = Новый Структура("Ссылка, Задание, Команда", Объект.Ссылка, ТекущиеДанные,
			ПолучитьМассивИсполнителей());   
	Иначе   
		ПараметрыОткрытия = Новый Структура("Ссылка, Команда", Объект.Ссылка, ПолучитьМассивИсполнителей());
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЦБР_Задание.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоЗаданий(Команда)
	
	ОбновитьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонфигурациюКлиента(Команда)

	ЭлементыОтбора  = Новый Структура("Клиент", Объект.Заказчик);

	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	Оповещение = Новый ОписаниеОповещения("ОбновитьКонфигурацииВЗадаче", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений._центрКонфигурацииКлиентов.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура Стартовать(Команда)

	Оповещать = Не ВРаботе();

	Объект.Стартовала = Истина;

	Структура = Новый Структура;
	Структура.Вставить("Период");
	Структура.Вставить("Задача");
	Структура.Вставить("Куратор");
	Структура.Вставить("ПринятоВРаботу");
	Структура.Вставить("ПричинаОтказа");

	Структура.Период = ТекущаяДата();
	Структура.Задача = Объект.Ссылка;
	Структура.Куратор =  Объект.Куратор;
	Структура.ПринятоВРаботу = Объект.Стартовала;
	СоздатьЗаписьВРегистрСтарт(Структура);

	ПараметрыЗаписи = Новый Структура("РежимЗаписи");
	ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;

	Если Не Записать(ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;

	Если Оповещать Тогда
		Получатели = Новый Массив;
		Получатели.Добавить(Объект.Постановщик);
		СообщениеВОбсуждение("Старт", Получатели);
	КонецЕсли;

	УстановитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗадачу(Команда)

	Подсказка = "Причина отказа:";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаПричиныОтказа", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, ПричинаОтказа, Подсказка, 0, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИсполнителя(Команда)

	Оповещение = Новый ОписаниеОповещения("ДобавитьИсполнителяЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ЦБР_Задача.Форма.ФормаПодбораИсполнителей", , ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
   
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИсполнителя(Команда)
	МассивИсполнителей = Новый Массив;

	Для Каждого Строка Из Объект.Команда Цикл
		Если Строка.Роль = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_РольВЗадаче.Исполнитель")
			Или Строка.Роль = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_РольВЗадаче.ИсполнительРазработчик") 
			Или Строка.Роль = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_РольВЗадаче.ИсполнительАналитик") Тогда
			МассивИсполнителей.Добавить(Строка.Исполнитель);
		КонецЕсли;
	КонецЦикла;

	Оповещение = Новый ОписаниеОповещения("УдалитьИсполнителяЗавершение", ЭтотОбъект);
	НовыеПараметры = Новый Структура("ЭтоУдаление, МассивИсполнителей", Истина, МассивИсполнителей);
	ОткрытьФорму("Справочник.ЦБР_Задача.Форма.ФормаПодбораИсполнителей", НовыеПараметры, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиЗадачу(Команда)
	ПараметрыФормы = Новый Структура("Куратор", Объект.Куратор);
	ОткрытьФорму("Справочник.ЦБР_Задача.Форма.ФормаПеревода", Параметрыформы, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ПеревестиЗадачуПослеЗакрытия", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСобытиеПоЗадаче(Команда)

	ПараметрыФормы = Новый Структура("ВариантРаботыФормы, ФизЛицоСотрудника, ЗадачаСсылка", "КалендарьСотрудника",
									ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПользователиКлиент.ТекущийПользователь(),
									"ФизическоеЛицо"), Объект.Ссылка);
	ОткрытьФорму("Справочник.ЦБР_ЗаписиРабочегоКалендаря.Форма.Календарь", ПараметрыФормы);   
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВИсториюОС(Команда)
	
	ПараметрыОтбора = Новый Структура("ЗаданиеСсылка", Объект.Ссылка);
	ОткрытьФОрму("Справочник.ЦБР_ЗаписиРабочегоКалендаря.ФормаСписка", ПараметрыОтбора, ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
		
КонецПроцедуры

&НаКлиенте
Процедура командаЗапросИнформации(Команда)
	
	ЕстьСтартованныеДействия = ЦБР_СтатусыОбъектовПолныеПрава.ЕстьСтартованныеДействия(Объект.Ссылка);
	Если ЕстьСтартованныеДействия Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Чтобы закрыть задание, необходимо закрыть все ОС");
		Возврат;
	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Задание", Объект.Ссылка);
	СтруктураПараметров.Вставить("Заявитель", ПользователиКлиент.ТекущийПользователь());
	СтруктураПараметров.Вставить("Ответчик", Объект.Постановщик);

	Оповещение = Новый ОписаниеОповещения("УточнениеЗавершение", ЭтотОбъект);

	ОткрытьФорму("РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.Форма.ФормаУточнения", СтруктураПараметров, ЭтотОбъект,
		, , , Оповещение);
КонецПроцедуры

&НаКлиенте
Асинх Процедура командаОтменитьЗапросИнформации(Команда)
	Результат = Ждать ВопросАсинх("Отменить Запрос информации?",  РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтменитьЗапросИнформацииНаСервере();
		ОбновитьЗадачу();
		УстановитьВидимостьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьОценку(Команда)
	
	//ВыделенныеСтроки = Элементы.ДеревоЗаданий.ВыделенныеСтроки;

	//Если ВыделенныеСтроки = Неопределено Тогда
	//	Возврат;
	//КонецЕсли; 
	//	
	//Для Каждого Стр Из ВыделенныеСтроки Цикл
	//	
	//	ТекущиеДанные = ДеревоЗаданий.НайтиПоИдентификатору(Стр);   
	//	
	//	Если ТекущиеДанные.ЭтоГруппа Тогда
	//		Продолжить;
	//	КонецЕсли;

	//	СсылкаСтруктурыЗадания = ТекущиеДанные.СсылкаНаСтруктуру;
	//	ОценкаСогласована = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СсылкаСтруктурыЗадания,
	//	"ОценкаСогласована");
	//	
	//	Если ОценкаСогласована Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Оценка этапа уже согласована");
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Если ВыделенныеСтроки.Количество() = 1 Тогда
	//		ОтправитьНаСогласованиеНаСервере(СсылкаСтруктурыЗадания, Истина, Истина);
	//	Иначе
	//		ОтправитьНаСогласованиеНаСервере(СсылкаСтруктурыЗадания, Истина);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//ОбновитьДеревоЗаданийНаКлиенте();       
	//ОбновитьЗадачу();      
	//УстановитьВидимостьЭлементов();

КонецПроцедуры

//&НаКлиенте
//Процедура СогласоватьВсе(Команда)
	
	//СогласоватьВсеНаСервере();
	//ОбновитьДеревоЗаданийНаКлиенте(); 
	//ОбновитьЗадачу();      
	//УстановитьВидимостьЭлементов();

//КонецПроцедуры 

//&НаКлиенте
//Процедура СогласоватьСроки(Команда)
	//ТекущиеДанные = Элементы.ДеревоЗаданий.ТекущиеДанные;

	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;

	//СсылкаСтруктурыЗадания = ТекущиеДанные.СсылкаНаСтруктуру;
	//Результат = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(СсылкаСтруктурыЗадания,
	//	"ОценкаСогласована, СрокиСогласованы");

	//Если Не Результат.ОценкаСогласована Тогда
	//	Возврат;
	//КонецЕсли;

	//Если Результат.СрокиСогласованы Тогда
	//	Возврат;
	//КонецЕсли;

	//ОтправитьНаСогласованиеНаСервере(СсылкаСтруктурыЗадания, Ложь);
	//ОбновитьДеревоЗаданийНаКлиенте();
//КонецПроцедуры

&НаКлиенте
Процедура СогласованиеОтменить(Команда)

	ТекущиеДанные = Элементы.ДеревоЗаданий.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОтменитьСогласованиеНаСервере(ТекущиеДанные.СсылкаНаСтруктуру);
	ОбновитьДеревоЗаданийНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПодчиненныйЭтап(Команда)
	ТекущиеДанные = Элементы.ДеревоЗаданий.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ОбновитьДеревоЗаданийОповещение", ЭтотОбъект);

	ПараметрыОткрытия = Новый Структура("Ссылка, Задание, ПредыдущееЗадание, Команда", Объект.Ссылка, ТекущиеДанные.СсылкаНаСтруктуру, ТекущиеДанные.СсылкаНаСтруктуру,ПолучитьМассивИсполнителей());
	ОткрытьФорму("Справочник.ЦБР_СтруктураЗадач.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКодРевью(Команда)
	ТекущиеДанные = Элементы.ДеревоЗаданий.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СоздатьЭтапНаСервере(ТекущиеДанные.СсылкаНаСтруктуру, ПредопределенноеЗначение(
		"Перечисление.ЦБР_ТипЗадания.КодРевью"));
	ОбновитьДеревоЗаданийНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестирование(Команда)
	ТекущиеДанные = Элементы.ДеревоЗаданий.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СоздатьЭтапНаСервере(ТекущиеДанные.СсылкаНаСтруктуру, ПредопределенноеЗначение(
		"Перечисление.ЦБР_ТипЗадания.Тестирование"));
	ОбновитьДеревоЗаданийНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЧасыКЗаданию(Команда)

	ТекущиеДанные = Элементы.ДеревоЗаданий.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("СсылкаНаСтруктуру",
		ТекущиеДанные.СсылкаНаСтруктуру));
	НовыеПараметры = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(ТекущиеДанные.СсылкаНаСтруктуру, "ТрудозатратыПлан,
																											   | ТрудозатратыПланОт, ТрудозатратыПланДо,ТрудозатратыПланКомментарий, ВидЧаса, НетГарантии, ОплатаПоФакту");
	НовыеПараметры.Вставить("ТолькоПросмотр", ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(
		ТекущиеДанные.СсылкаНаСтруктуру, "ОценкаСогласована") Или ТекущиеДанные.Состояние
		= ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_Состояние.НаСогласованииОценки"));
	ОткрытьФорму("Справочник.ЦБР_СтруктураЗадач.Форма.ФормаОценкиЭтапа", НовыеПараметры, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЭтап(Команда)

	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ЦБР_ЗадачиЗаданияВызовСервера.ПроверитьВозможностьЗакрытия(ТекущиеДанные) Тогда      
		Возврат;
	КонецЕсли;
	
	ЦБР_ЗадачиЗаданияВызовСервера.ПроверкаЗаполнениеПодчиненныхЭтапов(ТекущиеДанные);
	
	ЦБР_ЗадачиЗаданияВызовСервера.ЗавершитьЗадание(ТекущиеДанные);  
	
	ОбновитьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭтап(Команда)

	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;         
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СсылкаНаЗадание", ТекущиеДанные);
	Оповещение = Новый ОписаниеОповещения("ОповещениеВопросУдалитьЭтап", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(Оповещение, 
	"Удалить этап безвозвратно?", 
	РежимДиалогаВопрос.ДаНет, 
	0 , 
	КодВозвратаДиалога.Нет);    
	
КонецПроцедуры  

&НаКлиенте
Процедура ОповещениеВопросУдалитьЭтап(Результат, ПараметрыЗаписи) Экспорт
	
	
	Если Результат = КодВозвратаДиалога.Да Тогда   
		Если ПроверкаНаУдалениеПрошла(ПараметрыЗаписи.СсылкаНаЗадание) Тогда
			УдалитьЗаданиеНаСервере(ПараметрыЗаписи.СсылкаНаЗадание);  
			ОбновитьЗадачу();
		Иначе   
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя удалять этап, от которого зависят другие этапы.");			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверкаНаУдалениеПрошла(СсылкаНаЗадание) 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПредыдущееЗадание", СсылкаНаЗадание);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_Задание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЦБР_Задание КАК ЦБР_Задание
	|ГДЕ
	|	ЦБР_Задание.ПредыдущееЗадание = &ПредыдущееЗадание";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;    
	Иначе
		Возврат Ложь;
	КонецЕсли;   

КонецФункции

&НаСервере
Процедура УдалитьЗаданиеНаСервере(СсылкаНаЗадание) 

	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектСтруктура = СсылкаНаЗадание.СсылкаНаСтруктуру.ПолучитьОбъект();  
	ОбъектСтруктура.Удалить();

	ОбъектЗадача = СсылкаНаЗадание.ПолучитьОбъект();    
	ОбъектЗадача.Удалить();   
	
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусыЗадачи(Объект.Ссылка);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУдаленные(Команда)
	ОтображатьУдаленные = Не ОтображатьУдаленные;
	Элементы.ДеревоЗаданийОтображатьУдаленные.Пометка = ОтображатьУдаленные;
    ОбновитьДеревоЗаданийНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Уведомление(Команда)
	Массив = Новый Массив;
	Для каждого Участник Из Объект.Команда Цикл
	Массив.Добавить(Участник.Исполнитель);
	КонецЦикла;
	ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(Массив);
	ОткрытьФорму("Справочник.ЦБР_Задача.Форма.ФормаУведомления", Новый Структура("Команда, Задача", Массив, Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗадачу(Команда) 
	
	ЦБР_ЗадачиЗаданияВызовСервера.ЗакрытьЗадачу(Объект.Ссылка);
	ОбновитьЗадачу();
	УстановитьВидимостьЭлементов();  
		
КонецПроцедуры

&НаКлиенте
Процедура Реанимировать(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьПослеРеанимации", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Ссылка, Команда", Объект.Ссылка, ПолучитьМассивИсполнителей());
	
	ПоследнийИсполнитель = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПоследнегоИсполнителяЗадачи(Объект.Ссылка);
	Если ПоследнийИсполнитель <> Неопределено Тогда
		ПараметрыОткрытия.Вставить("Исполнитель", ПоследнийИсполнитель);
	КонецЕсли;	
	
	ОткрытьФорму("Документ.ЦБР_Задание.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьЗадание(Команда)
	ТекущиеДанные = Элементы.ДеревоЗаданий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаНаЗадание) Тогда 
		ЦБР_ЗадачиЗаданияВызовСервера.РазбитьЗадание(ТекущиеДанные.СсылкаНаЗадание);
		ОбновитьДеревоЗаданийНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьРеализации(Команда)
	
	ПараметрыФормы = Новый Структура("КлиентОтбора", Объект.Заказчик);
	ОткрытьФорму("Обработка.ЦБР_АРМПрикрепленияРеализаций.Форма.ФормаНовая", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадачиСтандартная(Команда)
	Элементы.ВидЗадачиСтандартная.Пометка = Истина;  
	Элементы.ВидЗадачиПоБазе.Пометка = Ложь; 
	Объект.ВидЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ВидЗадачи.Стандартная");
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадачиПоБазе(Команда)
	Элементы.ВидЗадачиСтандартная.Пометка = Ложь;  
	Элементы.ВидЗадачиПоБазе.Пометка = Истина;    
	Объект.ВидЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ВидЗадачи.ДляКомпании");
КонецПроцедуры

&НаКлиенте
Процедура ОценкаСтандартная(Команда)  
	
	Элементы.ОценкаСтандартная.Пометка = Истина;  
	Элементы.ОценкаПоФакту.Пометка = Ложь;   
	Элементы.ОценкаПредсогласована.Пометка = Ложь;    
	Объект.ТипОценкиЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.Стандартная");   
	ТипОценкиОбновитьНаКлиенте();  
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаПоФакту(Команда)      
	
	Элементы.ОценкаСтандартная.Пометка = Ложь;  
	Элементы.ОценкаПоФакту.Пометка = Истина;   
	Элементы.ОценкаПредсогласована.Пометка = Ложь;    
	Объект.ТипОценкиЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.ПоФакту");   
	ТипОценкиОбновитьНаКлиенте();   
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаПредсогласована(Команда)     
	
	Элементы.ОценкаСтандартная.Пометка = Ложь;  
	Элементы.ОценкаПоФакту.Пометка = Ложь;   
	Элементы.ОценкаПредсогласована.Пометка = Истина;    
	Объект.ТипОценкиЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.Предсогласованные");   
	ТипОценкиОбновитьНаКлиенте();  
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнениеЭтапа(Команда)
	
    ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьВыполнениеЗаданияСервер(ТекущиеДанные);  
	ОбновитьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧасыИРеализации(Команда)
	
	ПараметрыФормы = Новый Структура("СсылкаНаЗадачу", Объект.Ссылка);
	ОткрытьФорму("Справочник.ЦБР_Задача.Форма.ФормаУчетаЧасовИРеализаций", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции   

&НаКлиенте
Процедура ТипОценкиОбновитьНаКлиенте()
	
	Если Объект.ТипОценкиЗадачи <> ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.Предсогласованные") Тогда
		Объект.ПредсогласованныеЧасы = 0;
		ВидимостьЭлементаПредсогласованныеЧасы = Ложь;
	Иначе
		ВидимостьЭлементаПредсогласованныеЧасы = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредсогласованныеЧасы", "Видимость", ВидимостьЭлементаПредсогласованныеЧасы); 
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрыОткрытия(СтруктураЗадачи)

    ПараметрыОткрытия = Новый Структура;  
    ПараметрыОткрытия.Вставить("Пересогласование", Истина);
    ПараметрыОткрытия.Вставить("ТолькоПросмотр", Ложь);
    ПараметрыОткрытия.Вставить("ТрудозатратыПлан", СтруктураЗадачи.ТрудозатратыПлан);
    ПараметрыОткрытия.Вставить("ТрудозатратыПланОт", СтруктураЗадачи.ТрудозатратыПланОт);
    ПараметрыОткрытия.Вставить("ТрудозатратыПланДо", СтруктураЗадачи.ТрудозатратыПланДо);
    ПараметрыОткрытия.Вставить("ТрудозатратыПланКомментарий", СтруктураЗадачи.ТрудозатратыПланКомментарий);
    ПараметрыОткрытия.Вставить("ВидЧаса", СтруктураЗадачи.ВидЧаса);
    ПараметрыОткрытия.Вставить("НетГарантии", СтруктураЗадачи.НетГарантии);
    ПараметрыОткрытия.Вставить("ОплатаПоФакту", СтруктураЗадачи.ОплатаПоФакту); 
    ПараметрыОткрытия.Вставить("ТрудозатратыФакт", СтруктураЗадачи.ТрудозатратыФакт); 
    
    Возврат ПараметрыОткрытия;

КонецФункции

//&НаКлиенте
//Процедура ПересогласоватьЭтапПослеОценки(Результат, Параметры) Экспорт

//    Если Результат = Неопределено Тогда
//        Элементы.ДеревоЗаданий.ВыделенныеСтроки.Добавить(ВыделеннаяСтрока);
//        Возврат; 
//    КонецЕсли;
//    
//    ТекущиеДанные = Элементы.ДеревоЗаданий.ТекущиеДанные;
//                                                                  
//    ЗаменитьОценку(ТекущиеДанные.СсылкаНаСтруктуру, Результат); 
//    
//    ОтправитьНаСогласованиеНаСервере(ТекущиеДанные.СсылкаНаСтруктуру, Истина);
//    
//    ОбновитьЗадачу();
//    
//    Элементы.ДеревоЗаданий.ВыделенныеСтроки.Добавить(ВыделеннаяСтрока); 
//	
//КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданиеВручную()

	ЗаданиеСсылка = ЦБР_ЗадачиЗаданияВызовСервера.СоздатьНовоеЗадание(Элементы.ДеревоЗаданий.ТекущиеДанные.СсылкаНаСтруктуру);
	
	ОбновитьЗадачу();
	
	ПараметрыФормы = Новый Структура("ВариантРаботыФормы, ФизЛицоСотрудника, ЗадачаСсылка, ЗаданиеСсылка","КалендарьСотрудника",
	ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПользователиКлиент.ТекущийПользователь(),
	"ФизическоеЛицо"), Объект.Ссылка, ЗаданиеСсылка);
	
	ОткрытьФорму("Справочник.ЦБР_ЗаписиРабочегоКалендаря.Форма.Календарь", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаменитьОценку(СтруктураЗадачи, Результат);

    ОбъектСтруктуры = СтруктураЗадачи.ПолучитьОбъект();
    Для Каждого Параметр ИЗ Результат Цикл
        ОбъектСтруктуры[Параметр.Ключ] = Параметр.Значение;
	КонецЦикла; 
    ОбъектСтруктуры.ТрудозатратыПланПредставление = СтрШаблон("%1",Результат.ТрудозатратыПлан); 
    ОбъектСтруктуры.ОценкаСогласована = Ложь;
    ОбъектСтруктуры.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЭтапПослеОтвета(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтменитьЭтапПослеОтветаНаСервере(Параметры); 
		ОбновитьЗадачу();
	КонецЕсли; 
    
КонецПроцедуры  

&НаСервере
Процедура ОтменитьЭтапПослеОтветаНаСервере(ДопПараметры)
	
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(ДопПараметры.СсылкаНаЗадание, Перечисления.ЦБР_Состояние.Отменен);	
 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадачу()

	Если Не Объект.Ссылка.Пустая() Тогда 
		СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, ПользователиКлиент.АвторизованныйПользователь());
		
		Если Объект.Приложения.Количество() > 0 Тогда  
			ЗаполнитьИконкиФайлов();
		КонецЕсли;
		
		Если Объект.Стартовала Тогда
			СписокЗаданийДерево = ВывестиСписокЗаданийДеревоНаСервере();	
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()

	ЦБР_ВидимостьДоступностьЭлементовФормы.УстановитьВидимостьТолькоПросмотрУЭлементовФормы(ЭтотОбъект); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);    

	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПередатьВРаботу", "Видимость", Истина);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаРеквизиты", "Видимость", Истина);       
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаРеквизиты", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОбзор", "Видимость", Ложь); 
	Иначе
		
		СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, ПараметрыСеанса.АвторизованныйПользователь);
		
		Если СостояниеЗадачи = Перечисления.ЦБР_Состояние.Черновик Тогда
			ЭлементПередатьВРаботу =  Истина;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаРеквизиты", "Видимость", Истина); 
		Иначе
			ЭлементПередатьВРаботу =  Ложь;	
			
			Если Объект.Стартовала  Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОбзор", "Видимость", Ложь); 
			Иначе             
				ПолучитьОбзорПроекта();
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОбзор", "Видимость", Истина); 
				Если Объект.Приложения.Количество() > 0 Тогда  
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОбзорВертикально", "Видимость", Истина); 
				Иначе   
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОбзорВертикально", "Видимость", Ложь); 
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПередатьВРаботу", "Видимость", ЭлементПередатьВРаботу);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоВидуЗадачи()
	
	Если Объект.ВидЗадачи = Перечисления.ЦБР_ВидЗадачи.Стандартная Тогда 
		
	ИначеЕсли Объект.ВидЗадачи = Перечисления.ЦБР_ВидЗадачи.Аутсорс Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоманднаяПанельОписание", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОписаниеЗадачи", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБ24", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКонфигурации", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Куратор", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТипОценкиЗадачи", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСрокиПоФакту", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсполнительАутсорс", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаРеквизиты", "Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПериодАутсорс", "Видимость", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиКнопокТипЗадачиИТипОценки();                                                         
	
	Если Объект.ТипОценкиЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.Стандартная") Тогда   
		Элементы.ОценкаСтандартная.Пометка = Истина;  
		Элементы.ОценкаПоФакту.Пометка = Ложь;   
		Элементы.ОценкаПредсогласована.Пометка = Ложь;    
	ИначеЕсли Объект.ТипОценкиЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.ПоФакту") Тогда  
		Элементы.ОценкаСтандартная.Пометка = Ложь;  
		Элементы.ОценкаПоФакту.Пометка = Истина;   
		Элементы.ОценкаПредсогласована.Пометка = Ложь;    
	Иначе         
		Элементы.ОценкаСтандартная.Пометка = Ложь;  
		Элементы.ОценкаПоФакту.Пометка = Ложь;   
		Элементы.ОценкаПредсогласована.Пометка = Истина;    
	КонецЕсли;    
	
	
	Если Объект.ВидЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ВидЗадачи.Стандартная") Тогда
		Элементы.ВидЗадачиСтандартная.Пометка = Истина;  
		Элементы.ВидЗадачиПоБазе.Пометка = Ложь; 
	Иначе  
		Элементы.ВидЗадачиСтандартная.Пометка = Ложь;  
		Элементы.ВидЗадачиПоБазе.Пометка = Истина; 
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоКонфигурациям()

	ЦБР_ЗадачиЗаданияВызовСервера.ЗаполнитьДанныеПоКонфигурациям(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПродолжитьЗавершитьЗаписатьЗадачуЧерновик(Результат, ПараметрыЗаписи) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.ВзялиВРаботу = Истина;  
		
		Если Записать(ПараметрыЗаписи) Тогда
			Получатели = Новый Массив;
			Получатели.Добавить(Объект.Куратор);
			СообщениеВОбсуждение("СменаКуратора", Получатели);
			СообщениеВОбсуждение("НазначениеИсполнителя", Получатели);
			
			ОтправитьСообщенияВОбщееОбсуждение(Получатели);
			
			Закрыть();
		Иначе
			СостояниеЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Черновик");
			Объект.ВзялиВРаботу = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоЗаданийНаКлиенте()
	
	
	//СписокЗаданийДерево = ВывестиСписокЗаданийДеревоНаСервере();
	
	//ВывестиДеревоЗаданийНаСервере();
	//СвернутьРазвернутьДерево(ДеревоЗаданий.ПолучитьЭлементы(), Истина);

КонецПроцедуры

&НаСервере
Функция ВывестиСписокЗаданийДеревоНаСервере()          
	
	ТабДок = Новый ТабличныйДокумент;
    Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Макет");   

	ТитулНазваниеЗадачи = Макет.ПолучитьОбласть("ТитулНазваниеЗадачи");  
	ТитулНазваниеЗадачи.Параметры.НазваниеЗадачи = Объект.Наименование;   
	ТитулНазваниеЗадачи.Параметры.СтатусЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, Пользователи.АвторизованныйПользователь()); 
	ТабДок.Вывести(ТитулНазваниеЗадачи);

	ОбластьОписаниеЗадачи = Макет.ПолучитьОбласть("ОписаниеЗадачи");  
	ОбластьОписаниеЗадачи.Параметры.ОписаниеЗадачи = ОписаниеЗадачи.ПолучитьТекст();   
	ТабДок.Вывести(ОбластьОписаниеЗадачи);
	
    Шапка = Макет.ПолучитьОбласть("Шапка");
    ТабДок.Вывести(Шапка);
	
	СтатусыЗаписейКалендаря = Новый Массив;
	СтатусыЗаписейКалендаря.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Новый);
	СтатусыЗаписейКалендаря.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал);
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("СсылкаНаЗадачу", Объект.Ссылка);  
	Запрос.Параметры.Вставить("СтатусыЗаписейКалендаря", СтатусыЗаписейКалендаря);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦБР_ЗаписиРабочегоКалендаря.ЗаданиеСсылка КАК ЗаданиеСсылка,
	               |	ЦБР_ЗаписиРабочегоКалендаря.ЗадачаСсылка КАК ЗадачаСсылка,
	               |	МИНИМУМ(ЦБР_ЗаписиРабочегоКалендаря.ДатаНачала) КАК ДатаНачала,
	               |	МИНИМУМ(ЦБР_ЗаписиРабочегоКалендаря.Ссылка) КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_События
	               |ИЗ
	               |	Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
	               |ГДЕ
	               |	ЦБР_ЗаписиРабочегоКалендаря.ЗадачаСсылка = &СсылкаНаЗадачу
	               |	И ЦБР_ЗаписиРабочегоКалендаря.Статус В (&СтатусыЗаписейКалендаря)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦБР_ЗаписиРабочегоКалендаря.ЗаданиеСсылка,
	               |	ЦБР_ЗаписиРабочегоКалендаря.ЗадачаСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЦБР_СостоянияЗаданий.Задание КАК Задание,
	               |	МАКСИМУМ(ЦБР_СостоянияЗаданий.Состояние) КАК Состояние
	               |ПОМЕСТИТЬ ВТ_Состояния
	               |ИЗ
	               |	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦБР_СостоянияЗаданий.Задание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЦБР_Задание.Наименование КАК СсылкаНаСтруктуру,
	               |	ЦБР_СтруктураЗадач.ЭтоГруппа КАК ЭтоГруппа,
	               |	ЦБР_Задание.ПредыдущееЗадание.Исполнитель КАК Аналитик,
	               |	ЦБР_Задание.Исполнитель КАК Исполнитель,
	               |	ЦБР_Задание.НомерЗаданияВУровне КАК НомерЗаданияВУровне,
	               |	ЦБР_Задание.ЕстьПрикрепленныйФайл КАК ЕстьПрикрепленныйФайл,
	               |	ЦБР_Задание.ПредыдущееЗадание.Наименование КАК ПредыдущееЗадание,
	               |	ВЫБОР
	               |		КОГДА ЦБР_Задание.РамочнаяОценка
	               |			ТОГДА ЦБР_Задание.ТрудозатратыПланПредставление 
	               |		КОГДА ЦБР_Задание.ОплатаПоФакту
	               |			ТОГДА ЦБР_Задание.ТрудозатратыПланПредставление 
	               |		ИНАЧЕ ЦБР_Задание.ТрудозатратыПлан
	               |	КОНЕЦ КАК ТрудозатратыПланПредставление,
	               |	ЦБР_Задание.Ссылка КАК СсылкаНаЗадание,
	               |	ЦБР_Задание.КоментарийКСогласованию КАК КоментарийКСогласованию,
	               |	ЦБР_Задание.ТрудозатратыФакт КАК ТрудозатратыФакт,
	               |	ЦБР_Задание.КомментарийОценки КАК КомментарийОтказа,
				   //|	""("" + ЦБР_Задание.ПредыдущееЗадание.НомерЗаданияВУровне + "")"" + "" "" + ЦБР_Задание.ПредыдущееЗадание.Наименование КАК ПредыдущееЗаданиеПредставление,
	               |	ЦБР_Задание.ПредыдущееЗадание.Наименование КАК ПредыдущееЗаданиеПредставление,
				   |	ВТ_События.Ссылка КАК СсылкаОС,
	               |	ВТ_События.ДатаНачала КАК БлижайшееСобытие,
	               |	ЦБР_Задание.ТрудозатратыПланОт КАК ТрудозатратыПланОт,
	               |	ЦБР_Задание.ТрудозатратыПланДо КАК ТрудозатратыПланДо,
	               |	ЦБР_Задание.РамочнаяОценка КАК РамочнаяОценка,
	               |	ЦБР_Задание.ТрудозатратыПлан КАК ТрудозатратыПлан,
	               |	ЦБР_СтруктураЗадач.Ссылка КАК Ссылка,
	               |	ЦБР_СтруктураЗадач.НомерЗаданияВУровне КАК НомерЗаданияВУровнеГруппа,  
	               |	ЦБР_СтруктураЗадач.КодСДР КАК КодСДР,
	               |	ЦБР_Задание.ЧасыСогласованы КАК ЧасыСогласованы,
	               |	ВТ_Состояния.Состояние КАК Состояние,
	               |	ЦБР_Задание.ЧасыСогласованы КАК ЧасыСогласованы1
	               |ИЗ
	               |	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЦБР_Задание КАК ЦБР_Задание
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_События КАК ВТ_События
	               |			ПО (ВТ_События.ЗаданиеСсылка = ЦБР_Задание.Ссылка)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Состояния КАК ВТ_Состояния
	               |			ПО ЦБР_Задание.Ссылка = ВТ_Состояния.Задание
	               |		ПО ЦБР_СтруктураЗадач.СсылкаНаЗадание = ЦБР_Задание.Ссылка
	               |ГДЕ
	               |	ЦБР_СтруктураЗадач.Владелец = &СсылкаНаЗадачу
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка ИЕРАРХИЯ";

   	ВыгрузкаДЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ВыгрузкаДЗ.Строки.Сортировать("КодСДР ВОЗР", Истина);
	
	ИтогоТрудозатратыПланПредставление = 0;  
	ИтогоТрудозатратыФакт = 0;

	ПодвалОценка       = 0;
	ПодвалСогласовано  = 0;
	ПодвалВыполнено    = 0;
	ПодвалОсталось     = 0;

    НомерПП = 1;
	Для Каждого СтрокаДерева из ВыгрузкаДЗ.Строки Цикл        
 		Если СтрокаДерева.Строки.Количество() > 0 ИЛИ СтрокаДерева.ЭтоГруппа Тогда          
			Шапка = Макет.ПолучитьОбласть("Группа");  
			Шапка.Параметры.Заполнить(СтрокаДерева); 
			ТабДок.Вывести(Шапка);
			Для Каждого подстрокаДерева Из СтрокаДерева.Строки Цикл    
				
				Если подстрокаДерева.Состояние = Перечисления.ЦБР_Состояние.НеСогласован Тогда        
					ОбластьОтказа = Макет.ПолучитьОбласть("КомментарийОтказа");  
					ОбластьОтказа.Параметры.Заполнить(подстрокаДерева);      
					ТабДок.Вывести(ОбластьОтказа);
				КонецЕсли;
				
				Строка = ОбработатьСтрокуТабличнойЧасти(Макет.ПолучитьОбласть("Подстрока"), подстрокаДерева, "Подстрока");
				ТабДок.Вывести(Строка);
				
				Если НЕ подстрокаДерева.ЭтоГруппа Тогда 
					РасчетПоказателейЗадачи(подстрокаДерева);
				КонецЕсли;
			КонецЦикла; 
		Иначе    
			
			Если СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.НеСогласован Тогда        
				ОбластьОтказа = Макет.ПолучитьОбласть("КомментарийОтказа");  
				ОбластьОтказа.Параметры.Заполнить(СтрокаДерева);   
				ТабДок.Вывести(ОбластьОтказа);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДерева.ПредыдущееЗадание) Тогда
				Строка = ОбработатьСтрокуТабличнойЧасти(Макет.ПолучитьОбласть("СтрокаПодзадача"), СтрокаДерева, "СтрокаПодзадача");
			Иначе
				Строка = ОбработатьСтрокуТабличнойЧасти(Макет.ПолучитьОбласть("Строка"), СтрокаДерева, "Строка");
			КонецЕсли;     
			Строка.Параметры.НомерЗаданияВУровне = НомерПП;	
			ТабДок.Вывести(Строка);
			
			Если НЕ СтрокаДерева.ЭтоГруппа Тогда  
				РасчетПоказателейЗадачи(СтрокаДерева); 
			КонецЕсли; 
			НомерПП = НомерПП + 1;
		КонецЕсли;
	КонецЦикла;

	ПредсогласованныеЧасы = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПредсогласованныеЧасы(Объект.Ссылка);       
	
	Если ПредсогласованныеЧасы > 0 Тогда
	     ПодвалСогласовано = ПредсогласованныеЧасы;
	КонецЕсли;	 
	
	ПодвалОсталось   = ПодвалСогласовано - ПодвалВыполнено;    
	
	МассивИсполнителей                      = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьИсполнителей(Объект.Ссылка);
	Элементы.ДекорацияИсполнители.Заголовок = СтрШаблон("Исполнители: %1%2", Символы.ПС, СтрСоединить(МассивИсполнителей, Символы.ПС));
	
	Возврат ТабДок; 

КонецФункции

&НаСервере
Функция ОбработатьСтрокуТабличнойЧасти(Строка, СтрокаДерева, ШаблонСтроки)    
	
	Строка.Параметры.Заполнить(СтрокаДерева); 
	
	Если Объект.Постановщик = Пользователи.АвторизованныйПользователь() И 
		СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.НаСогласовании Тогда
		Строка.Параметры.Состояние = "Согласовать";
		
		Строка.Области["Состояние"+ШаблонСтроки].Гиперссылка = Истина;
		Строка.Области["Состояние"+ШаблонСтроки].Шрифт = Новый Шрифт("Calibri", 9, , ,Истина , );
		Строка.Области["Состояние"+ШаблонСтроки].ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
	
	Если СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.НеСогласован Тогда
		Строка.Области["Состояние"+ШаблонСтроки].ЦветТекста = Новый Цвет(255, 0, 0);
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.СостояниеЕстьПроблемыОпределенияПоступленияГосИС;
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.НаСогласовании Тогда 
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.CRM_ПиктограммаТрендаНеопределен;
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.Согласован Тогда  
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.СостояниеПоступилоГосИС;
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.Выполнен Тогда
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.ТипБулево;
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.ВРаботе И СтрокаДерева.ЧасыСогласованы  Тогда
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.СостояниеПоступилоГосИС;   
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.ВРаботе И Не СтрокаДерева.ЧасыСогласованы  Тогда
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.сфпПрослушатьЗапись; 
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.Запланировано И СтрокаДерева.ЧасыСогласованы  Тогда
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.СостояниеПоступилоГосИС; 
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.Новый И СтрокаДерева.ЧасыСогласованы  Тогда
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.СостояниеПоступилоГосИС; 
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.ЗапросИнформации Тогда
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.Справка;  
	ИначеЕсли СтрокаДерева.Состояние = Перечисления.ЦБР_Состояние.Отменен Тогда
		Строка.Области["Состояние"+ШаблонСтроки].Картинка 	= БиблиотекаКартинок.ОтказГосИС;  
		Строка.Области[ШаблонСтроки+"Аналитик"].Шрифт 		= ШрифтыСтиля.ЦБР_ОтмененныйЭтап;
		Строка.Области[ШаблонСтроки+"Задание"].Шрифт 		= ШрифтыСтиля.ЦБР_ОтмененныйЭтап;	 
		Строка.Области[ШаблонСтроки+"Исполнитель"].Шрифт	= ШрифтыСтиля.ЦБР_ОтмененныйЭтап;	
		Строка.Области[ШаблонСтроки+"Номер"].Шрифт 			= ШрифтыСтиля.ЦБР_ОтмененныйЭтап;	
		Строка.Области[ШаблонСтроки+"Оценка"].Шрифт 		= ШрифтыСтиля.ЦБР_ОтмененныйЭтап;	
	КонецЕсли;
	
	Возврат Строка; 
	
КонецФункции

&НаСервере 
Процедура РасчетПоказателейЗадачи(СтрокаДерева)    
	
	Если СтрокаДерева.Состояние <> Перечисления.ЦБР_Состояние.Отменен Тогда
		Если СтрокаДерева.РамочнаяОценка Тогда
			ПодвалОценка = ПодвалОценка + СтрокаДерева.ТрудозатратыПланДо;
		Иначе    
			ПодвалОценка = ПодвалОценка + СтрокаДерева.ТрудозатратыПлан;
		КонецЕсли; 
		
		Если СтрокаДерева.ЧасыСогласованы Тогда
			ПодвалСогласовано = ПодвалСогласовано + СтрокаДерева.ТрудозатратыПлан;
		КонецЕсли;
	КонецЕсли;
	
	ПодвалВыполнено = ПодвалВыполнено + СтрокаДерева.ТрудозатратыФакт;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоЗаданийОповещение(Результат, ДопПараметры) Экспорт

	ОбновитьДеревоЗаданийНаКлиенте();
    ОбновитьЗадачу();      
    УстановитьВидимостьЭлементов();
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПослеРеанимации(Результат, ДопПараметры) Экспорт

	ОбновитьДеревоЗаданийНаКлиенте();
    ОбновитьЗадачу();      
    УстановитьВидимостьЭлементов();
	
	СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, ПользователиКлиент.АвторизованныйПользователь());
	
	Если СостояниеЗадачи <> ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Выполнен")
		Или СостояниеЗадачи <> ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Закрыт") Тогда
		
		ЦБР_ЗадачиЗаданияВызовСервера.РеанимироватьЗадачу(Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКураторов()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦБР_ГруппыСотрудников.Руководитель КАК Руководитель,
	|	ЦБР_ГруппыСотрудников.Наименование КАК Наименование,
	|	ЦБР_ГруппыСотрудников.Руководитель.Наименование КАК РуководительНаименование
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников КАК ЦБР_ГруппыСотрудников
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элементы.Куратор.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Руководитель, ВыборкаДетальныеЗаписи.Наименование
			+ " (" + ВыборкаДетальныеЗаписи.РуководительНаименование + ")");
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРуководителейЗадачи()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦБР_ГруппыСотрудников.Руководитель КАК Руководитель,
	|	ЦБР_ГруппыСотрудников.Руководитель.Наименование КАК РуководительНаименование
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников КАК ЦБР_ГруппыСотрудников";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элементы.РуководительЗадачи.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Руководитель,
			ВыборкаДетальныеЗаписи.РуководительНаименование);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейПоШаблону()

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Заказчик", ?(ЗначениеЗаполнено(Объект.Заказчик), Объект.Заказчик,
		Справочники.Партнеры.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ВидЗадачи", Объект.ВидЗадачи);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦБР_СоответствиеКуратораТипуЗадач.ВидЗадачи КАК ВидЗадачи,
	|	ЦБР_СоответствиеКуратораТипуЗадач.Заказчик КАК Заказчик,
	|	ЦБР_СоответствиеКуратораТипуЗадач.Исполнитель КАК Исполнитель,
	|	ЦБР_СоответствиеКуратораТипуЗадач.РуководительЗадачи КАК РуководительЗадачи,
	|	ЦБР_СоответствиеКуратораТипуЗадач.Куратор КАК Куратор,
	|	ЕстьNULL(ЦБР_ГруппыСотрудниковСостав.Разработчик, Ложь) КАК Разработчик,
	|	ЕстьNULL(ЦБР_ГруппыСотрудниковСостав.Аналитик, Ложь) КАК Аналитик
	|ИЗ
	|	РегистрСведений.ЦБР_СоответствиеКуратораТипуЗадач КАК ЦБР_СоответствиеКуратораТипуЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
	|		ПО (ЦБР_СоответствиеКуратораТипуЗадач.Исполнитель = ЦБР_ГруппыСотрудниковСостав.Пользователь)
	|ГДЕ
	|	ЦБР_СоответствиеКуратораТипуЗадач.ВидЗадачи = &ВидЗадачи
	|	И ЦБР_СоответствиеКуратораТипуЗадач.Заказчик = &Заказчик";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Получатели = Новый Массив;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.РуководительЗадачи) Тогда
			Объект.РуководительЗадачи = Выборка.РуководительЗадачи;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Куратор) Тогда
			Объект.Куратор = Выборка.Куратор;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Исполнитель) Тогда
			Если Выборка.Разработчик И Выборка.Аналитик Тогда
				Роль = Перечисления.ЦБР_РольВЗадаче.Исполнитель;
			ИначеЕсли Выборка.Разработчик Тогда
				Роль = Перечисления.ЦБР_РольВЗадаче.ИсполнительРазработчик;
			ИначеЕсли Выборка.Аналитик Тогда
				Роль = Перечисления.ЦБР_РольВЗадаче.ИсполнительАналитик;
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Для исполнителя " + Выборка.Исполнитель + " не заполнена роль в справочнике ""Группы сотрудников""!
																								 | Обратитесь к администратору!");
			КонецЕсли;
			ПоискПользователяВКоманде(Выборка.Исполнитель, Роль);
			УстановитьРуководителяИсполнителя(Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя, Выборка.Исполнитель);
			Получатели.Добавить(Выборка.Исполнитель);
		КонецЕсли;
	КонецЕсли;    
		
КонецПроцедуры

&НаСервере
Процедура ПоискПользователяВКоманде(Исполнитель, Роль)
	
	НайденаяСтрока = Объект.Команда.НайтиСтроки(Новый Структура("Исполнитель", Исполнитель));
	Если НайденаяСтрока.Количество() Тогда
		Для Каждого Строка Из НайденаяСтрока Цикл
			Если Строка.Роль = Роль Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
		ДобавитьЗаписьВТЧКоманда(Исполнитель, Роль);
	Иначе
		ДобавитьЗаписьВТЧКоманда(Исполнитель, Роль);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВТЧКоманда(Исполнитель, Роль)
	НоваяСтрока = Объект.Команда.Добавить();
	НоваяСтрока.Исполнитель = Исполнитель;
	НоваяСтрока.Роль = Роль;	
КонецПроцедуры

&НаСервере
Процедура УстановитьРуководителяИсполнителя(Роль, Сотрудник)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Параметр = Новый СписокЗначений;
	Параметр.Добавить(Справочники.ФизическиеЛица.ПолучитьСсылку(
	Новый УникальныйИдентификатор("4BE28F6C-B867-11E5-82AD-240A646EA964")));// Темнов Андрей Алекcандрович (Справочники.ФизическиеЛица)
	Параметр.Добавить(Справочники.ФизическиеЛица.ПолучитьСсылку(
	Новый УникальныйИдентификатор("6506DCC2-2E22-11E2-8F7F-005056C00008")));// Стеблева Юлия Владимировна (Справочники.ФизическиеЛица)
	Запрос.УстановитьПараметр("РуководителиПодразделений", Параметр);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтруктураПредприятия.ТекущийРуководитель КАК ТекущийРуководитель,
	|	ВЫБОР
	|		КОГДА СтруктураПредприятия.Родитель.ТекущийРуководитель В (&РуководителиПодразделений)
	|			ТОГДА СтруктураПредприятия.ТекущийРуководитель
	|		ИНАЧЕ СтруктураПредприятия.Родитель.ТекущийРуководитель
	|	КОНЕЦ КАК РуководительОтдела
	|ПОМЕСТИТЬ ВТ_ФизЛица
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|		ПО Пользователи.Подразделение = СтруктураПредприятия.Ссылка
	|ГДЕ
	|	Пользователи.Ссылка = &Ссылка
	|	И Пользователи.ФизическоеЛицо <> СтруктураПредприятия.ТекущийРуководитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекРуководитель.Ссылка КАК ТекущийРуководитель,
	|	РукОтдела.Ссылка КАК РуководительОтдела
	|ИЗ
	|	ВТ_ФизЛица КАК ВТ_ФизЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ТекРуководитель
	|		ПО ВТ_ФизЛица.ТекущийРуководитель = ТекРуководитель.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК РукОтдела
	|		ПО ВТ_ФизЛица.РуководительОтдела = РукОтдела.ФизическоеЛицо";
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ТекущийРуководитель = Выборка.РуководительОтдела Тогда
			ПоискПользователяВКоманде(Выборка.ТекущийРуководитель, Роль);
		Иначе
			ПоискПользователяВКоманде(Выборка.ТекущийРуководитель, Роль);
			Если ЗначениеЗаполнено(Выборка.РуководительОтдела) Тогда
				ПоискПользователяВКоманде(Выборка.РуководительОтдела, Роль);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонкиКомментарий()

//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ИСТИНА КАК ВыводитьКоментаний
//	|ИЗ
//	|	Справочник.ЦБР_Задача.ДеревоЗаданий КАК ЦБР_ЗадачаДеревоЗаданий
//	|ГДЕ
//	|	ЦБР_ЗадачаДеревоЗаданий.Ссылка = &Ссылка
//	|	И ЦБР_ЗадачаДеревоЗаданий.КоментарийКСогласованию <> """"";
//
//	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
//
//	Результат = Запрос.Выполнить();
//
//	Если Результат.Пустой() Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗадачКоментарийКСогласованию",
//			"Видимость", Ложь);
//	Иначе
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеревоЗадачКоментарийКСогласованию",
//			"Видимость", Истина);
//	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораАналиков(Список)

	Список.Очистить();

	Для Каждого Сотрудник Из Объект.Команда Цикл
		Если Сотрудник.Роль = Перечисления.ЦБР_РольВЗадаче.Исполнитель Или Сотрудник.Роль
			= Перечисления.ЦБР_РольВЗадаче.ИсполнительАналитик Или Сотрудник.Роль
			= Перечисления.ЦБР_РольВЗадаче.ИсполнительРазработчик Тогда

			Если Сотрудник.Исполнитель = Пользователи.ТекущийПользователь() Тогда
				Продолжить;
			КонецЕсли;

			Список.Добавить(Сотрудник.Исполнитель, Сотрудник.Исполнитель);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВРаботе(ВРазрезеКуратора = Ложь)

	Если ВРазрезеКуратора Тогда
		СрезПоследних = РегистрыСведений.ЦБР_СтартОтказОтЗадач.СрезПоследних(ТекущаяДатаСеанса(),
			Новый Структура("Задача, Куратор", Объект.Ссылка, Объект.Куратор));
	Иначе
		СрезПоследних = РегистрыСведений.ЦБР_СтартОтказОтЗадач.СрезПоследних(ТекущаяДатаСеанса(),
			Новый Структура("Задача", Объект.Ссылка));
	КонецЕсли;

	Если ЗначениеЗаполнено(СрезПоследних) Тогда
		Возврат СрезПоследних[0].ПринятоВРаботу;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура СообщениеВОбсуждение(Уведомление, Получатели, ДопИнформация = "")
	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, Уведомление, Получатели, ДопИнформация);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРольВЗадаче()
	
	ПараметрыПоиска = Новый Структура("Исполнитель", ПользователиКлиент.ТекущийПользователь());
	НайденыеСтроки = Объект.Команда.НайтиСтроки(ПараметрыПоиска);

	Если НайденыеСтроки.Количество() Тогда
		РольВЗадаче = НайденыеСтроки[0].Роль;
	Иначе
		РольВЗадаче = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_РольВЗадаче.Наблюдатель");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДостуностьВсе()
	
//	СтруктураДанныхДляНастроекВидимости = ПолучитьДанныеДляНастроекВидимостиНаСервере();
//	
//	НастройкиОбщие = ЦБР_КэшированиеВызовСервера.НастрокиВидимостиДоступностиПоРолям();
//	СтруктураНастрокиПользователя = НастройкиОбщие.Получить(РольВЗадаче);
//	
//	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		ЕстьИсполнителиВЗадаче = ПолучитьНаличиеИсполнителейВЗадаче(Объект.Ссылка);
//		Если ЕстьИсполнителиВЗадаче И РольВЗадаче = ПредопределенноеЗначение(
//			"Перечисление.ЦБР_РольВЗадаче.КураторИсполнителя") Или ЕстьИсполнителиВЗадаче И РольВЗадаче
//			= ПредопределенноеЗначение("Перечисление.ЦБР_РольВЗадаче.ВладелецЗадачи") Тогда
//			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаУдалитьИсполнителя",
//				"Видимость", ЕстьИсполнителиВЗадаче);
//		КонецЕсли;
//	КонецЕсли;

	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредСогласованныеЧасы", "Видимость",
	//Объект.ТипОценкиЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.Предсогласованные"));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипЗаказчика(ВидЗадачи)

	Если Не ЗначениеЗаполнено(Объект.Заказчик) Тогда
		Если ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.Стандартная")
			Или ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.Проект")
			Или ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.Демо")
			Или ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.ИТС")
			Или ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.Аутсорс") Тогда
			УстановитьТипЭлемента("Заказчик", "СправочникСсылка.Партнеры");
		Иначе
			Объект.Заказчик = Объект.Постановщик;
		КонецЕсли;
	Иначе
		Если ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.Стандартная")
			Или ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.Проект")
			Или ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.Демо")
			Или ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.ИТС")
			Или ВидЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидЗадачи.Аутсорс") Тогда

			Если ТипЗнч(Объект.Заказчик) = Тип("СправочникСсылка.Пользователи") Тогда
				УстановитьТипЭлемента("Заказчик", "СправочникСсылка.Партнеры");
			КонецЕсли;
		Иначе
			Если ТипЗнч(Объект.Заказчик) = Тип("СправочникСсылка.Партнеры") Тогда
				УстановитьТипЭлемента("Заказчик", "СправочникСсылка.Партнеры");
			КонецЕсли;
			Объект.Заказчик = Объект.Постановщик;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьОбзорПроекта()
	
	//СостояниеЗадачи = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьАктуальныйСтатусЗадачи(Объект.Ссылка, Пользователи.АвторизованныйПользователь());
	//ПредставлениеHTML = ЦБР_ОбзорДокумента.ПолучитьОбзорПроекта(ЭтотОбъект);
	
	ТекстХТМЛ = "";
    СтруктураКартинок = Новый Структура;
    ОписаниеЗадачи.ПолучитьHTML(ТекстХТМЛ, СтруктураКартинок);
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.MultiLine = Истина;	
	RegExp.Global = Истина;	
	RegExp.IgnoreCase = Истина;
	Шаблон = "(?:<body>)([\s\S]*)(?:<\/body>)"; 
	RegExp.Pattern = Шаблон;  

	РезультатАнализаСтроки = RegExp.Execute(ТекстХТМЛ); 
	Для Каждого Выражение Из РезультатАнализаСтроки Цикл
		ТекстЗадачи = Выражение.Value;  
		ТекстЗадачи = СтрЗаменить(ТекстЗадачи,"</body>","");
		ТекстЗадачи = СтрЗаменить(ТекстЗадачи,"<body>","");
	КонецЦикла;
	
	ПредставлениеHTML = СтрЗаменить(ЦБР_ОбзорДокумента.ПолучитьОбзорПроекта(ЭтотОбъект),"&replace_text",ТекстЗадачи);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипЭлемента(ИмяЭлемента, СтрокаТипа)

	ОписаниеТипа = Новый ОписаниеТипов(СтрокаТипа);
	Элементы[ИмяЭлемента].ОграничениеТипа = ОписаниеТипа;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонфигурацииВЗадаче(Результат, ДополнительныеПараметры) Экспорт

	ЗаполнитьДанныеПоКонфигурациям();

КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВРегистрСтарт(ДанныеЗаполнения)

	МенеджерЗаписи = РегистрыСведений.ЦБР_СтартОтказОтЗадач.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаполнения);
	МенеджерЗаписи.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПричиныОтказа(Ответ, Параметры) Экспорт

	Если Ответ = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать причину отказа!", Объект.Ссылка);
		Возврат;
	КонецЕсли;

	Структура = Новый Структура;
	Структура.Вставить("Период");
	Структура.Вставить("Задача");
	Структура.Вставить("Куратор");
	Структура.Вставить("ПринятоВРаботу");
	Структура.Вставить("ПричинаОтказа");
	//@skip-check use-non-recommended-method
	Структура.Период = ТекущаяДата();
	Структура.Задача = Объект.Ссылка;
	Структура.Куратор =  Объект.Куратор;
	Структура.ПринятоВРаботу = Объект.Стартовала;
	Структура.ПричинаОтказа = Ответ;

	СоздатьЗаписьВРегистрОтказ(Структура);	
	Объект.Стартовала = ВРаботе();
	Объект.ВзялиВРаботу = ВРаботе();
	Если Не Объект.Стартовала Тогда
		СостояниеЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Перечисление.ЦБР_Состояние.Черновик");

		Получатели = Новый Массив;
		Получатели.Добавить(Объект.Постановщик);
		СообщениеВОбсуждение("Отказ", Получатели, Ответ);
	Иначе

		Получатели = Новый Массив;
		Получатели.Добавить(Объект.Куратор);
		СообщениеВОбсуждение("Отказ", Получатели, Ответ);
	КонецЕсли;

	УдалитьТекущегоКуратораИСменитьВладельцаЗадачи(ПользователиКлиент.ТекущийПользователь(), Объект.Куратор);
     
	УстановитьДостуностьВсе();

	ПараметрыЗаписи = Новый Структура("РежимЗаписи");
	ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;

	Если Не Записать(ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();

КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВРегистрОтказ(ДанныеЗаполнения)

	ПоследняяЗапись = РегистрыСведений.ЦБР_СтартОтказОтЗадач.СрезПоследних(ТекущаяДатаСеанса(),
		Новый Структура("Задача", Объект.Ссылка));

	Если ЗначениеЗаполнено(ПоследняяЗапись) Тогда
		Объект.Куратор = ПоследняяЗапись[0].Куратор;
	Иначе
		МенеджерЗаписи = РегистрыСведений.ЦБР_СтартОтказОтЗадач.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаполнения);
		МенеджерЗаписи.Записать();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьТекущегоКуратораИСменитьВладельцаЗадачи(СтарыйКуратор, НовыйКуратор)
	
	Роль = Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя;
	НайденаяСтрока = Объект.Команда.НайтиСтроки(Новый Структура("Исполнитель, Роль", СтарыйКуратор, Роль));
	Если НайденаяСтрока.Количество() Тогда
		Для Каждого Строка Из НайденаяСтрока Цикл
			Объект.Команда.Удалить(Строка);
			//Строка.Исполнитель = НовыйКуратор;
		КонецЦикла;
	КонецЕсли;

	НайденаяСтрока = Объект.Команда.НайтиСтроки(Новый Структура("Роль", Перечисления.ЦБР_РольВЗадаче.ВладелецЗадачи));
	Если НайденаяСтрока.Количество() Тогда
		Для Каждого Строка Из НайденаяСтрока Цикл
			Строка.Исполнитель = НовыйКуратор;
		КонецЦикла;
	КонецЕсли;

	Объект.РуководительЗадачи = НовыйКуратор;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИсполнителяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		МассивИсполнителей = Результат.МассивИсполнителей;
		Для Каждого Исполнитель Из МассивИсполнителей Цикл
			Если Исполнитель.Разработчик И Исполнитель.Аналитик Тогда
				Роль = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
				"Перечисление.ЦБР_РольВЗадаче.Исполнитель");
			ИначеЕсли Исполнитель.Разработчик Тогда
				Роль = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
				"Перечисление.ЦБР_РольВЗадаче.ИсполнительРазработчик");
			ИначеЕсли Исполнитель.Аналитик Тогда
				Роль = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
				"Перечисление.ЦБР_РольВЗадаче.ИсполнительАналитик");
			КонецЕсли;
			ПоискПользователяВКоманде(Исполнитель.Пользователь, Роль);
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
			Получатели = Новый Массив;
			Получатели.Добавить(Исполнитель.Пользователь);
			ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, "НазначениеИсполнителя", Получатели);
		КонецЦикла;
		
		ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();
		Если Не ЭтоКураторИлиВладелец(ТекущийПользователь) И Не ЕстьДействияИлиЭтапы(ТекущийПользователь,
			Объект.Ссылка) Тогда
			Оповещение = Новый ОписаниеОповещения("ВопросПродолжитьЗавершитьЗаписатьЗадачуПеревод", ЭтотОбъект);
			ТекстВопроса = "Вы больше не занимаетесь задачей?";
			Кнопки = РежимДиалогаВопрос.ДаНет;
			ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
		Иначе
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		КонецЕсли;
		УстановитьВидимостьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЭтоКураторИлиВладелец(Пользователь)

	НайденыеСтроки = Объект.Команда.НайтиСтроки(Новый Структура("Исполнитель", Пользователь));
	Если НайденыеСтроки.Количество() Тогда
		Для Каждого Строка Из НайденыеСтроки Цикл
			Если Строка.Роль = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
				"Перечисление.ЦБР_РольВЗадаче.КураторИсполнителя") Или Строка.Роль = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
				"Перечисление.ЦБР_РольВЗадаче.ВладелецЗадачи") Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Ложь;

КонецФункции

&НаСервере
Функция ЕстьДействияИлиЭтапы(Пользователь, Задача)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_ЗаписиРабочегоКалендаря.Ссылка КАК Ссылка,
	|	ЦБР_ЗаписиРабочегоКалендаря.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
	|ГДЕ
	|	ЦБР_ЗаписиРабочегоКалендаря.ЗадачаСсылка = &ЗадачаСсылка
	|	И ЦБР_ЗаписиРабочегоКалендаря.Статус В (&Статус)
	|	И НЕ ЦБР_ЗаписиРабочегоКалендаря.ПометкаУдаления";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ЗадачаСсылка", Задача); 
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Новый);
	МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал);
	
	Запрос.УстановитьПараметр("Статус", МассивСтатусов);  

	ЕстьОС = Не Запрос.Выполнить().Пустой();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_СтруктураЗадач.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
		|ГДЕ
		|	ЦБР_СтруктураЗадач.Владелец = &СсылкаНаЗадачу
		|	И ЦБР_СтруктураЗадач.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", Объект.Ссылка);
	
	ЕстьЭтапы = Не Запрос.Выполнить().Пустой();
	
	Возврат ЕстьОС Или ЕстьЭтапы;

КонецФункции

&НаКлиенте
Процедура ВопросПродолжитьЗавершитьЗаписатьЗадачуПеревод(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УбратьТекущегоИсполнителяИзЗадачи();
	КонецЕсли;

	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));  
	
КонецПроцедуры

&НаСервере
Процедура УбратьТекущегоИсполнителяИзЗадачи()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	НайденныеСтроки = Объект.Команда.НайтиСтроки(Новый Структура("Исполнитель", ТекущийПользователь));
	Для Каждого Строка Из НайденныеСтроки Цикл
		Если Строка.Роль = Перечисления.ЦБР_РольВЗадаче.ИсполнительАналитик 
			Или Строка.Роль = Перечисления.ЦБР_РольВЗадаче.Исполнитель 
			Или Строка.Роль = Перечисления.ЦБР_РольВЗадаче.ИсполнительРазработчик Тогда
			Объект.Команда.Удалить(Строка);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИсполнителяЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		УдалитьИсполнителяЗавершениеНаСервере(Результат);
	КонецЕсли;
	
	Записать();
	
	УстановитьВидимостьЭлементов();    
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИсполнителяЗавершениеНаСервере(Результат)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(1) КАК КоличествоЭтапов,
	|	ЦБР_Задание.СсылкаНаЗадачу КАК Ссылка,
	|	ЦБР_Задание.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВТ_Задания
	|ИЗ
	|	Документ.ЦБР_Задание КАК ЦБР_Задание
	|ГДЕ
	|	ЦБР_Задание.СсылкаНаЗадачу = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ЦБР_Задание.Ссылка,
	|	ЦБР_Задание.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_ЗадачаКоманда.НомерСтроки КАК НомерСтроки,
	|	ЦБР_ЗадачаКоманда.Исполнитель КАК Исполнитель,
	|	ЕСТЬNULL(ВТ_Задания.КоличествоЭтапов, 0) КАК КоличествоЭтапов
	|ИЗ
	|	Справочник.ЦБР_Задача.Команда КАК ЦБР_ЗадачаКоманда
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Задания КАК ВТ_Задания
	|		ПО (ВТ_Задания.Ссылка = ЦБР_ЗадачаКоманда.Ссылка
	|		И ВТ_Задания.Исполнитель = ЦБР_ЗадачаКоманда.Исполнитель)
	|ГДЕ
	|	ЦБР_ЗадачаКоманда.Ссылка = &Ссылка
	|	И ЦБР_ЗадачаКоманда.Исполнитель В (&Исполнитель)
	|	И (ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.Исполнитель)
	|	ИЛИ ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.ИсполнительРазработчик)
	|	ИЛИ ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.ИсполнительАналитик))
	|СГРУППИРОВАТЬ ПО
	|	ЦБР_ЗадачаКоманда.НомерСтроки,
	|	ЦБР_ЗадачаКоманда.Исполнитель,
	|	ЕСТЬNULL(ВТ_Задания.КоличествоЭтапов, 0)";
	Запрос.УстановитьПараметр("Исполнитель", Результат.МассивИсполнителей);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Получатели = Новый Массив;
		Если Выборка.КоличествоЭтапов > 0 Тогда
			ТекстСообщения = СтрШаблон("Невозможно удалить! Сотрудник: %1, является исполнителем этапа!", Выборка.Исполнитель);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		Объект.Команда.Удалить(Выборка.НомерСтроки - 1);
		Получатели.Добавить(Выборка.Исполнитель);
		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, "УдалениеИсполнителя", Получатели);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиЗадачуПослеЗакрытия(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		
		СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, ПользователиКлиент.АвторизованныйПользователь());

		НовыйКуратор = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(РезультатЗакрытия, "Руководитель");
		Если СостояниеЗадачи = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Перечисление.ЦБР_Состояние.Новый") Тогда
			ЕстьИсполнителиВЗадаче = ПолучитьНаличиеИсполнителейВЗадаче(Объект.Ссылка);
			Если Не ЕстьИсполнителиВЗадаче Тогда
				УдалитьТекущегоКуратораИСменитьВладельцаЗадачи(Объект.Куратор, НовыйКуратор);
			КонецЕсли;
		КонецЕсли;

		Объект.Куратор = НовыйКуратор;
		КураторПриИзменении(Элементы.Куратор);
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			Возврат;
		КонецЕсли;
		Если Объект.Стартовала Тогда
			ОповеститьСотрудниковПриПереводе();
		КонецЕсли;
		Закрыть();
	КонецЕсли;     
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаличиеИсполнителейВЗадаче(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_ЗадачаКоманда.Исполнитель
	|ИЗ
	|	Справочник.ЦБР_Задача.Команда КАК ЦБР_ЗадачаКоманда
	|ГДЕ
	|	ЦБР_ЗадачаКоманда.Ссылка = &Ссылка
	|	И (ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.Исполнитель)
	|	ИЛИ ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.ИсполнительАналитик)
	|	ИЛИ ЦБР_ЗадачаКоманда.Роль = ЗНАЧЕНИЕ(Перечисление.ЦБР_РольВЗадаче.ИсполнительРазработчик))";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

&НаСервере
Процедура ОповеститьСотрудниковПриПереводе()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВТ.Исполнитель
				   |ПОМЕСТИТЬ ВТ
				   |ИЗ
				   |	&ВТ КАК ВТ
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ЦБР_ГруппыСотрудниковСостав.Пользователь КАК Пользователь
				   |ИЗ
				   |	ВТ КАК ВТ
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
				   |		ПО ВТ.Исполнитель = ЦБР_ГруппыСотрудниковСостав.Пользователь
				   |ГДЕ
				   |	ЦБР_ГруппыСотрудниковСостав.Ссылка.Руководитель = &Руководитель
				   |СГРУППИРОВАТЬ ПО
				   |	ЦБР_ГруппыСотрудниковСостав.Пользователь";

	Запрос.УстановитьПараметр("Руководитель", Объект.Куратор);
	Запрос.УстановитьПараметр("ВТ", Объект.Команда.Выгрузить());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Получатели = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Получатели.Добавить(Выборка.Пользователь);
	КонецЦикла;
	
	Если Получатели.Количество() Тогда
		СообщениеВОбсуждение("Перевод", Получатели);
	Иначе
		Получатели.Добавить(Объект.Куратор);
		СообщениеВОбсуждение("СменаКуратора", Получатели);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УточнениеЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = Истина Тогда
		//Объект.СостояниеЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.ЗапросИнформации");
		ОбновитьЗадачу();
		УстановитьВидимостьЭлементов();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтменитьЗапросИнформацииНаСервере()

	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Задание,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Заявитель,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Ответчик,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Отменено,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстЗапроса,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстОтвета,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.СрезПоследних(, Задание = &Задание) КАК
	|		ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних";

	Запрос.УстановитьПараметр("Задание", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если ЗначениеЗаполнено(Выборка.ТекстОтвета) Тогда
		УстановитьВидимостьГруппыЗапросИнформации();
		Возврат;
	КонецЕсли;
	Запись = РегистрыСведений.ЦБР_УточненияПоЗадачамЗаданиям.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Запись.Отменено = Истина;
	Запись.Записать();
	
	Для каждого Исполнители Из Объект.Команда Цикл
		
		СтатусЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ВычислитьСтатусЗадачи(Объект.Ссылка, Исполнители.Исполнитель, Исполнители.Роль);	
	    ПоследнийСтатус = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Объект.Ссылка, Исполнители.Исполнитель);
		
		Если СтатусЗадачи <> ПоследнийСтатус Тогда
			МенеджерЗаписи = РегистрыСведений.ЦБР_СтатусыЗадач.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Задача = Объект.Ссылка;
			МенеджерЗаписи.Пользователь = Исполнители.Исполнитель; 
			МенеджерЗаписи.СостояниеЗадачи = СтатусЗадачи;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Если Записать() Тогда
		Получатели = Новый Массив;
		Получатели.Добавить(Выборка.Ответчик);
		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, "ОтменаЗапросаИнформации", Получатели,
			Выборка.ТекстЗапроса);
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппыЗапросИнформации()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКнопокЗапросИнформации", "Видимость",
		Объект.Стартовала);
	Если Объект.Стартовала Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Заявитель,
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Ответчик,
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Отменено,
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ДатаОтветаНаЗапросФакт
		|ИЗ
		|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.СрезПоследних(, Задание = &Задание
		|	И НЕ Отменено) КАК ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних";

		Запрос.УстановитьПараметр("Задание", Объект.Ссылка);

		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Пользователи.ТекущийПользователь() = Выборка.Ответчик Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнОтменитьЗапросИнформации",
					"Видимость", Ложь);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнЗапросИнформации",
					"Видимость", Ложь);
				Если Не ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт) Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
						"кнОткрытьЧатЗапросаИнформации", "Картинка", БиблиотекаКартинок.CRM_Оповещения_1);
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнОткрытьЧатЗапросаИнформации",
					"Фигура", ФигураКнопки.Авто);
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнОтменитьЗапросИнформации",
					"Видимость", Не ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт));
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнЗапросИнформации",
					"Видимость", ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт));
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПеревестиЗадачу",
					"Видимость", ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт));

			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнОтменитьЗапросИнформации",
				"Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнОткрытьЧатЗапросаИнформации",
				"Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнЗапросИнформации", "Видимость",
				Пользователи.ТекущийПользователь() <> Объект.Постановщик);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "кнЗапросИнформации", "Фигура",
				ФигураКнопки.Авто);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Процедура СогласоватьВсеНаСервере()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ЦБР_СтруктураЗадач.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
//	|ГДЕ
//	|	ЦБР_СтруктураЗадач.Владелец = &СсылкаНаЗадачу
//	//|	И ЦБР_СтруктураЗадач.ОтправленаНаСогласованиеОценки = ЛОЖЬ
//	//|	И ЦБР_СтруктураЗадач.ОтправленаНаСогласованиеСроков = ЛОЖЬ
//	//|	И ЦБР_СтруктураЗадач.СрокиСогласованы = ЛОЖЬ
//	|	И ЦБР_СтруктураЗадач.ОценкаСогласована = ЛОЖЬ
//	|	И ЦБР_СтруктураЗадач.ЭтоГруппа = ЛОЖЬ";
//	
//	Запрос.УстановитьПараметр("СсылкаНаЗадачу", Объект.Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		ОтправитьНаСогласованиеНаСервере(Выборка.Ссылка, Истина);	
//	КонецЦикла; 

//КонецПроцедуры

//&НаСервере
//Процедура ОтправитьНаСогласованиеНаСервере(СсылкаСтруктурыЗадания, СогласованиеОценки, СообщитьОбОшибке = Ложь)

//	ОбъектСтруктурыЗадания = СсылкаСтруктурыЗадания.ПолучитьОбъект();
//	
//	Если НЕ ЗначениеЗаполнено(ОбъектСтруктурыЗадания.ТрудозатратыПлан) Тогда
//		Если Не ОбъектСтруктурыЗадания.ОплатаПоФакту Тогда
//			Если СообщитьОбОшибке Тогда
//				ОбщегоНазначения.СообщитьПользователю("Должна быть точная оценка или оценка ""По факту""!");
//			КонецЕсли;
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Получатели = Новый Массив;
//	Получатели.Добавить(Объект.Постановщик);
//	
//	ОтправленныеЭтапы = Новый Массив;
//	ОтправленныеЭтапы.Добавить(СсылкаСтруктурыЗадания.Наименование);
//	
//	НовоеСостояние = Неопределено;
//	
//	Если Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.ПоФакту Тогда
//		ОбъектСтруктурыЗадания.ОценкаСогласована = Истина;
//		//Если Не Объект.КонтролироватьСроки Тогда
//			//ОбъектСтруктурыЗадания.СрокиСогласованы = Истина;
//			//ОбъектСтруктурыЗадания.Состояние = Перечисления.ЦБР_Состояние.Согласован;
//		//КонецЕсли;
//		НовоеСостояние = Перечисления.ЦБР_Состояние.Согласован; 
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, "СогласоватьОценку", Получатели, ОтправленныеЭтапы);
//	ИначеЕсли Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные И (ОбъектСтруктурыЗадания.ОплатаПоФакту
//		ИЛИ ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПредсогласованныеЧасы(Объект.Ссылка) >= ОбъектСтруктурыЗадания.ТрудозатратыПлан)Тогда 
//		ОбъектСтруктурыЗадания.ОценкаСогласована = Истина;
//		//ОбъектСтруктурыЗадания.СрокиСогласованы = Истина;
//		//ОбъектСтруктурыЗадания.Состояние = Перечисления.ЦБР_Состояние.Согласован;
//		НовоеСостояние = Перечисления.ЦБР_Состояние.Согласован; 
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, "СогласоватьОценку", Получатели, ОтправленныеЭтапы);	
//	Иначе 
//		//Если СогласованиеОценки Тогда
//			//ОбъектСтруктурыЗадания.Состояние = Перечисления.ЦБР_Состояние.НаСогласовании;
//			//ОбъектСтруктурыЗадания.ОтправленаНаСогласованиеОценки = Истина;
//		    НовоеСостояние = Перечисления.ЦБР_Состояние.НаСогласовании; 
//			ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, "СогласованиеОценки", Получатели, ОтправленныеЭтапы);	
//		//Иначе
//		//	ОбъектСтруктурыЗадания.ОтправленаНаСогласованиеСроков = Истина;
//		//	ОбъектСтруктурыЗадания.Состояние = Перечисления.ЦБР_Состояние.НаСогласованииСроков;
//		//	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, "СогласованиеСроков", Получатели, ОтправленныеЭтапы);
//		//КонецЕсли;
//	КонецЕсли;
//	
//	//Если Не Объект.КонтролироватьСроки Тогда
//	//	ОбъектСтруктурыЗадания.ОтправленаНаСогласованиеСроков = Истина;
//	//КонецЕсли;
//	
//	ОбъектСтруктурыЗадания.Записать();
//	
//	Если ЗначениеЗаполнено(НовоеСостояние) Тогда
//		ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусСтруктурыЗадания(СсылкаСтруктурыЗадания, НовоеСостояние);	
//	КонецЕсли;
//	
//	Записать();
//	
//	Если НовоеСостояние = Перечисления.ЦБР_Состояние.Согласован Тогда
//		СоздатьСогласованноеЗадание(ОбъектСтруктурыЗадания.Ссылка)
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ОтменитьСогласованиеНаСервере(СсылкаНаСтруктуру)
	
	ОценкаСогласована = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СсылкаНаСтруктуру,
		"ОценкаСогласована");

	//Задание = СсылкаНаСтруктуру.ПолучитьОбъект();

	Если ОценкаСогласована Тогда
		Возврат;
	КонецЕсли;

	//Если Задание.ОтправленаНаСогласованиеОценки Тогда

	//	Если Объект.КонтролироватьСроки Тогда
	//		Задание.Состояние = Перечисления.ЦБР_Состояние.СрокиСогласованы;
	//	Иначе
	//		Задание.Состояние = Перечисления.ЦБР_Состояние.Черновик;
	//	КонецЕсли;

	//	Задание.ОтправленаНаСогласованиеОценки = Ложь;

	//ИначеЕсли Задание.ОтправленаНаСогласованиеСроков Тогда

	//	Если Задание.СрокиСогласованы Тогда
	//		Возврат;
	//	КонецЕсли;

	//	Задание.ОтправленаНаСогласованиеСроков = Ложь;
	//	Задание.Состояние = Перечисления.ЦБР_Состояние.Черновик;
	//КонецЕсли;

	//Задание.Записать();
	
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусСтруктурыЗадания(СсылкаНаСтруктуру, Перечисления.ЦБР_Состояние.Черновик);	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭтапНаСервере(РодительскийЭтап, ТипЗадания)

	Этап = Справочники.ЦБР_СтруктураЗадач.СоздатьЭлемент();
	Этап.Владелец = Объект.Ссылка;
	Этап.Родитель = РодительскийЭтап.Родитель;
	Этап.Состояние = Перечисления.ЦБР_Состояние.Черновик;
	Этап.Исполнитель = Пользователи.ТекущийПользователь();
	Этап.ЕстьАналитик = Истина;
	Этап.Аналитик = РодительскийЭтап.Исполнитель;
	Этап.ТипЗадания = ТипЗадания;
	Этап.Наименование = "" + ТипЗадания + " этапа: " + РодительскийЭтап.НомерЗаданияВУровне + " "
		+ РодительскийЭтап.Наименование;
	Этап.ПредыдущееЗадание = РодительскийЭтап.Ссылка;
	Этап.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		УстановитьТрудозатраты(Результат, ДополнительныеПараметры);
		ОбновитьДеревоЗаданийНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьТрудозатраты(Результат, ДополнительныеПараметры)
	Если Не ДополнительныеПараметры.Свойство("СсылкаНаСтруктуру") Тогда
		Возврат;
	КонецЕсли;

	Этап = ДополнительныеПараметры.СсылкаНаСтруктуру.ПолучитьОбъект();
	Этап.ВидЧаса = Результат.ВидЧаса;
	Этап.ТрудозатратыПланКомментарий = Результат.ТрудозатратыПланКомментарий;
	Этап.НетГарантии = Результат.НетГарантии;

	Если Результат.ТипОценки = "Точная" Тогда
		Этап.ТрудозатратыПлан = Результат.ТрудозатратыПлан;
		Этап.ТрудозатратыПланПредставление = СтрШаблон("%1", Этап.ТрудозатратыПлан);
		Этап.ОплатаПоФакту = Ложь;
	ИначеЕсли Результат.ТипОценки = "Рамочная" Тогда
		Этап.ТрудозатратыПланОт = Результат.ТрудозатратыПланОт;
		Этап.ТрудозатратыПланДо = Результат.ТрудозатратыПланДо;
		Этап.ТрудозатратыПланПредставление = СтрШаблон("От %1 до %2", Этап.ТрудозатратыПланОт, Этап.ТрудозатратыПланДо);
		Этап.ОплатаПоФакту = Ложь;
	ИначеЕсли Результат.ТипОценки = "ПоФакту" Тогда
		Этап.ТрудозатратыПланПредставление = "По факту";
		Этап.ОплатаПоФакту = Истина;

	Иначе
		Этап.ТрудозатратыПланПредставление = "";
		Этап.ВидЧаса = Неопределено;
		Этап.ОплатаПоФакту = Ложь;
	КонецЕсли;

	Этап.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивИсполнителей()
	ОбъектВЗначении = РеквизитФормыВЗначение("Объект");
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОбъектВЗначении.Команда.ВыгрузитьКолонку("Исполнитель"));
КонецФункции

&НаСервере
Процедура ОтменитьВыполнениеЗаданияСервер(СсылкаНаЗадание) 
	
	ТекущееСостояниеЗадания = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадания(СсылкаНаЗадание);
	
	Если ТекущееСостояниеЗадания = Перечисления.ЦБР_Состояние.Закрыт Или ТекущееСостояниеЗадания = Перечисления.ЦБР_Состояние.Выполнен Тогда 
		ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(СсылкаНаЗадание, Перечисления.ЦБР_Состояние.ВРаботе);	
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВостановитьЭтапНаСервере(СсылкаНаСтруктуру)
	
	Если НЕ СсылкаНаСтруктуру.ЭтоГруппа И (СсылкаНаСтруктуру.ОценкаСогласована Или СсылкаНаСтруктуру.СрокиСогласованы) Тогда
		//ToDo Сделать запрос на отмену этапа
		Возврат;
	КонецЕсли;
	
	//Если НЕ СсылкаНаСтруктуру.ЭтоГруппа И (СсылкаНаСтруктуру.ОтправленаНаСогласованиеСроков Или СсылкаНаСтруктуру.ОтправленаНаСогласованиеОценки) Тогда
	//	//ToDo Сделать вопрос на отмену согласования и удаление этапа
	//	Возврат;
	//КонецЕсли;	
	
	Если НЕ СсылкаНаСтруктуру.ЭтоГруппа И СсылкаНаСтруктуру.ОценкаСогласована Тогда
		ОбщегоНазначения.СообщитьПользователю("Удаление этапа невозможно. Оценка согласована");
		Возврат;
	КонецЕсли;
	
	Задание = СсылкаНаСтруктуру.ПолучитьОбъект();
	
	Если Задание.ПометкаУдаления Тогда 
		Задание.УстановитьПометкуУдаления(Ложь, Ложь);
	Иначе
		Задание.УстановитьПометкуУдаления(Истина, Ложь);
	КонецЕсли;
	
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусСтруктурыЗадания(СсылкаНаСтруктуру, Перечисления.ЦБР_Состояние.Отменен);	

КонецПроцедуры

//&НаСервере
//Процедура СоздатьСогласованноеЗадание(Этап)
//	
//	Пересогласование = Документы.ЦБР_Задание.ПустаяСсылка();
//	Задание = Документы.ЦБР_Задание.СоздатьДокумент();

//	Если ЗначениеЗаполнено(Этап.СсылкаНаЗадание) Тогда
//		Пересогласование = Этап.СсылкаНаЗадание.ПолучитьОбъект();
//		ЗаполнитьЗначенияСвойств(Задание, Пересогласование);
//		Задание.ЭффективныеЧасы.Загрузить(Пересогласование.ЭффективныеЧасы.Выгрузить());
//	КонецЕсли;
//	ЗаполнитьЗначенияСвойств(Задание, Этап);
//	Задание.Дата = ТекущаяДатаСеанса();
//	Задание.СсылкаНаЗадачу = Этап.Владелец;
//	Задание.СсылкаНаСтруктуру = Этап;
//	Задание.Постановщик = Этап.Владелец.Постановщик;
//	Задание.Подразделение = Задание.Исполнитель.Подразделение;
//	Задание.СсылкаНаЭтапТестирования = Этап.ПредыдущееЗадание;
//	Задание.УникальныйИдентификаторЗадания = Строка(Новый УникальныйИдентификатор);
//	Задание.Номер = "";
//	Задание.Записать(РежимЗаписиДокумента.Проведение);
//	Если Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные Тогда
//		Списалось =  ЦБР_ЗадачиЗаданияВызовСервера.СписатьПредсогласованныеЧасы(Объект.Ссылка, Этап.ТрудозатратыПлан);
//	КонецЕсли;
//	Если ЗначениеЗаполнено(Пересогласование.Ссылка) Тогда
//		Уведомление = СтрШаблон("Изменено количество согласованных часов! Было: %1 Стало: %2", ?(
//			Пересогласование.ОплатаПоФакту, "По факту", Пересогласование.ТрудозатратыПлан), ?(Задание.ОплатаПоФакту,
//			"По факту", Задание.ТрудозатратыПлан));
//		Получатели = Новый Массив;
//		Получатели.Добавить(Задание.Постановщик);
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Этап.Владелец, "ИзменениеОценки", Получатели, Уведомление);
//		ЦБР_ЗадачиЗаданияВызовСервера.ЗаменитьОсПоПересогласованию(Пересогласование.Ссылка, Задание.Ссылка);
//		УстановитьПривилегированныйРежим(Истина);
//		Пересогласование.Удалить();
//		УстановитьПривилегированныйРежим(Ложь);
//	КонецЕсли;
//		
//	СтруктураЗадачи = Этап.ПолучитьОбъект();
//	СтруктураЗадачи.СсылкаНаЗадание = Задание.Ссылка;
//	Если СтруктураЗадачи.ОплатаПоФакту Тогда  
//		СтруктураЗадачи.ТрудозатратыПланПредставление = "По факту";
//	КонецЕсли;
//	СтруктураЗадачи.Записать();   
//	
//КонецПроцедуры

&НаСервере
Процедура ПереместитьСтрокуДерева(Дерево, ПеремещаемаяСтрока, НовыйРодитель, Уровень = 0)
   
   Если Уровень = 0 Тогда
               
       НоваяСтрока = НовыйРодитель.Строки.Добавить();
       ЗаполнитьЗначенияСвойств(НоваяСтрока, ПеремещаемаяСтрока);
       ПереместитьСтрокуДерева(Дерево, ПеремещаемаяСтрока, НоваяСтрока, Уровень + 1);
       
       Если ПеремещаемаяСтрока.Родитель = Неопределено Тогда
           Дерево.Строки.Удалить(ПеремещаемаяСтрока);
       Иначе
           ПеремещаемаяСтрока.Родитель.Строки.Удалить(ПеремещаемаяСтрока);
       КонецЕсли;
       
   Иначе
       
       Для Каждого Стр ИЗ ПеремещаемаяСтрока.Строки Цикл
           НоваяСтрока = НовыйРодитель.Строки.Добавить();
           ЗаполнитьЗначенияСвойств(НоваяСтрока, ПеремещаемаяСтрока);
           ПереместитьСтрокуДерева(Дерево, Стр, НоваяСтрока, Уровень + 1); 
       КонецЦикла;
       
   КонецЕсли;
       
КонецПроцедуры   

&НаСервере
Процедура УстановитьВидимостьКонтектногоМенюВспискеЗаданий(СсылкаНаЗадание)
	
	РеквизитыЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЗадание, "Исполнитель, ЧасыСогласованы");
	
	Если ЗначениеЗаполнено(РеквизитыЗадания.Исполнитель) И Не ЦБР_ЗадачиЗаданияВызовСервера.ЕстьПравоСписанияЧасовПоЗаданию(РеквизитыЗадания.Исполнитель, Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗавершитьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюПересогласоватьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюУдалитьЭтап", "Видимость", Ложь); 
	    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтправитьНаСогласование", "Видимость", Ложь); 
	    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьВыполнениеЭтапа", "Видимость", Ложь);
		Возврат;
	КонецЕсли;	
	
	СостояниеЗадания = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадания(СсылкаНаЗадание);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьВыполнениеЭтапа", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюУдалитьЭтап", "Видимость", Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюПересогласоватьЭтап", "Видимость", РеквизитыЗадания.ЧасыСогласованы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтправитьНаСогласование", "Видимость", Не РеквизитыЗадания.ЧасыСогласованы);
	
	Если СостояниеЗадания = Перечисления.ЦБР_Состояние.Новый ИЛИ СостояниеЗадания = Перечисления.ЦБР_Состояние.Запланировано Тогда  
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗавершитьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюУдалитьЭтап", "Видимость", Истина); 
	ИначеЕсли СостояниеЗадания = Перечисления.ЦБР_Состояние.ВРаботе Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗавершитьЭтап", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Ложь);
	ИначеЕсли СостояниеЗадания = Перечисления.ЦБР_Состояние.Выполнен Тогда        
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗавершитьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюПересогласоватьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Ложь);
	    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьВыполнениеЭтапа", "Видимость", Истина);
	    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтправитьНаСогласование", "Видимость", Ложь);
	ИначеЕсли СостояниеЗадания = Перечисления.ЦБР_Состояние.НаСогласовании Тогда    
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗавершитьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюПересогласоватьЭтап", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Ложь); 
	    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтправитьНаСогласование", "Видимость", Ложь);
	ИначеЕсли СостояниеЗадания = Перечисления.ЦБР_Состояние.Согласован Тогда      
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗавершитьЭтап", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Истина);
	ИначеЕсли СостояниеЗадания = Перечисления.ЦБР_Состояние.НеСогласован Тогда        
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗавершитьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюУдалитьЭтап", "Видимость", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗапланироватьВзаимодействие", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюЗавершитьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюПересогласоватьЭтап", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтменитьСогласованныйЭтап", "Видимость", Ложь);
	КонецЕсли; 
	
	Если Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.ПоФакту Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюОтправитьНаСогласование", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗаданийДеревоКонтекстноеМенюПересогласоватьЭтап", "Видимость", Ложь);
	КонецЕсли;	
	
КонецПроцедуры 	      

&НаСервере
Процедура УстановитьКуратораПоИсполнителю()
	
	Если ЗначениеЗаполнено(ИсполнительАутсорс) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
			|	ЦБР_ГруппыСотрудниковСостав.Ссылка.Руководитель Как Руководитель
			|ИЗ
			|	Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
			|ГДЕ
			|	ЦБР_ГруппыСотрудниковСостав.Пользователь = &Пользователь";
		Запрос.Параметры.Вставить("Пользователь", ИсполнительАутсорс);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Объект.Куратор = ВыборкаДетальныеЗаписи.Руководитель;
			Объект.Владелец = ВыборкаДетальныеЗаписи.Руководитель;	
			ДобавитьЗаписьВТЧКоманда(Объект.Куратор, Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя);
			ДобавитьЗаписьВТЧКоманда(Объект.Куратор, Перечисления.ЦБР_РольВЗадаче.ВладелецЗадачи);		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеанимироватьЗавершение(Строка, Параметры) Экспорт
	
	//Если НЕ Строка = Неопределено Тогда
	//	ТекущаяСтрока = Элементы.ДеревоЗаданий.ТекущиеДанные;
	//	Оповещение = Новый ОписаниеОповещения("ОбновитьДеревоЗаданийОповещение", ЭтотОбъект);
	//	Если ТекущаяСТрока <> Неопределено Тогда
	//		ПараметрыОткрытия = Новый Структура("Ссылка, Задание, Команда", Объект.Ссылка, ТекущаяСтрока.СсылкаНаСтруктуру,
	//		ПолучитьМассивИсполнителей());
	//	Иначе
	//		ПараметрыОткрытия = Новый Структура("Ссылка, Команда", Объект.Ссылка, ПолучитьМассивИсполнителей());
	//	КонецЕсли;
	//	ОткрытьФорму("Справочник.ЦБР_СтруктураЗадач.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение,
	//	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			
	//	ЦБР_ЗадачиЗаданияВызовСервера.РеанимироватьЗадачу(Объект.Ссылка);
	//	ОбновитьЗадачу();
	//	УстановитьВидимостьЭлементов(); 
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданийДеревоВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущаяОбласть.Расшифровка) Тогда
		СтандартнаяОбработка = Элемент.ТекущаяОбласть.СодержитЗначение;
	КонецЕсли; 
	
	Если Элемент.ТекущаяОбласть.Текст = "Согласовать" Тогда 
		СтандартнаяОбработка = Ложь; 
		
		Оповещение = Новый ОписаниеОповещения("СогласованиеЗавершение", ЭтотОбъект);
		
		НовыеПараметры = Новый Структура;
		НовыеПараметры.Вставить("СсылкаНаЗадание", Элемент.ТекущаяОбласть.Расшифровка);
		
		ОткрытьФорму("Справочник.ЦБР_Задача.Форма.ФормаСогласования", НовыеПараметры, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПередатьВРаботу(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВопросПродолжитьЗавершитьЗаписатьЗадачуЧерновик", ЭтотОбъект);
	ТекстВопроса = "Передать Задачу в работу?";
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);   
	
КонецПроцедуры                                        

&НаКлиенте
Процедура СоздатьПодзадачу(Команда) 
	
	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьДеревоЗаданийОповещение", ЭтотОбъект);

	ПараметрыОткрытия = Новый Структура("Ссылка, Подзадача, Команда", Объект.Ссылка, ТекущиеДанные,
		ПолучитьМассивИсполнителей());   
	
	ОткрытьФорму("Документ.ЦБР_Задание.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонФТРазработкаТестирование(Команда)   
	
	ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("НомерШаблона", 1);
        Оповещение = Новый ОписаниеОповещения("ОповещениеСозданиеЭтаповПоШаблону", ЭтотОбъект, ДополнительныеПараметры);
    
    ПоказатьВопрос(Оповещение, 
    "Создаем этапы по шаблону?", 
    РежимДиалогаВопрос.ДаНет, 
    0 , 
    КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ШаблонТЗРазработкаТестирование(Команда)
	
	ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("НомерШаблона", 2);
        Оповещение = Новый ОписаниеОповещения("ОповещениеСозданиеЭтаповПоШаблону", ЭтотОбъект, ДополнительныеПараметры);
    
    ПоказатьВопрос(Оповещение, 
    "Создаем этапы по шаблону?", 
    РежимДиалогаВопрос.ДаНет, 
    0 , 
    КодВозвратаДиалога.Нет);    
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонФТТЗРазработкаКРТестирование(Команда) 
	
	ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("НомерШаблона", 3);
        Оповещение = Новый ОписаниеОповещения("ОповещениеСозданиеЭтаповПоШаблону", ЭтотОбъект, ДополнительныеПараметры);
    
    ПоказатьВопрос(Оповещение, 
    "Создаем этапы по шаблону?", 
    РежимДиалогаВопрос.ДаНет, 
    0 , 
    КодВозвратаДиалога.Нет);    
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеСозданиеЭтаповПоШаблону(Результат, ПараметрыЗаписи) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда 
		СоздатьЭтапыПоШаблону(ПараметрыЗаписи.НомерШаблона);
		ОбновитьЗадачу();      
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьЭтапыПоШаблону(НомерШаблона)  
	
	СостояниеНовый         = Перечисления.ЦБР_Состояние.Новый;
	СостояниеЗапланировано = Перечисления.ЦБР_Состояние.Запланировано;
	
	Если НомерШаблона = 1 Тогда 
		ФТ 		= СоздатьДокументЗадача("Функциональные требования",, СостояниеНовый);
		Разраб 	= СоздатьДокументЗадача("Разработка", ФТ, СостояниеЗапланировано); 
		Тест 	= СоздатьДокументЗадача("Тестирование и сдача", Разраб, СостояниеЗапланировано);
	ИначеЕсли НомерШаблона = 2 Тогда  
		ТЗ 		= СоздатьДокументЗадача("Техническое задание",,СостояниеНовый);
		Разраб 	= СоздатьДокументЗадача("Разработка", ТЗ, СостояниеЗапланировано); 
		Тест 	= СоздатьДокументЗадача("Тестирование и сдача", Разраб, СостояниеЗапланировано);
	Иначе     
		ФТ 		= СоздатьДокументЗадача("Функциональные требования",,СостояниеНовый); 
		ТЗ 		= СоздатьДокументЗадача("Техническое задание", ФТ, СостояниеЗапланировано); 
		Разраб 	= СоздатьДокументЗадача("Разработка", ТЗ, СостояниеЗапланировано);  
		Ревью   = СоздатьДокументЗадача("Код-ревью", Разраб, СостояниеЗапланировано);
		Тест 	= СоздатьДокументЗадача("Тестирование и сдача", Ревью, СостояниеЗапланировано);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументЗадача(НазваниеЗадания, ПредыдущееЗадание = Неопределено, Состояние);
	
	НовоеЗадание                   = Документы.ЦБР_Задание.СоздатьДокумент();
	НовоеЗадание.Дата              = ТекущаяДатаСеанса();   
	НовоеЗадание.ВидЧаса           = Перечисления.ЦБР_ВидыЧасовПоЗадачам.Платные;
	НовоеЗадание.Наименование      = НазваниеЗадания;
	НовоеЗадание.Постановщик       = Объект.Постановщик;
	НовоеЗадание.ПредыдущееЗадание = ПредыдущееЗадание; 
	НовоеЗадание.СсылкаНаЗадачу    = Объект.Ссылка;  
	НовоеЗадание.ТипОценкиЗадачи   = Перечисления.ЦБР_ТипОценкиЗадачи.Стандартная;  
	Если ПредыдущееЗадание = Неопределено Тогда
	     НовоеЗадание.Исполнитель  = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	НовоеЗадание.Записать(РежимЗаписиДокумента.Проведение);
	
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(НовоеЗадание.Ссылка, Состояние);
	
	Возврат НовоеЗадание.Ссылка;
	
КонецФункции

&НаСервере
Процедура УдалитьСебяИзЗадачиНаСервере()
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь; 
	
	Если ТекПользователь = Объект.РуководительЗадачи Тогда
		ОбщегоНазначения.СообщитьПользователю("Текущий пользователь является главным по задаче. Удаление невозможно");
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦБР_Задание.Исполнитель КАК Исполнитель
	|ИЗ
	|	Документ.ЦБР_Задание КАК ЦБР_Задание
	|ГДЕ
	|	ЦБР_Задание.СсылкаНаЗадачу = &СсылкаНаЗадачу
	|	И ЦБР_Задание.Проведен
	|	И ЦБР_Задание.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Исполнитель", ТекПользователь);
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		СтруктураДляПоиска = Новый Структура("Исполнитель", ТекПользователь); 
		МассивСтрок = Объект.Команда.НайтиСтроки(СтруктураДляПоиска); 
		Для каждого Строка Из МассивСтрок Цикл 
			Объект.Команда.Удалить(Строка); 
		КонецЦикла; 
		
		Если ТекПользователь = Объект.Куратор Тогда
			Объект.Куратор = Объект.РуководительЗадачи;
		КонецЕсли;
		
		Набор = РегистрыСведений.ЦБР_СостоянияЗадач.СоздатьНаборЗаписей();
		Набор.Отбор.Задача.Установить(Объект.Ссылка);
		Набор.Отбор.ПользовательАРМ.Установить(ТекПользователь);
		Набор.Записать();
		
		Модифицированность = Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Текущий пользователь является исполнителем этапов. Удаление невозможно");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСебяИзЗадачи(Команда)
	УдалитьСебяИзЗадачиНаСервере();
КонецПроцедуры
 
&НаСервере
Функция ОшибкаПриПересогласовании(Этап) 
	
	РеквизитыЭтапа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Этап, "ЧасыСогласованы");
	
	Если Не РеквизитыЭтапа.ЧасыСогласованы Тогда
		ОбщегоНазначения.СообщитьПользователю("Этап ранее не был согласован. Пересогласование не доступно");
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОтправитьСообщенияВОбщееОбсуждение(Получатели)
	
	Если Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.ПоФакту Тогда
		ЦБР_ОбсужденияСервер.ОтправитьСообщениеВОбщееОбсуждение(Объект.Ссылка, "Тип оценки задачи: по факту", Получатели);   
	ИначеЕсли Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные Тогда
		ЦБР_ОбсужденияСервер.ОтправитьСообщениеВОбщееОбсуждение(Объект.Ссылка, СтрШаблон("Предсогласованное количество часов: %1 ч", Объект.ПредСогласованныеЧасы), Получатели);   
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область РаботаСФайлами

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыЗаписи = Новый Структура("РежимЗаписи");
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
		
		Если Не Записать(ПараметрыЗаписи) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	РежимСоздания = 2; // с диска
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьДобавлениеПриложения", ЭтотОбъект);
	
	РаботаСФайламиКлиент.ДобавитьФайл(
	ОписаниеОповещения, Объект.Ссылка, ЭтотОбъект, РежимСоздания);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьДобавлениеПриложения(Приложение, ПараметрыОповещения) Экспорт
	
	Если Приложение = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	Если Не ЗначениеЗаполнено(Приложение.ФайлСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьИндексКартинкиУФайла(Приложение.ФайлСсылка);
	
	СтрокаПриложения = Объект.Приложения.Добавить();
	СтрокаПриложения.Приложение = Приложение.ФайлСсылка;
	
	Если ТипЗнч(Приложение.ФайлСсылка) = Тип("СправочникСсылка.ЦБР_ЗадачаПрисоединенныеФайлы") Тогда
		ДанныеФайлов = ДанныеФайлов(Приложение.ФайлСсылка);
		ДанныеФайла = ДанныеФайлов.Получить(Приложение.ФайлСсылка);
		ЗаполнитьЗначенияСвойств(СтрокаПриложения, ДанныеФайла);        
	КонецЕсли;
	
	ОбновитьПредставлениеПриложений();
	
	Модифицированность = Истина;
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи");
	ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
	Записать(ПараметрыЗаписи); // запишем еще раз, т.к. спр Файл уже записан, а табл часть Приложения еще нет
	
	ЗаполнитьИконкиФайлов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИндексКартинкиУФайла(ФайлСсылка)    
	
	ОбъектФайл = ФайлСсылка.ПолучитьОбъект();
	ОбъектФайл.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ИндексПиктограммыФайла(ОбъектФайл.Расширение);
	ОбъектФайл.Записать(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыСохранитьКак(Команда)
	
	Если Элементы.Приложения.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСсылка = Элементы.Приложения.ТекущиеДанные.Приложение;
	Если Элементы.Приложения.ВыделенныеСтроки.Количество() > 1 Тогда
		СписокФайловДляВыгрузки = Новый СписокЗначений;
		Для Каждого ВыбраннаяСтрока Из Элементы.Приложения.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.Приложения.ДанныеСтроки(ВыбраннаяСтрока);
			Если ТипЗнч(ДанныеСтроки.Приложение) = Тип("СправочникСсылка.ЦБР_ЗадачаПрисоединенныеФайлы") Тогда
				СписокФайловДляВыгрузки.Добавить(ДанныеСтроки.Приложение);
			КонецЕсли;
		КонецЦикла;
		
		Если СписокФайловДляВыгрузки.Количество() > 1 Тогда
//			РаботаСФайламиКлиент.СохранитьФайлыКак(СписокФайловДляВыгрузки, УникальныйИдентификатор);
		ИначеЕсли СписокФайловДляВыгрузки.Количество() = 1 Тогда
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(
			СписокФайловДляВыгрузки[0].Значение, Неопределено, УникальныйИдентификатор);
			РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, УникальныйИдентификатор);
		Иначе
			ПоказатьПредупреждение( , НСтр("ru = 'Выберите файл.'"));
		КонецЕсли;
	Иначе
		Если ТипЗнч(ТекущаяСсылка) = Тип("СправочникСсылка.ЦБР_ЗадачаПрисоединенныеФайлы") Тогда
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(ТекущаяСсылка, Неопределено,
			УникальныйИдентификатор);
			РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, УникальныйИдентификатор);
		Иначе
			ПоказатьПредупреждение( , НСтр("ru = 'Выберите файл.'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеПриложений()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаПриложения Из Объект.Приложения Цикл
		СтрокаПриложения.ПредставлениеПриложения = Строка(СтрокаПриложения.Приложение);
	КонецЦикла;
	
	Если Объект.Приложения.Количество() <> 0 Тогда
		Элементы.ПриложенияПриложение.Заголовок = СтрШаблон(
		НСтр("ru = 'Приложения (%1)'"), Объект.Приложения.Количество());
	Иначе
		Элементы.ПриложенияПриложение.Заголовок = НСтр("ru = 'Приложения'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеФайлов(Файлы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЦБР_ЗадачаПрисоединенныеФайлы.Редактирует КАК Редактирует,
	|	ЦБР_ЗадачаПрисоединенныеФайлы.ПометкаУдаления КАК ПометкаУдаления,
	|	ЦБР_ЗадачаПрисоединенныеФайлы.ИндексКартинки КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА ЦБР_ЗадачаПрисоединенныеФайлы.Редактирует В (&ТекущийПользовательИСотрудники)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РедактируетТекущийПользователь,
	|	ВЫБОР
	|		КОГДА НЕ ЦБР_ЗадачаПрисоединенныеФайлы.Редактирует В (&ТекущийПользовательИСотрудники)
	|				И ЦБР_ЗадачаПрисоединенныеФайлы.Редактирует <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|				И ЦБР_ЗадачаПрисоединенныеФайлы.Редактирует <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РедактируетДругойПользователь,
	|	ЦБР_ЗадачаПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	ЦБР_ЗадачаПрисоединенныеФайлы.Размер КАК Размер
	|ИЗ
	|	Справочник.ЦБР_ЗадачаПрисоединенныеФайлы КАК ЦБР_ЗадачаПрисоединенныеФайлы
	|ГДЕ
	|	ЦБР_ЗадачаПрисоединенныеФайлы.Ссылка В(&Файлы)");
	Запрос.УстановитьПараметр("Файлы", Файлы);
	Запрос.УстановитьПараметр("ТекущийПользовательИСотрудники", Пользователи.ТекущийПользователь());
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		СтруктураФайла = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы);
		
		СтруктураФайла.Вставить("ПолноеИмяФайлаВРабочемКаталоге", "");
		СтруктураФайла.Вставить("ДатаМодификацииУниверсальнаяВБазе", ТекущаяДатаСеанса());
		
		Если СтруктураФайла.РедактируетТекущийПользователь = Истина И ЗначениеЗаполнено(СтруктураФайла.Ссылка) Тогда
			
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(
			СтруктураФайла.Ссылка);
			СтруктураФайла.ПолноеИмяФайлаВРабочемКаталоге = ДанныеФайла.ПолноеИмяФайлаВРабочемКаталоге;
			СтруктураФайла.ДатаМодификацииУниверсальнаяВБазе = ДанныеФайла.ДатаМодификацииУниверсальная;
		КонецЕсли;
		
		Результат.Вставить(
		СтрокаТаблицы.Ссылка, СтруктураФайла);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИконкиФайлов()
	
	МассивФайлов = Новый Массив;
	
	Для Каждого Стр Из Объект.Приложения Цикл
		
		Если ТипЗнч(Стр.Приложение) = Тип("СправочникСсылка.ЦБР_ЗадачаПрисоединенныеФайлы") Тогда
			МассивФайлов.Добавить(Стр.Приложение);
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеФайлов = ДанныеФайлов(МассивФайлов);
	
	Для Каждого Стр Из Объект.Приложения Цикл
		
		Если ТипЗнч(Стр.Приложение) = Тип("СправочникСсылка.ЦБР_ЗадачаПрисоединенныеФайлы") Тогда
			ДанныеФайла = ДанныеФайлов.Получить(Стр.Приложение);
			ЗаполнитьЗначенияСвойств(Стр, ДанныеФайла);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьПредставлениеПриложений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяСтрока = Элемент.ТекущиеДанные.Приложение;
	КакОткрывать = РаботаСФайламиСлужебныйКлиент.ПерсональныеНастройкиРаботыСФайлами().ДействиеПоДвойномуЩелчкуМыши;
	
	Если КакОткрывать = "ОткрыватьКарточку" Тогда
		ПоказатьЗначение( , ВыбраннаяСтрока);
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ВыбраннаяСтрока, Неопределено,
	УникальныйИдентификатор, Неопределено, ПредыдущийАдресФайла);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
	Обработчик = Новый ОписаниеОповещения("СписокВыборПослеВыбораРежимаРедактирования", ЭтотОбъект,
	ПараметрыОбработчика);
	
	РаботаСФайламиСлужебныйКлиент.ВыбратьРежимИРедактироватьФайл(Обработчик, ДанныеФайла, Не ДанныеФайла.Служебный);	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборПослеВыбораРежимаРедактирования(Результат, ПараметрыВыполнения) Экспорт

	РаботаСФайламиКлиент.ОткрытьФайл(ПараметрыВыполнения.ДанныеФайла, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПриложенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	НаименованиеПриложения = "";
	МассивПриложений = Новый Массив;
	
	Для Каждого ВыбраннаяСтрока Из Элементы.Приложения.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Объект.Приложения.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		МассивПриложений.Добавить(ДанныеСтроки.Приложение);
		НаименованиеПриложения = Строка(ДанныеСтроки.Приложение);
		
	КонецЦикла;
	
	КоличествоПриложений = МассивПриложений.Количество();
	
	Если КоличествоПриложений = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриложенияПередУдалениемПродолжение", ЭтотОбъект,
	Новый Структура("МассивПриложений", МассивПриложений));
	
	Если КоличествоПриложений > 1 Тогда
		ТекстВопроса = НСтр("ru = 'Удалить выделенные приложения?'");
	Иначе
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Удалить ""%1""?'"), НаименованиеПриложения);
	КонецЕсли;
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	#Если Не ВебКлиент Тогда
		
		КоличествоВыделенныйВложений = Элементы.Приложения.ВыделенныеСтроки.Количество();
		
		Если КоличествоВыделенныйВложений = 0 Тогда
			
			Возврат;
			
		ИначеЕсли КоличествоВыделенныйВложений = 1 Тогда
			
			ФайлСсылка = Элементы.Приложения.ТекущиеДанные.Приложение;
			Если ТипЗнч(ФайлСсылка) <> Тип("СправочникСсылка.ЦБР_ЗадачаПрисоединенныеФайлы") Тогда
				
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(ФайлСсылка);
				ПараметрыПеретаскивания.Значение = МассивОбъектов;
				
				Возврат;
				
			КонецЕсли;
			
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ФайлСсылка, Неопределено);
			
			ПолноеИмяПеретаскиваемогоФайла = "";
			
			Обработчик = Новый ОписаниеОповещения("ПослеПолучитьФайлВерсииВРабочийКаталог", ЭтотОбъект);
			РаботаСФайламиСлужебныйКлиент.ПолучитьФайлВерсииВРабочийКаталог(Обработчик, ДанныеФайла, ПолноеИмяПеретаскиваемогоФайла,
			УникальныйИдентификатор);
			
			Если ЗначениеЗаполнено(ПолноеИмяПеретаскиваемогоФайла) Тогда
				Файл = Новый Файл(ПолноеИмяПеретаскиваемогоФайла);
				ПараметрыПеретаскивания.Значение = Файл;
			Иначе
				Выполнение = Ложь;
			КонецЕсли;
			
		Иначе // более одного выделено
			
			МассивОбъектов = Новый Массив;
			Для Каждого ВыделеннаяСтрока Из Элементы.Приложения.ВыделенныеСтроки Цикл
				ДанныеСтроки = Объект.Приложения.НайтиПоИдентификатору(ВыделеннаяСтрока);
				МассивОбъектов.Добавить(ДанныеСтроки.Приложение);
			КонецЦикла;
			Если МассивОбъектов.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			ПараметрыПеретаскивания.Значение = МассивОбъектов;
			
		КонецЕсли;
		
	#Иначе
		Выполнение = Ложь;
	#КонецЕсли
	
КонецПроцедуры

// Продолжение процедуры после получения файла на клиент
&НаКлиенте
Процедура ПослеПолучитьФайлВерсииВРабочийКаталог(Результат, ПараметрыВыполнения) Экспорт
	
	Если Результат.ФайлПолучен Тогда
		
		ПолноеИмяПеретаскиваемогоФайла = Результат.ПолноеИмяФайла;
		
		Файл = Новый Файл(ПолноеИмяПеретаскиваемогоФайла);
		Если Файл.Существует() Тогда
			Файл.УстановитьТолькоЧтение(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ПереносСтрок

&НаКлиенте
Процедура ПеренестиСтрокуВверх(Команда) 
	
	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;

	ПеренестиСтрокуВверхНаСервере(ТекущиеДанные); 
	
	ОбновитьЗадачу();

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСтрокуВниз(Команда)
	
	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;

	ПеренестиСтрокуВнизНаСервере(ТекущиеДанные); 
	
	ОбновитьЗадачу();

КонецПроцедуры

&НаСервере
Процедура ПеренестиСтрокуВверхНаСервере(ЦБР_Задание)

	ДанныеСтруктурыЗадания  = ДанныеСтруктурыЗадания(ЦБР_Задание); 
	ТекущийНомерЗадания     = ДанныеСтруктурыЗадания.НомерЗаданияВУровне;  
	Если ТекущийНомерЗадания > 0 Тогда 
		ПредыдущийНомерЗадания     = ПредыдущийНомерЗадания(ТекущийНомерЗадания); 
		Если ПредыдущийНомерЗадания > 0 Тогда 
			ПредПредыдущийНомерЗадания = ПредыдущийНомерЗадания(ПредыдущийНомерЗадания); 
			
			объектСтруктура = ДанныеСтруктурыЗадания.Ссылка.ПолучитьОбъект();
			объектСтруктура.КодСДР  = (ПредыдущийНомерЗадания + ПредПредыдущийНомерЗадания)/2; 
			объектСтруктура.НомерЗаданияВУровне = Формат(объектСтруктура.КодСДР,"ЧРД=.");
			объектСтруктура.Записать();  
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПеренестиСтрокуВнизНаСервере(ЦБР_Задание)
	
	ДанныеСтруктурыЗадания  = ДанныеСтруктурыЗадания(ЦБР_Задание); 
	ТекущийНомерЗадания     = ДанныеСтруктурыЗадания.НомерЗаданияВУровне;  
	Если ТекущийНомерЗадания > 0 Тогда 
		СледующийНомерЗадания     = СледующийНомерЗадания(ТекущийНомерЗадания); 
		Если СледующийНомерЗадания > 0 Тогда 
			ПослеСледующийНомерЗадания = СледующийНомерЗадания(СледующийНомерЗадания); 
			Если ПослеСледующийНомерЗадания = 0 Тогда
				НовыйНомерЗадания = СледующийНомерЗадания + 1;  
			Иначе
				НовыйНомерЗадания = (СледующийНомерЗадания + ПослеСледующийНомерЗадания)/2;  
			КонецЕсли;	 
			
			объектСтруктура = ДанныеСтруктурыЗадания.Ссылка.ПолучитьОбъект();
			объектСтруктура.КодСДР  = НовыйНомерЗадания; 
			объектСтруктура.НомерЗаданияВУровне = Формат(объектСтруктура.КодСДР,"ЧРД=.");
			объектСтруктура.Записать();  
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДанныеСтруктурыЗадания(ЦБР_Задание)
	
	ДанныеСтруктурыЗадания = Новый Структура();
	ДанныеСтруктурыЗадания.Вставить("Ссылка", Неопределено);
	ДанныеСтруктурыЗадания.Вставить("НомерЗаданияВУровне", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦБР_СтруктураЗадач.Ссылка КАК Ссылка,
	|	ЦБР_СтруктураЗадач.КодСДР КАК НомерЗаданияВУровне
	|ИЗ
	|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
	|ГДЕ
	|	ЦБР_СтруктураЗадач.СсылкаНаЗадание = &СсылкаНаЗадание";
	
	Запрос.УстановитьПараметр("СсылкаНаЗадание", ЦБР_Задание);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДанныеСтруктурыЗадания.Вставить("Ссылка", ВыборкаДетальныеЗаписи.Ссылка);
		ДанныеСтруктурыЗадания.Вставить("НомерЗаданияВУровне", ВыборкаДетальныеЗаписи.НомерЗаданияВУровне);
	КонецЕсли;  
	
	Возврат ДанныеСтруктурыЗадания;
	
КонецФункции 

&НаСервере
Функция ПредыдущийНомерЗадания(НомерЗаданияВУровне)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦБР_СтруктураЗадач.Владелец КАК Владелец,
		|	МАКСИМУМ(ЦБР_СтруктураЗадач.КодСДР) КАК НомерЗаданияВУровне
		|ИЗ
		|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
		|ГДЕ
		|	ЦБР_СтруктураЗадач.КодСДР < &НомерЗаданияВУровне
		|	И ЦБР_СтруктураЗадач.Владелец = &Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦБР_СтруктураЗадач.Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("НомерЗаданияВУровне", НомерЗаданияВУровне);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерЗаданияВУровне;
	КонецЕсли;  
	
	Возврат 0;
	
КонецФункции 

&НаСервере
Функция СледующийНомерЗадания(НомерЗаданияВУровне)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦБР_СтруктураЗадач.Владелец КАК Владелец,
		|	МИНИМУМ(ЦБР_СтруктураЗадач.КодСДР) КАК НомерЗаданияВУровне
		|ИЗ
		|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
		|ГДЕ
		|	ЦБР_СтруктураЗадач.КодСДР > &НомерЗаданияВУровне
		|	И ЦБР_СтруктураЗадач.Владелец = &Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦБР_СтруктураЗадач.Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("НомерЗаданияВУровне", НомерЗаданияВУровне);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерЗаданияВУровне;
	КонецЕсли;  
	
	Возврат 0;
	
КонецФункции 

#КонецОбласти

#Область СогласованиеЭтапов

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	СсылкаНаЗадание = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(СсылкаНаЗадание) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(СсылкаНаЗадание) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьСтартованныеДействия = ЦБР_СтатусыОбъектовПолныеПрава.ЕстьСтартованныеДействия(СсылкаНаЗадание);
	Если ЕстьСтартованныеДействия Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Чтобы согласовать задание, необходимо закрыть все ОС");
		Возврат;
	КонецЕсли;
	
	РеквизитыЗадания = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(СсылкаНаЗадание, "ТрудозатратыПлан, ТрудозатратыФакт, ОплатаПоФакту");  
	
	Если НЕ ЗначениеЗаполнено(РеквизитыЗадания.ТрудозатратыПлан) Тогда
		Если Не РеквизитыЗадания.ОплатаПоФакту Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Должна быть точная оценка или оценка ""По факту""!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОтправитьНаСогласованиеНаСервере(СсылкаНаЗадание,Неопределено,РеквизитыЗадания);   
	
	ОбновитьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересогласоватьЭтап(Команда)
	
	ТекущиеДанные = Элементы.СписокЗаданийДерево.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ТекущиеДанные) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьСтартованныеДействия = ЦБР_СтатусыОбъектовПолныеПрава.ЕстьСтартованныеДействия(ТекущиеДанные);
	Если ЕстьСтартованныеДействия Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Чтобы согласовать задание, необходимо закрыть все ОС");
		Возврат;
	КонецЕсли; 
	
	Если ОшибкаПриПересогласовании(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("СсылкаНаЗадание", ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНовойОценки", ЭтотОбъект, ДопПараметры);	
 
    ПоказатьВводЗначения(
        Оповещение,
        , 
        "Введите новую оценку",
        "Число"
    );
  
КонецПроцедуры   

 &НаСервере
Процедура ОтправитьНаСогласованиеНаСервере(Знач СсылкаНаЗадание, НоваяОценка, РеквизитыЗадания)
	
	Получатели = Новый Массив;
	Получатели.Добавить(Объект.Постановщик);
	
	ОтправленныеЭтапы = Новый Массив;
	ОтправленныеЭтапы.Добавить(Объект.Наименование);

	Если Объект.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.ПоФакту И РеквизитыЗадания.ОплатаПоФакту Тогда 
		ЗаданиеОбъект = СсылкаНаЗадание.ПолучитьОбъект();
		ЗаданиеОбъект.ТрудозатратыПлан = НоваяОценка; 
		ЗаданиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	    ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(Объект.Ссылка, Перечисления.ЦБР_Состояние.Согласован);	
		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.СсылкаНаЗадачу, "СогласоватьОценку", Получатели, ОтправленныеЭтапы); 
		Возврат;
	КонецЕсли;
	
	ТрудозатратыПланСтарый = 0;
	ТрудозатратыПланНовый  = РеквизитыЗадания.ТрудозатратыПлан;

	Если НоваяОценка <> Неопределено Тогда 
		
		ТрудозатратыПланНовый  = НоваяОценка;
		
		ЗаданиеОбъект = СсылкаНаЗадание.ПолучитьОбъект();
		ЗаданиеОбъект.ТрудозатратыПлан = НоваяОценка; 
		СтатусЗадания = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадания(СсылкаНаЗадание);	
		Если СтатусЗадания <> Перечисления.ЦБР_Состояние.НаСогласовании Тогда  
			ЗаданиеОбъект.ТрудозатратыПланСтарый = РеквизитыЗадания.ТрудозатратыПлан;  
		КонецЕсли;
		ТрудозатратыПланСтарый = ЗаданиеОбъект.ТрудозатратыПланСтарый;
		ЗаданиеОбъект.Записать(РежимЗаписиДокумента.Проведение);  
	КонецЕсли;
	
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(СсылкаНаЗадание, Перечисления.ЦБР_Состояние.НаСогласовании);	
	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, "СогласованиеОценки", Получатели, ОтправленныеЭтапы);
	
	Если ТрудозатратыПланСтарый > 0 Тогда 
		ЦБР_ОбсужденияСервер.ОтправитьСообщениеВОбщееОбсуждение(Объект.Ссылка, СтрШаблон("Прежняя оценка: %1 ч", ТрудозатратыПланСтарый), Получатели);     
	КонецЕсли;	
	
	ЦБР_ОбсужденияСервер.ОтправитьСообщениеВОбщееОбсуждение(Объект.Ссылка, СтрШаблон("Новая оценка для согласования: %1 ч", ТрудозатратыПланНовый), Получатели);     
	
	Если РеквизитыЗадания.ОплатаПоФакту Тогда 
		ЦБР_ОбсужденияСервер.ОтправитьСообщениеВОбщееОбсуждение(Объект.Ссылка, "Согласование по факту", Получатели);     
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьВсеЭтапы(Команда)
	
	СогласоватьВсеЭтапыНаСервере();
	ОбновитьЗадачу(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда  
		СогласованиеНаСервере(Результат);
		ОбновитьЗадачу();
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНовойОценки(Результат, Параметры) Экспорт	
 
	Если Не Результат = Неопределено Тогда
		СсылкаНаЗадание = Параметры.СсылкаНаЗадание;
		
		РеквизитыЗадания = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(СсылкаНаЗадание, "ТрудозатратыПлан, ТрудозатратыФакт, ОплатаПоФакту");  
		
		Если Результат < РеквизитыЗадания.ТрудозатратыФакт Тогда 
			ТекстСообщения = СтрШаблон("Новая оценка не может быть меньше фактически выполненных часов. Выполнено: %1 ч", РеквизитыЗадания.ТрудозатратыФакт); 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
		Иначе    
			ОтправитьНаСогласованиеНаСервере(СсылкаНаЗадание, Результат, РеквизитыЗадания);   
			ОбновитьЗадачу();
		КонецЕсли;
    КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура СогласованиеНаСервере(Результат) 

	ТрудозатратыПлан = 0;
	
	НачатьТранзакцию();
	
	Попытка                                                            
		ЗаданиеОбъект = Результат.СсылкаНаЗадание.ПолучитьОбъект();  
		
		РеквизитыЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаданиеОбъект.Ссылка, "Исполнитель, Наименование"); 
		
		Получатели = Новый Массив;
		Получатели.Добавить(РеквизитыЗадания.Исполнитель);
		
		СогласованыеЭтапы = Новый Массив;
		СогласованыеЭтапы.Добавить(РеквизитыЗадания.Наименование); 
		
		Если Результат.Согласование Тогда   
			Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Согласован");  
			СообщениеУведомления = "СогласоватьОценку"; 
		    ЗаданиеОбъект.ЧасыСогласованы = Истина;   
			Если ЗаданиеОбъект.РамочнаяОценка Тогда
				ЗаданиеОбъект.РамочнаяОценка = Ложь; 
				ЗаданиеОбъект.ТрудозатратыПлан = ЗаданиеОбъект.ТрудозатратыПланДо; 
			КонецЕсли;	
		Иначе  
			СообщениеУведомления = "ОтклонитьОценку"; 
			ЗаданиеОбъект.КоментарийКСогласованию = Результат.КомментарийОтказа;      
			СогласованыеЭтапы.Добавить(Результат.КомментарийОтказа); 
			
			Если ЗаданиеОбъект.ОплатаПоФакту Тогда 
				ЗаданиеОбъект.ОплатаПоФакту = Ложь;
				ТекстСообщенияПриОтказе = "Оценка по факту не согласована";
			Иначе
				ТекстСообщенияПриОтказе = СтрШаблон("Оценка %1 ч не согласована", ЗаданиеОбъект.ТрудозатратыПлан);
			КонецЕсли;	
			
			Если ЗаданиеОбъект.ЧасыСогласованы = Истина Тогда
				ЗаданиеОбъект.ТрудозатратыПлан = ЗаданиеОбъект.ТрудозатратыПланСтарый;  
				Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Согласован");  
			Иначе
				Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.НеСогласован");
			КонецЕсли;
	
		КонецЕсли;  	
		
		ЗаданиеОбъект.Записать(РежимЗаписиДокумента.Проведение);      
		
		ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(ЗаданиеОбъект.Ссылка, Состояние);	
	
		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, СообщениеУведомления, Получатели, СогласованыеЭтапы);
		
		Если ТекстСообщенияПриОтказе <> "" Тогда 
			ЦБР_ОбсужденияСервер.ОтправитьСообщениеВОбщееОбсуждение(Объект.Ссылка, ТекстСообщенияПриОтказе, Получатели);     
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();             
		
		ЗаписьЖурналаРегистрации("Ошибка ЦБР", УровеньЖурналаРегистрации.Ошибка, , ,
		"При согласовании произошла ошибка." + Символы.ПС +
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры            

&НаСервере
Процедура СогласоватьВсеЭтапыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦБР_СостоянияЗаданий.Задание КАК Задание,
		|	ЦБР_СостоянияЗаданий.Состояние КАК Состояние,
		|	ЦБР_СостоянияЗаданий.Задание.Исполнитель КАК Исполнитель,
		|	ЦБР_СостоянияЗаданий.Задание.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
		|ГДЕ
		|	ЦБР_СостоянияЗаданий.Состояние = &Состояние
		|	И ЦБР_СостоянияЗаданий.Задание.СсылкаНаЗадачу = &СсылкаНаЗадачу";
	
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", Объект.Ссылка);
	Запрос.УстановитьПараметр("Состояние", Перечисления.ЦБР_Состояние.НаСогласовании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
         Возврат;
	КонецЕсли;	 
	
	ВыборкаЗаданий = РезультатЗапроса.Выбрать();
	
	ТрудозатратыПлан     = 0;
	СогласованыеЭтапы    = Новый Массив;
	Получатели           = Новый Массив;
	СообщениеУведомления = "СогласоватьОценку";
	
	НачатьТранзакцию();
	
	Попытка  
		Пока ВыборкаЗаданий.Следующий() Цикл
			
			ЗаданиеОбъект = ВыборкаЗаданий.Задание.ПолучитьОбъект();  
			
			Получатели.Добавить(ВыборкаЗаданий.Исполнитель);
			СогласованыеЭтапы.Добавить(ВыборкаЗаданий.Наименование); 
			
			Состояние = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.Согласован");  
			ЗаданиеОбъект.ЧасыСогласованы = Истина;
			
			Если ЗаданиеОбъект.РамочнаяОценка Тогда
				ЗаданиеОбъект.РамочнаяОценка   = Ложь; 
				ЗаданиеОбъект.ТрудозатратыПлан = ЗаданиеОбъект.ТрудозатратыПланДо; 
			КонецЕсли;	 
			
			ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(ЗаданиеОбъект.Ссылка, Состояние);	
			
			ЗаданиеОбъект.Записать(РежимЗаписиДокумента.Проведение);      
			
		КонецЦикла;  
		
		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Ссылка, СообщениеУведомления, Получатели, СогласованыеЭтапы); 
		
		ЗафиксироватьТранзакцию();  
	
	Исключение
		ОтменитьТранзакцию();             
		
		ЗаписьЖурналаРегистрации("Ошибка ЦБР", УровеньЖурналаРегистрации.Ошибка, , ,
		"При согласовании произошла ошибка." + Символы.ПС +
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
    ЦБР_ТребуетВниманияПолныеПрава.ЦБР_ЗаписьОбъектаТребуетВнимание(Объект.Ссылка, Ложь);
		
КонецПроцедуры

#КонецОбласти 


