
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("Пересогласование") Тогда 
        Если Параметры.Пересогласование Тогда
            Пересогласование = Параметры.Пересогласование;  
            СтараяОценка = Параметры.ТрудозатратыФакт;
        КонецЕсли;
    Иначе
        Пересогласование = Ложь;
        СтараяОценка = 0;
    КонецЕсли; 
	
	ОценкаОт 		= Параметры.ТрудозатратыПланОт;
	ОценкаДо 		= Параметры.ТрудозатратыПланДо;
	ОценкаФинал 	= Параметры.ТрудозатратыПлан;
	Комментарий 	= Параметры.ТрудозатратыПланКомментарий;
	ВидЧаса     	= Параметры.ВидЧаса;
	НетГарантии 	= Параметры.НетГарантии;
	ЭтаФорма.Доступность = НЕ Параметры.ТолькоПросмотр;
	
	Если НЕ ЗначениеЗаполнено(ВидЧаса) Тогда
		ВидЧаса = Перечисления.ЦБР_ВидыЧасовПоЗадачам.Платные;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОценкаФинал) Тогда
		ВидОценки =  "Точная";
	ИначеЕсли ЗначениеЗаполнено(ОценкаОт) Тогда
		ВидОценки =  "Рамочная";
	ИначеЕсли Параметры.ОплатаПоФакту Тогда
		ВидОценки = "ПоФакту";
	Иначе
		ВидОценки = "Точная";
	КонецЕсли;
		
	УстановитьВидимостьПолейОценки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидОценкиПриИзменении(Элемент)
	УстановитьВидимостьПолейОценки();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеФункции

&НаСервере
Процедура УстановитьВидимостьПолейОценки()
	
	Если ВидОценки =  "Рамочная" Тогда
		Элементы.ТочнаяОценкаГруппа.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочнаяОценкаГруппа", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РамочнаяОценкаГруппа", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидЧаса", "Видимость", Истина);		
	ИначеЕсли ВидОценки = "ПоФакту" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочнаяОценкаГруппа", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РамочнаяОценкаГруппа", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидЧаса", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочнаяОценкаГруппа", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РамочнаяОценкаГруппа", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидЧаса", "Видимость", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	ОплатаПоФакту = Ложь;
	
	Если Пересогласование И НЕ ЗначениеЗаполнено(Комментарий) Тогда  
	   ОчиститьСообщения();
	   Сообщение = Новый СообщениеПользователю;
	   Сообщение.Текст = "При изменении согласованной оценки поле ""Комментарий"" обязательно к заполнениию!";
	   Сообщение.Сообщить();
	   Возврат; 
	ИначеЕсли Пересогласование И ЗначениеЗаполнено(СтараяОценка) И СтараяОценка > ОценкаФинал Тогда
	   ОчиститьСообщения();
	   Сообщение = Новый СообщениеПользователю;
	   Сообщение.Текст = "Количество часов не должно быть меньше, чем фактически выполненные часы";
	   Сообщение.Сообщить();
	   Возврат;    
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВидОценки) ИЛИ НЕ ЗначениеЗаполнено(ВидЧаса) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнены обязательные поля.");
		Возврат;		
	КонецЕсли;
	
	Если ВидОценки =  "Рамочная" Тогда
		Если ОценкаДо <= ОценкаОт Тогда
			ТекстСообщения = "Верхний уровень оценки должен быть выше нижнего!";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		ИначеЕсли ОценкаОт = 0 Тогда
			ТекстСообщения = "Нижний порог не может быть 0!";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОценки =  "Рамочная" Тогда
		ОценкаФинал = 0;
		НетГарантии = Ложь;
	ИначеЕсли ВидОценки =  "Точная" И ОценкаФинал = 0 Тогда
		ТекстСообщения = "Оценка не может быть 0!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ВидОценки =  "ПоФакту" Тогда
		ВидЧаса = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_ВидыЧасовПоЗадачам.Платные");
		ОценкаФинал = 0;
		ОценкаОт = 0;
		ОценкаДо = 0;
		ОплатаПоФакту = Истина;
	КонецЕсли;
	
	
	ПараметрыПрименения = Новый Структура;
	ПараметрыПрименения.Вставить("ТрудозатратыПланОт", ОценкаОт);
	ПараметрыПрименения.Вставить("ТрудозатратыПланДо", ОценкаДо);
	ПараметрыПрименения.Вставить("ТрудозатратыПлан", ОценкаФинал);
	ПараметрыПрименения.Вставить("ТрудозатратыПланКомментарий", Комментарий);
	Если НЕ Пересогласование Тогда 
		ПараметрыПрименения.Вставить("ТипОценки", ВидОценки);
	Иначе
		ПараметрыПрименения.Вставить("ОплатаПоФакту", ОплатаПоФакту);
	КонецЕсли;
	ПараметрыПрименения.Вставить("ВидЧаса", ВидЧаса);
	ПараметрыПрименения.Вставить("НетГарантии", НетГарантии);
	
	ЭтаФорма.Закрыть(ПараметрыПрименения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаФиналПриИзменении(Элемент)
	ОценкаФинал = ОкруглитьОценку(ОценкаФинал);
КонецПроцедуры

&НаКлиенте
Процедура ОценкаОтПриИзменении(Элемент)
	ОценкаОт = ОкруглитьОценку(ОценкаОт);
КонецПроцедуры

&НаКлиенте
Процедура ОценкаДоПриИзменении(Элемент)
	ОценкаДо = ОкруглитьОценку(ОценкаДо);
КонецПроцедуры

&НаКлиенте
Функция ОкруглитьОценку(ОкругляемаяОценка)
	Возврат ЦенообразованиеКлиентСервер.ОкруглитьЦену(ОкругляемаяОценка, 0.5, ПредопределенноеЗначение("Перечисление.ВариантыОкругления.ВсегдаВПользуПредприятия"));
КонецФункции



&НаКлиенте
Процедура ОценкаФиналРегулирование(Элемент, Направление, СтандартнаяОбработка)

	ОценкаРегулирование(ОценкаФинал, Направление, СтандартнаяОбработка);
	
//	СтандартнаяОбработка = Ложь;
//	
//	Если Направление = 1 Тогда
//		ОценкаФинал = ОценкаФинал + 0.5;
//	Иначе
//		ОценкаФинал = ОценкаФинал - 0.5;
//	КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ОценкаОтРегулирование(Элемент, Направление, СтандартнаяОбработка)

	ОценкаРегулирование(ОценкаОт, Направление, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаДоРегулирование(Элемент, Направление, СтандартнаяОбработка)

	ОценкаРегулирование(ОценкаДо, Направление, СтандартнаяОбработка);
 
КонецПроцедуры

&НаКлиенте
Процедура ОценкаРегулирование(ЭлементРегулирования, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Направление = 1 Тогда
		ЭлементРегулирования = ЭлементРегулирования + 0.5;
	Иначе
		ЭлементРегулирования = ЭлементРегулирования - 0.5;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
    //Вставить содержимое обработчика
КонецПроцедуры


#КонецОбласти