
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
   
    ЗадатьУсловияВЗапрос(Параметры)      
    
КонецПроцедуры 


Процедура ЗадатьУсловияВЗапрос(Параметры)

       
    Если Параметры.УсловиеВыбора = "ВыборИсполнителяПоКуратору" Тогда
        Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "СправочникЦБР_ГруппыСотрудников.ПометкаУдаления = ЛОЖЬ",
        "СправочникЦБР_ГруппыСотрудников.ПометкаУдаления = ЛОЖЬ
	    |И СправочникЦБР_ГруппыСотрудников.Руководитель = &Куратор");
                                   
        Список.Параметры.УстановитьЗначениеПараметра("Куратор", Параметры.Куратор);
        	                                
    ИначеЕсли Параметры.УсловиеВыбора = "ВыборИсполнителяБезКуратора" Тогда
        Возврат;                         
    ИначеЕсли Параметры.УсловиеВыбора = "ВыборКуратора" ИЛИ Параметры.УсловиеВыбора = "ВыборРуководителя" Тогда  
    
        Список.ТекстЗапроса = "ВЫБРАТЬ
                              | СправочникЦБР_ГруппыСотрудников.Наименование КАК Направление,
                              | СправочникЦБР_ГруппыСотрудников.Ссылка КАК Отдел,
                              | СправочникЦБР_ГруппыСотрудников.Руководитель КАК Руководитель
                              |ПОМЕСТИТЬ ГруппыСотрудников
                              |ИЗ
                              | Справочник.ЦБР_ГруппыСотрудников КАК СправочникЦБР_ГруппыСотрудников
                              |ГДЕ
                              | СправочникЦБР_ГруппыСотрудников.ПометкаУдаления = ЛОЖЬ
                              |;
                              |
                              |////////////////////////////////////////////////////////////////////////////////
                              |ВЫБРАТЬ
                              | Пользователи.Ссылка КАК Пользователь,
                              | Пользователи.ВерсияДанных КАК ВерсияДанных,
                              | Пользователи.ПометкаУдаления КАК ПометкаУдаления,
                              | Пользователи.Наименование КАК Наименование,
                              | Пользователи.Недействителен КАК Недействителен,
                              | Пользователи.Подразделение КАК Направление,
                              | Пользователи.ФизическоеЛицо КАК ФизическоеЛицо,
                              | Пользователи.Комментарий КАК Комментарий,
                              | Пользователи.Служебный КАК Служебный,
                              | Пользователи.Подготовлен КАК Подготовлен,
                              | Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
                              | Пользователи.ИдентификаторПользователяСервиса КАК ИдентификаторПользователяСервиса,
                              | Пользователи._центрНеВыводитьВОтчеты КАК _центрНеВыводитьВОтчеты,
                              | Пользователи.СвойстваПользователяИБ КАК СвойстваПользователяИБ,
                              | Пользователи.CRM_ДолжностнаяПозиция КАК CRM_ДолжностнаяПозиция,
                              | Пользователи.CRM_ОтписалсяОтEmailРассылок КАК CRM_ОтписалсяОтEmailРассылок,
                              | Пользователи.CRM_Планируемый КАК CRM_Планируемый,
                              | Пользователи.CRM_УчаствуетВАнкетировании КАК CRM_УчаствуетВАнкетировании,
                              | Пользователи.CRM_Фотография КАК CRM_Фотография,
                              | Пользователи.CRM_НаправлениеДеятельности КАК CRM_НаправлениеДеятельности,
                              | Пользователи.CRM_ЕмейлДляСинхронизации КАК CRM_ЕмейлДляСинхронизации,
                              | Пользователи.Фотография КАК Фотография,
                              | Пользователи.CRM_РазрешеноИзменятьКоординаты КАК CRM_РазрешеноИзменятьКоординаты,
                              | Пользователи.Предопределенный КАК Предопределенный,
                              | Пользователи.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
                              | Пользователи.Представление КАК Представление
                              |ИЗ
                              | Справочник.Пользователи КАК Пользователи,
                              | ГруппыСотрудников КАК ГруппыСотрудников
                              |ГДЕ
                              | Пользователи.Ссылка = ГруппыСотрудников.Руководитель";
                              
    КонецЕсли;
    
         
КонецПроцедуры


