#Область ПрограммныйИнтерфейс 

Процедура РасчитатьЭффективностьСотрудника() Экспорт
	ПолучитьДействияСотрудников();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеФункцииИПроцедуры

Процедура ПолучитьДействияСотрудников()
	
	ГрафикРаботы = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьГрафикРаботы();
	РабочиеДаты = ЦБР_ЗадачиЗаданияВызовСервера.СформироватьТаблицуРабочегоВремени(ГрафикРаботы, ТекущаяДатаСеанса() - 30 * 24 * 3600, ТекущаяДатаСеанса());
	
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Пользователи", , , ));
	ТаблицаДат.Колонки.Добавить("ДатаНачалаОС", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДат.Колонки.Добавить("ДатаОкончанияОС", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДат.Колонки.Добавить("РабочийДень", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДат.Колонки.Добавить("ДлительностьРабочегоДня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	Для Каждого Стр Из РабочиеДаты Цикл 
		Стр.ДатаНачала = НачалоДня(Стр.ДатаНачала);
	КонецЦикла;
	
	РабочиеДаты.Свернуть("ДатаНачала", "Длительность");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РабочиеДни.ДатаНачала, ДЕНЬ) КАК РабочийДень,
	|	РабочиеДни.Длительность КАК ДлительностьРабочегоДня
	|ПОМЕСТИТЬ ВТ_РабочиеДни
	|ИЗ
	|	&РабочиеДни КАК РабочиеДни
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_ГруппыСотрудниковСостав.Пользователь КАК Пользователь,
	|	ВТ_РабочиеДни.РабочийДень КАК РабочийДень,
	|	ВТ_РабочиеДни.ДлительностьРабочегоДня КАК ДлительностьРабочегоДня
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеДни КАК ВТ_РабочиеДни
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЦБР_ГруппыСотрудниковСостав.Недействителен = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_ЗаписиРабочегоКалендаря.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ЦБР_ЗаписиРабочегоКалендаря.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияОС,
	|	ЕСТЬNULL(ЦБР_ЗаписиРабочегоКалендаря.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаОС,
	|	ВТ_Сотрудники.РабочийДень КАК РабочийДень,
	|	ВТ_Сотрудники.Пользователь КАК Сотрудник,
	|	ВТ_Сотрудники.ДлительностьРабочегоДня КАК ДлительностьРабочегоДня
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
	|		ПО ВТ_Сотрудники.Пользователь = ЦБР_ЗаписиРабочегоКалендаря.Пользователь
	|			И (ВТ_Сотрудники.РабочийДень = НАЧАЛОПЕРИОДА(ЦБР_ЗаписиРабочегоКалендаря.ДатаНачала, ДЕНЬ))
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийДень
	|ИТОГИ ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("РабочиеДни", РабочиеДаты);
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого Стр Из Результат.Строки Цикл
		Сотрудник = Стр.Сотрудник;
		
		БылиИзменения = Истина;
		Пока БылиИзменения Цикл
			ПересчитатьТаблицуВремени(БылиИзменения, ТаблицаДат, Стр.Строки, Сотрудник);
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаДат.Колонки.Добавить("РазницаВСекундах", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	Для Каждого Строка Из ТаблицаДат Цикл
		Если ЗначениеЗаполнено(Строка.ДатаОкончанияОС) И ЗначениеЗаполнено(Строка.ДатаНачалаОС) Тогда  
			Строка.РазницаВСекундах = Строка.ДатаОкончанияОС - Строка.ДатаНачалаОС;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДат.Свернуть("Сотрудник, РабочийДень, ДлительностьРабочегоДня", "РазницаВСекундах");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДат.Сотрудник КАК Сотрудник,
	|	ТаблицаДат.РабочийДень КАК РабочийДень,
	|	ТаблицаДат.ДлительностьРабочегоДня КАК ДлительностьРабочегоДня,
	|	ТаблицаДат.РазницаВСекундах КАК РазницаВСекундах
	|ПОМЕСТИТЬ ВТ_ТаблицаДат
	|ИЗ
	|	&ТаблицаДат КАК ТаблицаДат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_СогласованоЗакрытоЧасов.Согласовано КАК ЭффективныеЧасы,
	|	ВТ_ТаблицаДат.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДат.РабочийДень КАК РабочийДень,
	|	ВТ_ТаблицаДат.РазницаВСекундах КАК РабочиеЧасы
	|ИЗ
	|	ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЦБР_СогласованоЗакрытоЧасов КАК ЦБР_СогласованоЗакрытоЧасов
	|		ПО ВТ_ТаблицаДат.Сотрудник = ЦБР_СогласованоЗакрытоЧасов.Исполнитель
	|			И (ВТ_ТаблицаДат.РабочийДень = НАЧАЛОПЕРИОДА(ЦБР_СогласованоЗакрытоЧасов.Период, ДЕНЬ))
	|ИТОГИ ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("ТаблицаДат", ТаблицаДат);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСотрудник.Следующий() Цикл	 
		
		Выборка = ВыборкаСотрудник.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ЦБР_ЭффективныеЧасыПоДням.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Дата = Выборка.РабочийДень;
			МенеджерЗаписи.Сотрудник = Выборка.Сотрудник;
			МенеджерЗаписи.ЭффективныеЧасы = Выборка.ЭффективныеЧасы;
			МенеджерЗаписи.РабочиеЧасы = Выборка.РабочиеЧасы / 3600; 
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПересчитатьТаблицуВремени(БылиИзменения, ТаблицаДат, Строки, Сотрудник)
	
	БылиИзменения = Ложь;
	Для Каждого Строка Из Строки Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаДат.Добавить(), Строка);
		
		Для Каждого Строка2 Из Строки Цикл
			
			Если Строка = Строка2 Тогда
				Продолжить;
			КонецЕсли;
			
			Если (Строка.ДатаНачалаОС <= Строка2.ДатаОкончанияОС) 
				И (Строка.ДатаОкончанияОС >= Строка2.ДатаНачалаОС) Тогда // любое пересечение (и поглощение)
				
				Если (Строка.ДатаНачалаОС > Строка2.ДатаНачалаОС) 
					И (Строка.ДатаОкончанияОС < Строка2.ДатаОкончанияОС) Тогда // поглощение
					Продолжить; // поглощение проверяемой строки, не меняем её
					
				ИначеЕсли (Строка.ДатаНачалаОС < Строка2.ДатаНачалаОС) 
					И (Строка.ДатаОкончанияОС > Строка2.ДатаОкончанияОС) Тогда // поглощение
					
					// наша Строка поглотила Строку2, разбиваем нашу строку на 2 части (создаем запись, вторую просто редачим)
					НоваяСтрока = ТаблицаДат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					НоваяСтрока.ДатаНачалаОС = Строка2.ДатаОкончанияОС;
					Строка.ДатаОкончанияОС = Строка2.ДатаНачалаОС;
					БылиИзменения = Истина;
					Возврат;
					
				Иначе // наложение
					
					Если Строка.ДатаНачалаОС < Строка2.ДатаНачалаОС Тогда // изменяем, т.к. она более ранняя
						// у нас наложение, поэтому либо старт либо финиш внутри
						Если Строка2.ДатаНачалаОС < Строка.ДатаНачалаОС И Строка.ДатаНачалаОС < Строка2.ДатаОкончанияОС Тогда
							Строка.ДатаНачалаОС = Строка2.ДатаОкончанияОС;
						ИначеЕсли Строка2.ДатаНачалаОС < Строка.ДатаОкончанияОС И Строка.ДатаОкончанияОС < Строка2.ДатаОкончанияОС Тогда
							Строка.ДатаОкончанияОС = Строка2.ДатаНачалаОС;
						Иначе
							Продолжить;
						КонецЕсли;
						БылиИзменения = Истина;
						Возврат;
					КонецЕсли; // иначе не изменяем
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ЦБР_РеализацияПриПроведенииДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.cbr_РеализацияТоваровУслугУПР") Тогда   
		Для Каждого Строка ИЗ Источник.Товары Цикл		
			Источник.Движения.ЦБР_ЧасыКлиентов.Записывать = Истина; 
			Источник.Движения.ЦБР_ЧасыКлиентов.Очистить();
			Если Строка.центрБесплатныеЧасыПоНаряду <> 0 Тогда
				Движение = Источник.Движения.ЦБР_ЧасыКлиентов.Добавить();
				Движение.Период        = Источник.Дата;
				Движение.Акт           = Источник.Ссылка;
				Движение.Контрагент    = Источник.Контрагент;  	
				Движение.Менеджер      = Источник.Менеджер;  	
				Движение.ВидЧаса       = Перечисления.ЦБР_ВидыЧасовПоЗадачам.Бесплатные;  	
				Движение.Часы          = Строка.центрБесплатныеЧасыПоНаряду;  	
			ИначеЕсли Строка.центрИТСЧасыПоНаряду <> 0 Тогда
				Движение = Источник.Движения.ЦБР_ЧасыКлиентов.Добавить();
				Движение.Период        = Источник.Дата;
				Движение.Акт           = Источник.Ссылка;
				Движение.Контрагент    = Источник.Контрагент;  	
				Движение.Менеджер      = Источник.Менеджер;  	
				Движение.ВидЧаса       = Перечисления.ЦБР_ВидыЧасовПоЗадачам.ИТС;  	
				Движение.Часы          = Строка.центрИТСЧасыПоНаряду;  	
			ИначеЕсли Строка.центрЧасыПоНаряду <> 0 Тогда
				Движение = Источник.Движения.ЦБР_ЧасыКлиентов.Добавить();
				Движение.Период        = Источник.Дата;
				Движение.Акт           = Источник.Ссылка;
				Движение.Контрагент    = Источник.Контрагент;  	
				Движение.Менеджер      = Источник.Менеджер;  	
				Движение.ВидЧаса       = Перечисления.ЦБР_ВидыЧасовПоЗадачам.Платные;  	
				Движение.Часы          = Строка.центрЧасыПоНаряду;
			КонецЕсли;
		КонецЦикла ;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

