Процедура ДобавитьЭлементы_ФормаЭлемента(Форма, Данные) Экспорт    	

	//@skip-check empty-except-statement
	Попытка
		Объект = Данные.Ссылка.ПолучитьОбъект();
		
		Если ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			СпрНоменклатура(Форма, Объект);
		ИначеЕсли ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
			СпрВидНоменклатуры(Форма, Объект);
		КонецЕсли;
	Исключение
	КонецПопытки;  
	
КонецПроцедуры

Процедура СпрНоменклатура(Форма, Объект) //справочник Номенклатура 

	ЦБР_ПриСозданииФормНаСервере.СздГруппаОбычная(Форма,"_центрГруппаРеквизиты",Форма.Элементы.ГруппаПраво, "Центр: Реквизиты", 1,,,,Форма.Элементы.ГруппаЗаголовокОсновныеПараметрыУчета);
	ЦБР_ПриСозданииФормНаСервере.СздПолеФлажок(Форма,"_центрЦенаИзПрайса",Форма.Элементы._центрГруппаРеквизиты,"Цена из прайса",3,"Объект._центрЦенаИзПрайса");
	ЦБР_ПриСозданииФормНаСервере.СздПолеФлажок(Форма,"_центрПродажаЧерезИП",Форма.Элементы._центрГруппаРеквизиты,"Продажа через ИП",3,"Объект._центрПродажаЧерезИП");

КонецПроцедуры

Процедура СпрВидНоменклатуры(Форма, Объект)//справочник Вид Номенклатуры     

	ЦБР_ПриСозданииФормНаСервере.СздСтраница(Форма, "центрСтраницаРеквизиты", Форма.Элементы.Страницы, "Центр:Реквизиты");	
	ЦБР_ПриСозданииФормНаСервере.СздПолеФлажок(Форма,"_центрПродажаЧерезИП",Форма.Элементы.центрСтраницаРеквизиты,"Продажа через ИП",3,"Объект._центрПродажаЧерезИП");
	ЦБР_ПриСозданииФормНаСервере.СздПоле(Форма, "_центрСтатьяДДС", Форма.Элементы.центрСтраницаРеквизиты, "Статья ДДС", 1, "Объект._центрСтатьяДДС"); 

КонецПроцедуры