
// Процедура - Сделать запись в регистр
//
// Параметры:
//  ДанныеЗаполнения - Структура  -
//	 * Период - Дата
//	 * Задание - ДокументСсылка.ЦБР_Задание
//	 * КоличествоЧасов - Число 
//	 * Постановщик - СправочникСсылка.Пользователи
//	 * ПодразделениеПостановщика - СправочникСсылка.СтруктураПредприятия
//	 * Исполнитель - СправочникСсылка.Пользователи
//	 * ПодразделениеИсполнителя - СправочникСсылка.СтруктураПредприятия
//
Процедура СделатьЗаписьВРегистр(ДанныеЗаполнения) Экспорт
	МенеджерЗаписи  = РегистрыСведений.ЦБР_ЗанятостьПоДням.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаполнения);
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры 

Функция ПолучитьСтруктуруДляЗаписи() Экспорт 
	
	ДанныеЗаполнения = Новый Структура("Дата, Задание, КоличествоЧасов, Постановщик, ПодразделениеПостановщика, Исполнитель, ПодразделениеИсполнителя");	
	Возврат ДанныеЗаполнения;
	
КонецФункции