
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗаполнитьТаблицуСотрудникиИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Если ИмяСобытия = "Запись_ДоступноеВремяПользователя" Тогда
	//	ЗаполнитьТаблицуСотрудникиИДоступность();
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СотрудникиИДоступность

&НаКлиенте
Процедура СотрудникиИДоступностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СотрудникиИДоступность.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И Элементы.СотрудникиИДоступность.ТекущийЭлемент = Элементы.ДоступностьСтрокой Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
		ОткрытьФорму(
			"РегистрСведений.ДоступноеВремяСотрудников.Форма.НастройкаДоступногоВремени",
			ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиИДоступностьПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.СотрудникиИДоступность.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или Элементы.СотрудникиИДоступность.ТекущийЭлемент <> Элементы.Сотрудник Тогда
		
		Возврат;
	КонецЕсли; 
	
	ПоказатьЗначение(, ТекущиеДанные.Сотрудник);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

//&НаСервере
//Процедура ЗаполнитьТаблицуСотрудникиИДоступность()
//	
//	СотрудникиИДоступность.Очистить();
//	
//	СотрудникиПользователя = Сотрудники.ВсеСотрудникиТекущегоПользователя();
//	
//	НастройкиДоступности = РаботаСРабочимКалендаремСервер.НастройкиДоступностиСотрудников(
//		СотрудникиПользователя);
//	
//	Для Каждого НастройкаДоступности Из НастройкиДоступности Цикл
//		СтрокаТаблицы = СотрудникиИДоступность.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, НастройкаДоступности);
//		СтрокаТаблицы.ДоступностьСтрокой = Строка(СтрокаТаблицы.Доступность);
//	КонецЦикла;
//			
//КонецПроцедуры

#КонецОбласти