&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") И Параметры.Свойство("Задача", Задача) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
		Для Каждого Участник Из Параметры.Команда Цикл
			Если Пользователь = Участник Тогда
				Продолжить;
			КонецЕсли;
			Команда.Добавить(Участник);
		КонецЦикла;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отправить(КомандаФормы)
	Получатели = Новый Массив;
	Для Каждого Значение Из Команда Цикл
		Если Значение.Пометка Тогда
			Получатели.Добавить(Значение.Значение);
		КонецЕсли;
	КонецЦикла;
	Если Получатели.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрано ни одного получателя");
	Иначе
		ОтправитьНаСервере(Получатели);
		Закрыть();		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере(Получатели)
	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Задача, "Уведомление", Получатели);
КонецПроцедуры
