
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	БесплатныеЧасыОстаток = Параметры.БесплатныеЧасы; 
	ПлатныеЧасыОстаток    = Параметры.ПлатныеЧасы;
	ИТСЧасыОстаток        = Параметры.ИТСЧасы;
	ЧасыУстановкиОстаток  = Параметры.ЧасыУстановки;   
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	Если БесплатныеЧасы > БесплатныеЧасыОстаток ИЛИ ПлатныеЧасы > ПлатныеЧасыОстаток ИЛИ ИТСЧасы > ИТСЧасыОстаток ИЛИ ЧасыУстановки > ЧасыУстановкиОстаток Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Отделяемые часы превышают остаток!!!");
		Возврат;
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура("БесплатныеЧасы, ПлатныеЧасы, ИТСЧасы, ЧасыУстановки", БесплатныеЧасы, ПлатныеЧасы, ИТСЧасы, ЧасыУстановки);
	
	ЭтаФорма.Закрыть(СтруктураРезультата);	 
	
КонецПроцедуры

