#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьОбработчикОжидания("АвтообновлениеАРМ", 60);
	УстановитьВидимостьЭлементов();
	ЗаполнитьСписокНаправленийДляОтбора();

	Элементы.АРМЗадачи.Пометка = Истина; 
	//@skip-check new-color
	Элементы.АРМЗадачи.ЦветФона = Новый Цвет(30, 144, 255);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.АРМЗадачи.Пометка 	= Истина;
	Элементы.АРМЗадачи.ЦветФона = Новый Цвет(30,144,255);

	ОпределитьТипСотрудника();
	ЗаполнитьТаблицуТребуетВнимания();  
	Если ЭтоРуководитель Тогда
		ЗаполнитьТаблицуТребуетВниманияРуководителя(); 
	КонецЕсли;
	ИнициализироватьАРМПользователя();  
	
	ОтображаемаяДата = НачалоДня(ТекущаяДатаСеанса());
	ПериодОтображения = РаботаСРабочимКалендаремСервер.ПолучитьПерсональнуюНастройку(
		"ПериодОтображенияРабочегоКалендаря");
	ОтображатьЛегенду = РаботаСРабочимКалендаремСервер.ПолучитьПерсональнуюНастройку(
		"ОтображатьЛегенду");

	УстановитьГрафикРаботы();
	УстановитьАвтообновление();
	УстановитьВариантРаботыФормы();

	ОбновитьОтображениеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЗаписьКалендаря" Тогда
		
		//Если ТипЗнч(Параметр) = Тип("Массив") Тогда
		//	Если Параметр.Количество() <> 0 Тогда
		//		ТекущаяЗаписьКалендаря = Параметр[0];
		//		ТекущаяДатаНачала = Неопределено;
		//	КонецЕсли;
		//КонецЕсли;
		
		//ОбновитьОтображениеКлиент(Параметр);  
		ОбновитьОтображениеКлиент();

	КонецЕсли;
	
	Если ИмяСобытия = "Запись_ДоступноеВремяПользователя" Или ИмяСобытия = "Запись_ЗанятостьСотрудника" Или ИмяСобытия
		= "Запись_Мероприятие" Или ИмяСобытия = "Запись_ДоступноеВремяПользователя" Или ИмяСобытия = "Запись_Отсутствие"
		Или ИмяСобытия = "Закрытие_НастройкиСинхронизацииКалендаря" Тогда
		
		ОбновитьОтображениеКлиент();
		
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_НастройкиКалендаря" Тогда
		ОбновитьОтображениеКлиент( , , Истина);
	КонецЕсли;   
	
	АвтообновлениеАРМНаСервере();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИнициализироватьАРМПользователя() 
	
	Если Элементы.АРМЗадачи.Пометка Тогда 
		НастройкиКанбанаТекущегоПользователя = ОпределитьНастройкиТекущегоПользователя();
		
		Если НастройкиКанбанаТекущегоПользователя  = Справочники.ЦБР_ШаблоныАРМ.ПустаяСсылка() Тогда
			НастройкиКанбанаТекущегоПользователя = Справочники.ЦБР_ШаблоныАРМ.Основной;
		КонецЕсли; 
		
		РазбиватьТребуетВниманияНаДвеКолонки = НастройкиКанбанаТекущегоПользователя.РазбиватьТребуетВниманияНаДвеКолонки;
		Если РазбиватьТребуетВниманияНаДвеКолонки Тогда 
			Элементы.ГруппаТребуютВнимание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;   
			Элементы.ГруппаТребуютВнимание.Ширина      = 48;
		Иначе
			Элементы.ГруппаТребуютВнимание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
			Элементы.ГруппаТребуютВнимание.Ширина      = 24;
		КонецЕсли;
		
	ИначеЕсли Элементы.АРМЗадания.Пометка Тогда
		
		НастройкиКанбанаТекущегоПользователя = ОпределитьНастройкиЗаданийТекущегоПользователя();
		
		Если НастройкиКанбанаТекущегоПользователя  = Справочники.ЦБР_ШаблоныАРМ.ПустаяСсылка() Тогда
			НастройкиКанбанаТекущегоПользователя = Справочники.ЦБР_ШаблоныАРМ.ОсновнойЗадания;
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьКолонкиАРМ(НастройкиКанбанаТекущегоПользователя);
	
	Если Элементы.АРМЗадачи.Пометка Тогда
		ЗаполнитьТаблицыЗадачНаСервере(НастройкиКанбанаТекущегоПользователя);
	Иначе
		ЗаполнитьТаблицыЗаданийНаСервере(НастройкиКанбанаТекущегоПользователя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиАРМ(НастрокиТекущегоПользователя) 
	
	Для Каждого СтрокаШаблона Из НастрокиТекущегоПользователя.СоставКолонок Цикл  
		СоздатьКолонкуАРМ(СтрокаШаблона.КолонкаАРМ);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкуАРМ(КолонкаАРМ)  
	
	Наименование 	= ПочиститьНаименование(КолонкаАРМ.Наименование);
	Заголовок    	= КолонкаАРМ.Наименование;
	Цвет 			= фвц_ВыборЦветаHTMLПовтИсп.ЦветПоСтрокеRGB(КолонкаАРМ.ЦветRGB);
	ЦветТекста      = фвц_ВыборЦветаHTMLПовтИсп.ЦветПоСтрокеRGB(КолонкаАРМ.ЦветТекстаRGB); 

	ЦБР_СозданиеОбъектовФормы.СздГруппаОбычнаяБезОтображения(ЭтотОбъект, "Список"+Наименование, Элементы.КанбанСписки, 1);

	СтруктураСвойств = Новый Структура();
	СтруктураСвойств.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная); 
	СтруктураСвойств.Вставить("ЦветФона", Цвет);	
	ЦБР_СозданиеОбъектовФормы.СздГруппаОбычнаяБезОтображения(ЭтотОбъект, "СписокГоризонтальнаяНаименование"+Наименование, "Список"+Наименование,2,,,СтруктураСвойств);
	
	
	ЦБР_СозданиеОбъектовФормы.СоздатьКоманду(ЭтотОбъект, "КомандаКолонки"+Наименование,"КомандаКолонки"+Наименование,"ПриИзмененииКолонки");

 	СтруктураСвойств = Новый Структура();		
	СтруктураСвойств.Вставить("Картинка", БиблиотекаКартинок.сфпПерсональныеНастройки);	
	СтруктураСвойств.Вставить("Отображение", ОтображениеКнопки.Картинка);	
	ЦБР_СозданиеОбъектовФормы.СздКнопка(ЭтотОбъект, "КомандаКолонки"+Наименование, Элементы["СписокГоризонтальнаяНаименование"+Наименование], "КомандаКолонки"+Наименование, 
											"КомандаКолонки"+Наименование, 2, СтруктураСвойств); 

	СтруктураСвойств = Новый Структура();	
	СтруктураСвойств.Вставить("Заголовок", Заголовок);	 
	СтруктураСвойств.Вставить("Шрифт", Новый Шрифт(,11));
	СтруктураСвойств.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Центр);	
	СтруктураСвойств.Вставить("Вид", ВидДекорацииФормы.Надпись);
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Истина);
	СтруктураСвойств.Вставить("АвтоМаксимальнаяШирина", Ложь);
	СтруктураСвойств.Вставить("ЦветТекста", ЦветТекста);	
	
	ЦБР_СозданиеОбъектовФормы.СздДекорация(ЭтотОбъект, "ЗаголовокЗадачи"+Наименование, Элементы["СписокГоризонтальнаяНаименование"+Наименование], СтруктураСвойств);														
	
	СтруктураСвойств = Новый Структура();	
	СтруктураСвойств.Вставить("Вид", ВидДекорацииФормы.Надпись);
	СтруктураСвойств.Вставить("Шрифт", Новый Шрифт(,11));
	СтруктураСвойств.Вставить("ЦветТекста", Цвет); 
	СтруктураСвойств.Вставить("ЦветРамки", Новый Цвет(0,0,0));
	СтруктураСвойств.Вставить("ЦветФона", Новый Цвет(255,255,255));	
	СтруктураСвойств.Вставить("Ширина", 2);	               
	СтруктураСвойств.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Центр);	   
	СтруктураСвойств.Вставить("ВертикальноеПоложение", ВертикальноеПоложениеЭлемента.Центр);	  
	СтруктураСвойств.Вставить("Заголовок", 0);	  
	ЦБР_СозданиеОбъектовФормы.СздДекорация(ЭтотОбъект, "КолВо"+Наименование, Элементы["СписокГоризонтальнаяНаименование"+Наименование], СтруктураСвойств);														

	ЦБР_СозданиеОбъектовФормы.СоздатьРеквизит(ЭтотОбъект, "Таблица"+Наименование, Новый ОписаниеТипов("ТаблицаЗначений"));	
	
	структураРеквизитов = Новый Структура;		
	структураРеквизитов.Вставить("Наименование", 	Новый ОписаниеТипов("Строка"));	
	структураРеквизитов.Вставить("Клиент", 			Новый ОписаниеТипов("СправочникСсылка.Партнеры"));		
	структураРеквизитов.Вставить("Исполнитель", 	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));		
	структураРеквизитов.Вставить("Трудозатраты", 	Новый ОписаниеТипов("Строка"));		
	структураРеквизитов.Вставить("Отступ", 			Новый ОписаниеТипов("Строка"));		
	структураРеквизитов.Вставить("Состояние", 		Новый ОписаниеТипов("ПеречислениеСсылка.ЦБР_Состояние"));	
	структураРеквизитов.Вставить("КартинкаКлиент", 	Новый ОписаниеТипов("Число"));
	структураРеквизитов.Вставить("Задача", 			Новый ОписаниеТипов("СправочникСсылка.ЦБР_Задача"));
	структураРеквизитов.Вставить("Задание", 			Новый ОписаниеТипов("СправочникСсылка.ЦБР_СтруктураЗадач"));
	структураРеквизитов.Вставить("Постановщик", 	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));		
	структураРеквизитов.Вставить("КартинкаИсполнитель", 	Новый ОписаниеТипов("Число"));

	
	ЦБР_СозданиеОбъектовФормы.СоздатьРеквизитыТаблицы(ЭтотОбъект, "Таблица"+Наименование, структураРеквизитов);
	
	СтруктураКолонок = Новый Структура;		
	СтруктураКолонок.Вставить("Наименование");	
	СтруктураКолонок.Вставить("Клиент");		
	СтруктураКолонок.Вставить("Исполнитель");		
	СтруктураКолонок.Вставить("Трудозатраты");		
	СтруктураКолонок.Вставить("Отступ");		
	СтруктураКолонок.Вставить("Состояние");	
	СтруктураКолонок.Вставить("Постановщик");		
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	СтруктураСвойств.Вставить("ПоложениеКоманднойПанели", ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	СтруктураСвойств.Вставить("Отображение", ОтображениеТаблицы.Список);
	СтруктураСвойств.Вставить("РежимВыделения", РежимВыделенияТаблицы.Одиночный);
	СтруктураСвойств.Вставить("РежимВыделенияСтроки", РежимВыделенияСтрокиТаблицы.Строка);
	СтруктураСвойств.Вставить("Шапка", Ложь);
	СтруктураСвойств.Вставить("Подвал", Ложь);
	СтруктураСвойств.Вставить("ЦветРамки", Цвет);
	СтруктураСвойств.Вставить("Ширина", 25);
	СтруктураСвойств.Вставить("ГоризонтальныеЛинии", Ложь);
	СтруктураСвойств.Вставить("Шрифт", ОбщегоНазначенияВызовСервера.ШрифтСтиля("ШрифтМикротекста")); 
	//СтруктураСвойств.Вставить("КонтекстноеМеню.Видимость", Ложь);

	СтруктураСобытий	= Новый Структура;	
	СтруктураСобытий.Вставить("Выбор", "СписокВыбор");	
	СтруктураСобытий.Вставить("ПередНачаломДобавления", "СписокПередНачаломДобавления");	
	ЦБР_СозданиеОбъектовФормы.СздТаблицаФормы(ЭтотОбъект, "Таблица"+Наименование, Элементы["Список"+Наименование], 
										"Таблица"+Наименование, , СтруктураСвойств, СтруктураСобытий);

	ЦБР_СозданиеОбъектовФормы.СздГруппаКолонокТаблицыФормы(ЭтотОбъект, "ГруппаКарточка"+Наименование, Элементы["Таблица"+Наименование], 2);												

	СтруктураСвойств = Новый Структура();	
	ЦБР_СозданиеОбъектовФормы.СздГруппаКолонокТаблицыФормы(ЭтотОбъект, "ГруппаГоризонтальнаяНаименование"+Наименование, Элементы["ГруппаКарточка"+Наименование], 1);												

	СтруктураСвойств = Новый Структура();
	СтруктураСвойств.Вставить("Шрифт", Новый Шрифт(,8,Истина));
	СтруктураСвойств.Вставить("ЦветФона", Новый Цвет(77, 77, 77));  
	СтруктураСвойств.Вставить("ЦветТекста", ЦветТекста); 
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Истина);
	СтруктураСвойств.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ЦБР_СозданиеОбъектовФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "СписокНаименование"+Наименование, Элементы["ГруппаГоризонтальнаяНаименование"+Наименование], 1, , "Таблица"+Наименование+".Наименование", , , СтруктураСвойств);

	СтруктураСвойств = Новый Структура();
	СтруктураСвойств.Вставить("Шрифт", Новый Шрифт(,8,Истина));
	СтруктураСвойств.Вставить("ЦветФона", Новый Цвет(77, 77, 77));  
	СтруктураСвойств.Вставить("ЦветТекста", ЦветТекста);   
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Ложь);  
	СтруктураСвойств.Вставить("АвтоМаксимальнаяШирина", Истина); 
	СтруктураСвойств.Вставить("Ширина", 3);  
	СтруктураСвойств.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Право);	   
	ЦБР_СозданиеОбъектовФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "Трудозатраты"+Наименование, Элементы["ГруппаГоризонтальнаяНаименование"+Наименование], 1, , "Таблица"+Наименование+".Трудозатраты", , , СтруктураСвойств);
	
	ЦБР_СозданиеОбъектовФормы.СздГруппаКолонокТаблицыФормы(ЭтотОбъект, "ГруппаГоризонтальнаяИсполнитель"+Наименование, Элементы["ГруппаКарточка"+Наименование], 1);												
	
	//СтруктураСвойств = Новый Структура();	
	//СтруктураСвойств.Вставить("КартинкаЗначений", БиблиотекаКартинок.ИндивидуальноеСоглашениеСКлиентом);		
	//ЦБР_СозданиеОбъектовФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "КартинкаИсполнитель"+Наименование, Элементы["ГруппаГоризонтальнаяИсполнитель"+Наименование], 3, , "Таблица"+Наименование+".КартинкаИсполнитель", , , СтруктураСвойств);

	СтруктураСвойств = Новый Структура();
	СтруктураСвойств.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Право);
	СтруктураСвойств.Вставить("ГиперссылкаЯчейки", Истина);	   
	ЦБР_СозданиеОбъектовФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "Исполнитель"+Наименование, Элементы["ГруппаГоризонтальнаяИсполнитель"+Наименование], 1, , "Таблица"+Наименование+".Исполнитель", , , СтруктураСвойств);

	
	ЦБР_СозданиеОбъектовФормы.СздГруппаКолонокТаблицыФормы(ЭтотОбъект, "ГруппаГоризонтальнаяКлиент"+Наименование, Элементы["ГруппаКарточка"+Наименование], 1);												
	
	//СтруктураСвойств = Новый Структура();	
	//СтруктураСвойств.Вставить("КартинкаЗначений", БиблиотекаКартинок.ОткрытьКарточкуПартнера);		
	//ЦБР_СозданиеОбъектовФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "КартинкаКлиент"+Наименование, Элементы["ГруппаГоризонтальнаяКлиент"+Наименование], 3, , "Таблица"+Наименование+".КартинкаКлиент", , , СтруктураСвойств);

	СтруктураСвойств = Новый Структура();
	СтруктураСвойств.Вставить("ЦветТекста", Новый Цвет(0,128,0)); 
	ЦБР_СозданиеОбъектовФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "Клиент"+Наименование, Элементы["ГруппаГоризонтальнаяКлиент"+Наименование], 1, , "Таблица"+Наименование+".Клиент", , , СтруктураСвойств);
	
	СтруктураСвойств = Новый Структура();
	СтруктураСвойств.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Право);	
	ЦБР_СозданиеОбъектовФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "Постановщик"+Наименование, Элементы["ГруппаКарточка"+Наименование], 1, , "Таблица"+Наименование+".Постановщик", , , СтруктураСвойств);

	СтруктураСвойств = Новый Структура();		
	СтруктураСвойств.Вставить("Шрифт", Новый Шрифт(,1));
	ЦБР_СозданиеОбъектовФормы.СздКолонкаТаблицыФормы(ЭтотОбъект, "СписокОтступ"+Наименование, Элементы["ГруппаКарточка"+Наименование], 1, , "Таблица"+Наименование+".Отступ", , , СтруктураСвойств);

	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьТаблицыЗадачНаСервере(НастройкиКанбанаТекущегоПользователя, ДополнительныйОтбор = Неопределено)
	
	Если ЭтоРуководитель Тогда
		СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетРуководитель"); 
		НастройкиКомпоновкиДанных = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
		ПараметрДанных = СхемаКомпоновкиДанных.Параметры.Найти("Подразделение");
		ПараметрДанных.Значение = Пользователи.АвторизованныйПользователь().Подразделение;
	Иначе
		СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");  
		НастройкиКомпоновкиДанных = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
		ПараметрДанных = СхемаКомпоновкиДанных.Параметры.Найти("ПользовательАРМ");
		ПараметрДанных.Значение = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	
	Для Каждого СтрокаШаблона Из НастройкиКанбанаТекущегоПользователя.СоставКолонок Цикл  
		УсловияОтбора 		= СтрокаШаблона.КолонкаАРМ.УсловияОтбора.Получить(); 
		
		НастройкиКомпоновкиДанных.Отбор.Элементы.Очистить();
	
		Для Каждого Отбор ИЗ УсловияОтбора.Отбор.Элементы Цикл
			Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 
				ГруппаОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				Для Каждого СтрокаОтбора Из Отбор.Элементы Цикл 
					НовыйОтбор = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение  = СтрокаОтбора.ЛевоеЗначение;
					НовыйОтбор.Использование  = Отбор.Использование;
					НовыйОтбор.ВидСравнения   = СтрокаОтбора.ВидСравнения;
					НовыйОтбор.ПравоеЗначение = СтрокаОтбора.ПравоеЗначение; 
				КонецЦикла;
			Иначе
				НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
				НовыйОтбор.ЛевоеЗначение  = Отбор.ЛевоеЗначение;
				НовыйОтбор.Использование  = Отбор.Использование;
				НовыйОтбор.ВидСравнения   = Отбор.ВидСравнения;
				НовыйОтбор.ПравоеЗначение = Отбор.ПравоеЗначение; 
			КонецЕсли;
		КонецЦикла;  
		
		Если ДополнительныйОтбор <> Неопределено Тогда   
			Для Каждого Строка  Из  ДополнительныйОтбор Цикл  
				Если Строка = "Клиент" Тогда
					НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Клиент");                       
					НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение 	= отборКлиент;
					НовыйОтбор.Использование 	= Истина;
				КонецЕсли; 
				Если Строка = "Исполнитель" Тогда
					НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Исполнитель");                       
					НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение 	= отборИсполнитель;
					НовыйОтбор.Использование 	= Истина;
				КонецЕсли;
				Если Строка = "Постановщик" Тогда
					НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Постановщик");                       
					НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение 	= отборПостановщик;
					НовыйОтбор.Использование 	= Истина;
				КонецЕсли;        
				Если Строка = "Направление" Тогда
					НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Направление");                       
					НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение 	= отборНаправление;
					НовыйОтбор.Использование 	= Истина;
				КонецЕсли;  
				Если Строка = "Роль" Тогда
					НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Роль");                       
					НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение 	= отборРоль;
					НовыйОтбор.Использование 	= Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТЗ = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ТЗ);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		Наименование 	= ПочиститьНаименование(СтрокаШаблона.КолонкаАРМ.Наименование);
		ЭтотОбъект["Таблица"+Наименование].Загрузить(ТЗ);		
		Элементы["КолВо"+Наименование].Заголовок = ТЗ.Количество();	
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыЗаданийНаСервере(НастройкиКанбанаТекущегоПользователя, ДополнительныйОтбор = Неопределено)
	
	Если ЭтоРуководитель Тогда
		СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЗаданияРуководитель"); 
		НастройкиКомпоновкиДанных = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
		ПараметрДанных = СхемаКомпоновкиДанных.Параметры.Найти("Подразделение");
		ПараметрДанных.Значение = Пользователи.АвторизованныйПользователь().Подразделение;
	Иначе
		СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЗадания");  
		НастройкиКомпоновкиДанных = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
		ПараметрДанных = СхемаКомпоновкиДанных.Параметры.Найти("ПользовательАРМ");
		ПараметрДанных.Значение = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	
	Для Каждого СтрокаШаблона Из НастройкиКанбанаТекущегоПользователя.СоставКолонок Цикл  
		УсловияОтбора 		= СтрокаШаблона.КолонкаАРМ.УсловияОтбора.Получить(); 
		
		НастройкиКомпоновкиДанных.Отбор.Элементы.Очистить();
	
		Для Каждого Отбор ИЗ УсловияОтбора.Отбор.Элементы Цикл
			Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 
				ГруппаОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				Для Каждого СтрокаОтбора Из Отбор.Элементы Цикл 
					НовыйОтбор = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение  = СтрокаОтбора.ЛевоеЗначение;
					НовыйОтбор.Использование  = Отбор.Использование;
					НовыйОтбор.ВидСравнения   = СтрокаОтбора.ВидСравнения;
					НовыйОтбор.ПравоеЗначение = СтрокаОтбора.ПравоеЗначение; 
				КонецЦикла;
			Иначе
				НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
				НовыйОтбор.ЛевоеЗначение  = Отбор.ЛевоеЗначение;
				НовыйОтбор.Использование  = Отбор.Использование;
				НовыйОтбор.ВидСравнения   = Отбор.ВидСравнения;
				НовыйОтбор.ПравоеЗначение = Отбор.ПравоеЗначение; 
			КонецЕсли;
		КонецЦикла;  
		
		Если ДополнительныйОтбор <> Неопределено Тогда   
			Для Каждого Строка  Из  ДополнительныйОтбор Цикл  
				Если Строка = "Клиент" Тогда
					НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Клиент");                       
					НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение 	= отборКлиент;
					НовыйОтбор.Использование 	= Истина;
				КонецЕсли; 
				Если Строка = "Исполнитель" Тогда
					НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Исполнитель");                       
					НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение 	= отборИсполнитель;
					НовыйОтбор.Использование 	= Истина;
				КонецЕсли;
				Если Строка = "Постановщик" Тогда
					НовыйОтбор = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Постановщик");                       
					НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение 	= отборПостановщик;
					НовыйОтбор.Использование 	= Истина;
				КонецЕсли;        
			КонецЦикла;
		КонецЕсли;
		
		МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТЗ = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ТЗ);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		Наименование 	= ПочиститьНаименование(СтрокаШаблона.КолонкаАРМ.Наименование);
		Попытка
			ЭтотОбъект["Таблица"+Наименование].Загрузить(ТЗ);		
			Элементы["КолВо"+Наименование].Заголовок = ТЗ.Количество();	
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура МоиНастройки(Команда)
	Если Не Элементы.ГруппаКалендарь.Видимость Тогда
		Если Элементы.АРМЗадачи.Пометка Тогда 
			НастройкиКанбанаТекущегоПользователя = ОпределитьНастройкиТекущегоПользователя();
		Иначе
			НастройкиКанбанаТекущегоПользователя = ОпределитьНастройкиЗаданийТекущегоПользователя();
		КонецЕсли;
		
		Если  НастройкиКанбанаТекущегоПользователя  = ПредопределенноеЗначение("Справочник.ЦБР_ШаблоныАРМ.ПустаяСсылка") Тогда
			СоздатьНастрокиДляТекущегоПользователя(); 
			НастройкиКанбанаТекущегоПользователя = ОпределитьНастройкиТекущегоПользователя();
		КонецЕсли;  
		
		
		ПараметрыФормы = Новый Структура("Ключ",НастройкиКанбанаТекущегоПользователя);
		ОткрытьФорму("Справочник.ЦБР_ШаблоныАРМ.ФормаОбъекта",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ВыборЭлементаЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Справочник.ЦБР_ЗаписиРабочегоКалендаря.Форма.НастройкиКалендаря");
	КонецЕсли;
КонецПроцедуры            

&НаКлиенте
Процедура ВыборЭлементаЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	Если Элементы.АРМЗадачи.Пометка Тогда 
		НастройкиТекущегоПользователя = ОпределитьНастройкиТекущегоПользователя();
	Иначе
		НастройкиТекущегоПользователя = ОпределитьНастройкиЗаданийТекущегоПользователя();
	КонецЕсли;
	
	РазбиватьТребуетВниманияНаДвеКолонки();

	УдалитьЭлементыАРМ(НастройкиТекущегоПользователя);
	ДобавитьКолонкиАРМ(НастройкиТекущегоПользователя);
   	УстановитьОтборВАРМНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыАРМ(НастрокиТекущегоПользователя) 
	
	МассивИмен =  Новый Массив;
	Для каждого Колонка из Элементы.КанбанСписки.ПодчиненныеЭлементы Цикл  
		Если Колонка.Имя = "ГруппаТребуютВнимание" Тогда
			Продолжить;
		КонецЕсли;
		МассивИмен.Добавить(СтрЗаменить(Колонка.Имя,"Список",""));	  
	КонецЦикла;
	
	СписокУдаляемыхЭлементов = Новый Массив; 
	Для каждого Имя из МассивИмен Цикл 
		СписокУдаляемыхЭлементов.Добавить("Таблица"+Имя);
		СписокУдаляемыхЭлементов.Добавить("ЗаголовокЗадачи"+Имя);
		СписокУдаляемыхЭлементов.Добавить("Список"+Имя);    
		СписокУдаляемыхЭлементов.Добавить("КомандаКолонки"+Имя);  
		СписокУдаляемыхЭлементов.Добавить("СписокГоризонтальнаяНаименование"+Имя);  
	КонецЦикла;
	
	ЦБР_СозданиеОбъектовФормы.УдлЭлементы(ЭтотОбъект,СписокУдаляемыхЭлементов); 
	
	УдаляемыеРеквизиты = Новый Массив;
	Для каждого Имя из МассивИмен Цикл 
		УдаляемыеРеквизиты.Добавить("Таблица"+Имя); 
    КонецЦикла;    
    ИзменитьРеквизиты(,УдаляемыеРеквизиты); 
	
	УдаляемыеКоманды = Новый Массив;
	Для Каждого Команда из Команды Цикл   
		Если СтрНайти(Команда.Имя, "КомандаКолонки") > 0 Тогда 
			УдаляемыеКоманды.Добавить(Команда); 
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Команда Из УдаляемыеКоманды Цикл  
		Команды.Удалить(Команда);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ОпределитьНастройкиТекущегоПользователя()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_НастройкиАРМДляПользователей.ШаблонАРМ КАК ШаблонАРМ
		|ИЗ
		|	РегистрСведений.ЦБР_НастройкиАРМДляПользователей КАК ЦБР_НастройкиАРМДляПользователей
		|ГДЕ
		|	ЦБР_НастройкиАРМДляПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ЦБР_ШаблоныАРМ.Основной;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ШаблонАРМ;  
	КонецЕсли;

КонецФункции

&НаСервере
Функция ОпределитьНастройкиЗаданийТекущегоПользователя()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_НастройкиАРМДляПользователей.ШаблонАРМ КАК ШаблонАРМ
		|ИЗ
		|	РегистрСведений.ЦБР_НастройкиАРМДляПользователей КАК ЦБР_НастройкиАРМДляПользователей
		|ГДЕ
		|	ЦБР_НастройкиАРМДляПользователей.Пользователь = &Пользователь
		|	И ЦБР_НастройкиАРМДляПользователей.ШаблонАРМ.ЭтоЗадания = ИСТИНА";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ЦБР_ШаблоныАРМ.ОсновнойЗадания;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ШаблонАРМ;  
	КонецЕсли;

КонецФункции

&НаСервере
Процедура СоздатьНастрокиДляТекущегоПользователя()
	
	НовыйЭлемент = Справочники.ЦБР_ШаблоныАРМ.СоздатьЭлемент();
	НовыйЭлемент.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователи.АвторизованныйПользователь(), "Наименование");
	НовыйЭлемент.Записать();
	
	МенеджерЗаписи = РегистрыСведений.ЦБР_НастройкиАРМДляПользователей.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователи.АвторизованныйПользователь(), "Ссылка"); 
	МенеджерЗаписи.ШаблонАРМ = НовыйЭлемент.Ссылка; 
	МенеджерЗаписи.Записать(); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаТребуютВниманиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуЗадачи(Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент)

	ОткрытьФормуЗадачи(Элемент.ТекущиеДанные);
	
КонецПроцедуры		

&НаКлиенте
Процедура УстановитьОтборВАРМ(Элемент)  
	 УстановитьОтборВАРМНаСервере();
КонецПроцедуры    

&НаСервере
Процедура УстановитьОтборВАРМНаСервере()  
	 
	 МассивОтборов = Новый Массив;
	Если ЗначениеЗаполнено(отборКлиент) Тогда  
		МассивОтборов.Добавить("Клиент");
	КонецЕсли;     
	Если ЗначениеЗаполнено(отборИсполнитель) Тогда  
		МассивОтборов.Добавить("Исполнитель");
	КонецЕсли;     
	Если ЗначениеЗаполнено(отборПостановщик) Тогда  
		МассивОтборов.Добавить("Постановщик");
	КонецЕсли;     
	Если ЗначениеЗаполнено(отборНаправление) Тогда  
		МассивОтборов.Добавить("Направление");
	КонецЕсли;     
	Если ЗначениеЗаполнено(отборРоль) Тогда  
		МассивОтборов.Добавить("Роль");
	КонецЕсли;
		
	Если Элементы.АРМЗадачи.Пометка Тогда
		ЗаполнитьТаблицыЗадачНаСервере(ОпределитьНастройкиТекущегоПользователя(), МассивОтборов);
	Иначе
		ЗаполнитьТаблицыЗаданийНаСервере(ОпределитьНастройкиЗаданийТекущегоПользователя(), МассивОтборов);
	КонецЕсли;
 КонецПроцедуры      

&НаКлиенте
Процедура отборКлиентОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборВАРМНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура отборИсполнительОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборВАРМНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура отборПостановщикОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборВАРМНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура отборНаправлениеОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборВАРМНаСервере();
КонецПроцедуры

&НаСервере
Функция ПочиститьНаименование(Наименование)  
	
	НовНаименование 	= СтрЗаменить(Наименование," ","_");  
	НовНаименование 	= СтрЗаменить(НовНаименование,".","_");
	НовНаименование 	= СтрЗаменить(НовНаименование,",","_"); 
	НовНаименование 	= СтрЗаменить(НовНаименование,"-","_");
	НовНаименование 	= СтрЗаменить(НовНаименование,"=","_");
	НовНаименование 	= СтрЗаменить(НовНаименование,"\","_");
	НовНаименование 	= СтрЗаменить(НовНаименование,"/","_");
	
	Возврат НовНаименование;
	
КонецФункции

&НаКлиенте
Процедура ТребуютВниманияРуководителяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуЗадачи(Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадачи(Команда)
	Если Не Элементы.ГруппаКалендарь.Видимость Тогда
		АвтообновлениеАРМНаСервере();
	Иначе
		ОбновитьКалендарь(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКолонки(Элемент)
	
	Наименование = СтрЗаменить(Элемент.Имя,"КомандаКолонки","");  
	Наименование = СтрЗаменить(Наименование,"_"," ");  
	ИзменяемаяКолонкаПользователя = ОпределитьИзменяемуюКолонкуНаСервере(Наименование);
	
	Если ИзменяемаяКолонкаПользователя <> ПредопределенноеЗначение("Справочник.ЦБР_КолонкиАРМ.ПустаяСсылка") Тогда 
		ПараметрыФормы = Новый Структура("Ключ",ИзменяемаяКолонкаПользователя);
		ОткрытьФорму("Справочник.ЦБР_КолонкиАРМ.ФормаОбъекта",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ИзменениеКолонкиЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура ИзменениеКолонкиЗавершение(Результат,ДополнительныеПараметры) Экспорт
	Если Элементы.АРМЗадачи.Пометка Тогда 
		НастройкиТекущегоПользователя = ОпределитьНастройкиТекущегоПользователя();
	Иначе
		НастройкиТекущегоПользователя = ОпределитьНастройкиЗаданийТекущегоПользователя();
	КонецЕсли;
	УдалитьЭлементыАРМ(НастройкиТекущегоПользователя);
	ДобавитьКолонкиАРМ(НастройкиТекущегоПользователя);
   	УстановитьОтборВАРМНаСервере();    
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИзменяемуюКолонкуНаСервере(Наименование)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_НастройкиАРМДляПользователей.ШаблонАРМ КАК ШаблонАРМ
		|ПОМЕСТИТЬ ШаблонАРМКлиента
		|ИЗ
		|	РегистрСведений.ЦБР_НастройкиАРМДляПользователей КАК ЦБР_НастройкиАРМДляПользователей
		|ГДЕ
		|	ЦБР_НастройкиАРМДляПользователей.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦБР_КолонкиАРМ.Ссылка КАК Ссылка
		|ИЗ
		|	ШаблонАРМКлиента КАК ШаблонАРМКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦБР_КолонкиАРМ КАК ЦБР_КолонкиАРМ
		|		ПО ШаблонАРМКлиента.ШаблонАРМ = ЦБР_КолонкиАРМ.Владелец
		|ГДЕ
		|	ЦБР_КолонкиАРМ.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ЦБР_КолонкиАРМ.ПустаяСсылка();
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;  
	КонецЕсли;
	
КонецФункции

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодОтображенияПриИзменении(Элемент)

	УстановитьОтображаемуюДату(ОтображаемаяДата);

	ОбновитьДанныеКалендаря("ПериодОтображения");

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПриИзменении(Элемент)

	ВыделенныеДаты.ЗагрузитьЗначения(Элемент.ВыделенныеДаты);
	ОбновитьНастройкиОтображения();

	ОбновитьДанныеКалендаря();

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПриАктивизацииДаты(Элемент)

	Если Элемент.ВыделенныеДаты.Количество() = ВыделенныеДаты.Количество() Тогда
		Возврат;
	КонецЕсли;

	ВыделенныеДаты.ЗагрузитьЗначения(Элемент.ВыделенныеДаты);
	Если ВыделенныеДаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если ВыделенныеДаты.НайтиПоЗначению(ОтображаемаяДата) = Неопределено Тогда
		ОтображаемаяДата = ВыделенныеДаты[ВыделенныеДаты.Количество() - 1].Значение;
	КонецЕсли;
	ОбновитьНастройкиОтображения();

	ОбновитьДанныеКалендаря("ПериодОтображения");

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПриВыводеПериода(Элемент, ОформлениеПериода)

	Если Не ЗаданГрафикРаботы Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаОформленияПериода Из ОформлениеПериода.Даты Цикл

		Если ЗаполненныеГода.НайтиПоЗначению(Год(СтрокаОформленияПериода.Дата)) = Неопределено Тогда
			РаботаСРабочимКалендаремСервер.ЗаполнитьРабочиеДни(
				РабочиеДни, ЗаполненныеГода, СтрокаОформленияПериода.Дата);
		КонецЕсли;

		СтрокаРабочиеДни = РабочиеДни.НайтиПоЗначению(СтрокаОформленияПериода.Дата);
		Если СтрокаРабочиеДни = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаРабочиеДни.Пометка Тогда
			СтрокаОформленияПериода.ЦветТекста = WebЦвета.Черный;
		Иначе
			СтрокаОформленияПериода.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, ВыбраннаяДата)

	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыПеретаскивания.Значение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ЭлементПланировщика") Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Структура") Тогда
		//@skip-check event-heandler-boolean-param
		СтандартнаяОбработка = Не РаботаСРабочимКалендаремКлиентСервер.ЭтоЭлементЗаписиКалендаря(
				ПараметрыПеретаскивания.Значение[0]);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, ВыбраннаяДата)

	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыПеретаскивания.Значение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ЭлементПланировщика") Тогда
		СтандартнаяОбработка = Ложь;
		РаботаСРабочимКалендаремКлиент.ПеренестиЭлементыПланировщикаНаДату(
			Элементы.Планировщик, Планировщик, НастройкиОтображения, ПараметрыПеретаскивания.Значение, ВыбраннаяДата,
			УникальныйИдентификатор);
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Структура") Тогда

		Если Не РаботаСРабочимКалендаремКлиентСервер.ЭтоЭлементЗаписиКалендаря(
				ПараметрыПеретаскивания.Значение[0]) Тогда
			Возврат;
		КонецЕсли;

		СтандартнаяОбработка = Ложь;
		РаботаСРабочимКалендаремКлиент.ПеренестиЭлементыЗаписейКалендаряНаДату(
			ПараметрыПеретаскивания.Значение, ВыбраннаяДата);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПользователиКалендаряНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	//СтандартнаяОбработка = Ложь;
	//ВыбратьКалендарьПользователя();

КонецПроцедуры

&НаКлиенте
Процедура ПользователиКалендаряПриИзменении(Элемент)

	ОбновитьНастройкиОтображения();
	ЗавершениеВыбратьКалендарьПользователяСервер();

КонецПроцедуры

&НаКлиенте
Процедура НадписьПустоНажатие(Элемент)

	ВыбратьКалендарьПользователя();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКалендаря

&НаКлиенте
Процедура ПланировщикПриАктивизации(Элемент, СтандартнаяОбработка)

	Если Элемент.ВыделенныеЭлементы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	РаботаСРабочимКалендаремКлиент.ОбработкаПриАктивизации(Элемент, СтандартнаяОбработка);

	ЕстьВыделенныеЭлементы = Элемент.ВыделенныеЭлементы.Количество() <> 0;
	
	Если ЕстьВыделенныеЭлементы Тогда 
		ЗаписьВКалендаре = Элемент.ВыделенныеЭлементы[0].Значение.Ссылка;
		
		СтатусНовый = ЦБР_ЗадачиЗаданияВызовСервера.ОС_ЕстьСтатус(ЗаписьВКалендаре, ПредопределенноеЗначение("Перечисление.ЦБР_СтатусЗаписиКалендаря.Новый"));
		СтатусНачал = ЦБР_ЗадачиЗаданияВызовСервера.ОС_ЕстьСтатус(ЗаписьВКалендаре, ПредопределенноеЗначение("Перечисление.ЦБР_СтатусЗаписиКалендаря.Начал"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланировщикКонтекстноеМенюОС_Приступить", "Видимость", СтатусНовый);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланировщикКонтекстноеМенюОС_Закончить", "Видимость", СтатусНачал);   
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланировщикКонтекстноеМенюОС_ПоПлану", "Видимость", СтатусНовый);   
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланировщикКонтекстноеМенюОС_Отменить", "Видимость", СтатусНовый);   
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКонтекстногоМеню(КонтекстноеМеню, Доступность)

	Для Каждого ЭлементМеню Из КонтекстноеМеню.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементМеню) = Тип("ГруппаФормы") Тогда
			УстановитьДоступностьКонтекстногоМеню(ЭлементМеню, Доступность);
		ИначеЕсли
		    ТипЗнч(ЭлементМеню) = Тип("КнопкаФормы") Тогда
			ЭлементМеню.Доступность = Доступность;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)

	РаботаСРабочимКалендаремКлиент.ОбработкаПередСозданием(
		Элемент,
		?(ЗначениеЗаполнено(ЭтотОбъект.ЗаданиеСсылка),ЭтотОбъект.ЗаданиеСсылка, Неопределено),
		?(ЗначениеЗаполнено(ЭтотОбъект.ЗаданиеСсылка),ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЗаданиеСсылка,"Задача"), Неопределено),
		Начало, Конец, Значения, Текст, СтандартнаяОбработка, ИспользоватьБыстроеРедактирование, ПользовательКалендаря,
		НастройкиОтображения, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикВыбор(Элемент, СтандартнаяОбработка)

	РаботаСРабочимКалендаремКлиент.ОбработкаВыбораЭлемента(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)

	РаботаСРабочимКалендаремКлиент.ОбработкаОкончанияРедактированияЭлемента(
		Элемент, НовыйЭлемент, ОтменаРедактирования, Планировщик, НастройкиОтображения, УникальныйИдентификатор,
		ПользовательКалендаря);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)

	РаботаСРабочимКалендаремКлиент.ОбработкаПередНачаломРедактированиемЭлемента(Элемент, НовыйЭлемент,
		СтандартнаяОбработка, ПользовательКалендаря);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)

	РаботаСРабочимКалендаремКлиент.ОбработкаПередУдалениемЭлемента(Элемент, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)

	РаботаСРабочимКалендаремКлиент.ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланДня

&НаКлиенте
Процедура ПланДняПриАктивизацииСтроки(Элемент)

	РаботаСРабочимКалендаремКлиент.ОбработкаАктивизацииОбластиПланДня(
		Элемент, ТекущаяЗаписьКалендаря, ТекущаяДатаНачала);

КонецПроцедуры

&НаКлиенте
Процедура ПланДняВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	РаботаСРабочимКалендаремКлиент.ОбработкаВыбораПланДня(
		Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПланДняПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	РаботаСРабочимКалендаремКлиент.ОбработкаПередНачаломДобавленияПланДня(
		Элемент, Отказ, Копирование, Родитель, Группа, НастройкиОтображения, ПользовательКалендаря);

КонецПроцедуры

&НаКлиенте
Процедура ПланДняПередНачаломИзменения(Элемент, Отказ)

	РаботаСРабочимКалендаремКлиент.ОбработкаПередНачаломИзмененияПланДня(Элементы.ПланДня, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПланДняПередУдалением(Элемент, Отказ)

	РаботаСРабочимКалендаремКлиент.ОбработкаПередУдалениемПланДня(Элементы.ПланДня, ПланДня, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПланДняНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)

	РаботаСРабочимКалендаремКлиент.ОбработкаНачалаПеретаскиванияПланДня(
		Элемент, ПараметрыПеретаскивания, Выполнение, НастройкиОтображения);

КонецПроцедуры

&НаКлиенте
Процедура ПланДняПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	РаботаСРабочимКалендаремКлиент.ОбработкаПроверкиПеретаскиванияПланДня(
		Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, НастройкиОтображения);

КонецПроцедуры

&НаКлиенте
Процедура ПланДняПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	РаботаСРабочимКалендаремКлиент.ОбработкаПеретаскиванияПланДня(
		Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, НастройкиОтображения);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСпискиЗадач(Результат, ДополнительныеПараметры) Экспорт
	
	АвтообновлениеАРМНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗадачи(ТекСтрока)
	
	Если Не Текстрока.Свойство("Задание") Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ", ТекСтрока.Задача);
		Оповещение = Новый ОписаниеОповещения("ОбновитьСпискиЗадач", ЭтотОбъект);
		ОткрытьФорму("Справочник.ЦБР_Задача.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
	Если ТекСтрока <> Неопределено Тогда
		Если Текстрока.Свойство("Задание") Тогда
			Задание = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекСтрока.Задание, "СсылкаНаЗадание");
			Если ЗначениеЗаполнено(Задание) Тогда 
				ПараметрыОткрытия = Новый Структура;
				ПараметрыОткрытия.Вставить("Ключ", Задание);
				Оповещение = Новый ОписаниеОповещения("ОбновитьСпискиЗадач", ЭтотОбъект);
				ОткрытьФорму("Документ.ЦБР_Задание.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.Независимый); 
			Иначе
				ПараметрыОткрытия = Новый Структура;
				ПараметрыОткрытия.Вставить("Ключ", ТекСтрока.Задача);
				Оповещение = Новый ОписаниеОповещения("ОбновитьСпискиЗадач", ЭтотОбъект);
				ОткрытьФорму("Справочник.ЦБР_Задача.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.Независимый);
			КонецЕсли;       
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Календарь(Команда)
	
	РежимАРМ = "Календарь";
	УстановитьОформлениеРежимаАРМ(РежимАРМ);
	ОбновитьКалендарь(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура АРМЗадачи(Команда)

	РежимАРМ = "Задачи";
	УстановитьОформлениеРежимаАРМ(РежимАРМ);
	
	НастройкиТекущегоПользователя = ОпределитьНастройкиТекущегоПользователя();
	
	УдалитьЭлементыАРМ(НастройкиТекущегоПользователя);
	ДобавитьКолонкиАРМ(НастройкиТекущегоПользователя);
   	УстановитьОтборВАРМНаСервере();
	
	ОпределитьТипСотрудника();
	ЗаполнитьТаблицуТребуетВнимания();
	Если ЭтоРуководитель Тогда
		ЗаполнитьТаблицуТребуетВниманияРуководителя();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АРМЗадания(Команда)
	РежимАРМ = "Задания";
	УстановитьОформлениеРежимаАРМ(РежимАРМ);
	
	НастройкиТекущегоПользователя = ОпределитьНастройкиЗаданийТекущегоПользователя();
	
	УдалитьЭлементыАРМ(НастройкиТекущегоПользователя);
	ДобавитьКолонкиАРМ(НастройкиТекущегоПользователя);
   	УстановитьОтборВАРМНаСервере();
	
	ОпределитьТипСотрудника();
	ЗаполнитьТаблицуТребуетВнимания();
	Если ЭтоРуководитель Тогда
		ЗаполнитьТаблицуТребуетВниманияРуководителя();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтработатьПланДня(Команда)
	
	ВыделенныеЭлементыПланировщика = Элементы.Планировщик.ВыделенныеЭлементы;
	
	Если ВыделенныеЭлементыПланировщика.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запись календаря не найдена. Попробуйте обновить календарь");
		Возврат;
	КонецЕсли;	
	
	ЗаписьВКалендаре = ВыделенныеЭлементыПланировщика[0].Значение.Ссылка;
	
	Если Не ЦБР_ЗадачиЗаданияВызовСервера.ОС_ЕстьСтатус(ЗаписьВКалендаре, ПредопределенноеЗначение("Перечисление.ЦБР_СтатусЗаписиКалендаря.Новый")) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Команда доступна только для записей календаря в статусе ""Новый""");
		Возврат;
	КонецЕсли;

	РаботаСРабочимКалендаремКлиент.ОтработатьВыделенныеЗаписиКалендаряПланДня(Элементы.ПланДня, ПланДня);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКалендарь(Команда)

	ОбновитьОтображениеКлиент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиКалендаря(Команда)

	ОткрытьФорму("Справочник.ЦБР_ЗаписиРабочегоКалендаря.Форма.НастройкиКалендаря");

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПредыдущийПериод(Команда)

	УстановитьОтображаемуюДату(
		РаботаСРабочимКалендаремКлиентСервер.ПолучитьДатуНачалаПредыдущегоПериода(
			ПериодОтображения, ОтображаемаяДата));

	ОбновитьДанныеКалендаря();

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСегодня(Команда)
	
	//@skip-check use-non-recommended-method	
	УстановитьОтображаемуюДату(ТекущаяДата());

	ОбновитьДанныеКалендаря();

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСледующийПериод(Команда)

	УстановитьОтображаемуюДату(
		РаботаСРабочимКалендаремКлиентСервер.ПолучитьДатуНачалаСледующегоПериода(
			ПериодОтображения, ОтображаемаяДата));

	ОбновитьДанныеКалендаря();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗанятость(Команда)
	
	//@skip-check use-non-recommended-method	
	Если ОтображаемаяДата = НачалоДня(ТекущаяДата()) Тогда
		РаботаСРабочимКалендаремКлиент.СоздатьЗанятость();
		Возврат;
	КонецЕсли;

	ДатаНачалаНовойЗаписи = ОтображаемаяДата + НастройкиОтображения.ОтображатьВремяС * 3600;
	ДатаОкончанияНовойЗаписи = ДатаНачалаНовойЗаписи + 3600;
	РаботаСРабочимКалендаремКлиент.СоздатьЗанятость(ДатаНачалаНовойЗаписи, ДатаОкончанияНовойЗаписи, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписьКалендаря(Команда)

	Если ПериодОтображения = ПредопределенноеЗначение("Перечисление.ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда
		РаботаСРабочимКалендаремКлиент.СоздатьЗаписьКалендаряПланДня(
			Элементы.ПланДня, НастройкиОтображения, ПользовательКалендаря);
	Иначе
		РаботаСРабочимКалендаремКлиент.СоздатьЗаписьКалендаряПланировщик(
			НастройкиОтображения, ПользовательКалендаря);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЗаписьКалендаря(Команда)

	Если Элементы.Планировщик.ВыделенныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	РаботаСРабочимКалендаремКлиент.СкопироватьЗаписьКалендаря(
		Элементы.Планировщик.ВыделенныеЭлементы[0].Значение.Ссылка,
		Элементы.Планировщик.ВыделенныеЭлементы[0].Значение.ДатаНачала,
		Элементы.Планировщик.ВыделенныеЭлементы[0].Значение.ДатаОкончания);

КонецПроцедуры

&НаКлиенте
Процедура НадписьПериодНажатие(Элемент)

	ИзменитьВидимостьВыбораДаты();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаписьКалендаря(Команда)
	
	ПараметрыФормы = Новый Структура("Ключ", Элементы.Планировщик.ВыделенныеЭлементы[0].Значение.Ссылка);
	ОткрытьФорму("Справочник.ЦБР_ЗаписиРабочегоКалендаря.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВДействияПоЗаданию(ВыделенныйЭлемент)
	
	//ЗаписьВКалендаре = ВыделенныйЭлемент.Ссылка;
	//ЗнчПредмет = ПолучитьЗначениеРеквизита(ЗаписьВКалендаре, "Предмет");
	//Если ЗначениеЗаполнено(ЗнчПредмет) И ТипЗнч(ЗнчПредмет) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
	//	Структура = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьСтруктуруПоследнегоДействия();
	//	Структура.Задание = ЗнчПредмет;
	//	Структура.ДатаНачалаДействия =  ТекущаяДатаСеанса();
	//	Структура.Статус = ПредопределенноеЗначение("Перечисление.ЦБР_Состояние.ВРаботе");
	//	
	//	ПоследнееДействие = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПоследнееДействие(ЗнчПредмет);
	//	Если ПоследнееДействие = Неопределено Или ЗначениеЗаполнено(ПоследнееДействие.ДатаОкончаниеДействия) Тогда
	//		Структура.ЗаписьКалендаря = ЗаписьВКалендаре;
	//		ЦБР_ЗадачиЗаданияВызовСервера.СоздатьЗаписьДействияПоЗадаче(Структура);
	//	Иначе
	//		ОбщегоНазначения.СообщитьПользователю("Есть не заврешенное действие по этой задаче!");
	//		Возврат;
	//	КонецЕсли;
	//	ЦБР_ЗадачиЗаданияВызовСервера.ПоменятьСтатусЗадания(ЗнчПредмет, Перечисления.ЦБР_Состояние.ВРаботе);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуТребуетВнимания()

	ТаблицаТребуютВнимание.Очистить();

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_ТребуютВнимания.НаименованиеДокументаЭтапа КАК НаименованиеДокументаЭтапа,
	|	ЦБР_ТребуютВнимания.Задача КАК Задача,
	|	ЦБР_ТребуютВнимания.Задание КАК Задание,
	|	ЦБР_ТребуютВнимания.Задача.Заказчик КАК Заказчик,
	|	ЦБР_ТребуютВнимания.Задача.Постановщик КАК Менеджер,
	|	ЦБР_ТребуютВнимания.Основание КАК Основание,
	|	ЦБР_ТребуютВнимания.ДатаДобавления КАК ДатаДобавления,
	|	ЦБР_ТребуютВнимания.ТрудозатратыПлан КАК ТрудозатратыПлан
	|ПОМЕСТИТЬ ВТ_ТребуетВниманияПредобработка
	|ИЗ
	|	РегистрСведений.ЦБР_ТребуютВнимания КАК ЦБР_ТребуютВнимания
	|ГДЕ
	|	ЦБР_ТребуютВнимания.Ответственный = &Ответственный
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦБР_ТребуютВнимания.Задача,
	|	ЦБР_ТребуютВнимания.Задание,
	|	ЦБР_ТребуютВнимания.НаименованиеДокументаЭтапа,
	|	ЦБР_ТребуютВнимания.Задача.Заказчик,
	|	ЦБР_ТребуютВнимания.Задача.Постановщик,
	|	ЦБР_ТребуютВнимания.Основание,
	|	ЦБР_ТребуютВнимания.ДатаДобавления,
	|	ЦБР_ТребуютВнимания.ТрудозатратыПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТребуетВниманияПредобработка.Задача КАК Задача,
	|	ВТ_ТребуетВниманияПредобработка.Заказчик КАК Клиент,
	|	ВТ_ТребуетВниманияПредобработка.Задача.Наименование КАК Наименование,
	|	ВТ_ТребуетВниманияПредобработка.Менеджер КАК Постановщик,
	|	МАКСИМУМ(ВТ_ТребуетВниманияПредобработка.ТрудозатратыПлан) КАК Трудозатраты
	|ИЗ
	|	ВТ_ТребуетВниманияПредобработка КАК ВТ_ТребуетВниманияПредобработка
	|ГДЕ
	|	НЕ ВТ_ТребуетВниманияПредобработка.Задание В
	|				(ВЫБРАТЬ
	|					ВТ_ТребуетВниманияПредобработка.Задание
	|				ИЗ
	|					ВТ_ТребуетВниманияПредобработка КАК ВТ_ТребуетВниманияПредобработка
	|				ГДЕ
	|					ВТ_ТребуетВниманияПредобработка.Основание = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ЦБР_ПричиныВнимания.ЭтоБлок))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТребуетВниманияПредобработка.Менеджер,
	|	ВТ_ТребуетВниманияПредобработка.Заказчик,
	|	ВТ_ТребуетВниманияПредобработка.Задача,
	|	ВТ_ТребуетВниманияПредобработка.Задача.Наименование";

	Запрос.УстановитьПараметр("Ответственный", Пользователи.АвторизованныйПользователь());

	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаТребуютВнимание.Загрузить(РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТребуетВниманияРуководителя()

	ТребуютВниманияРуководителя.Очистить();

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_ГруппыСотрудниковСостав.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
	|ГДЕ
	|	ЦБР_ГруппыСотрудниковСостав.Ссылка.Руководитель = &Руководитель
	|	И ЦБР_ГруппыСотрудниковСостав.Пользователь <> &Руководитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_ТребуютВнимания.НаименованиеДокументаЭтапа КАК НаименованиеДокументаЭтапа,
	|	ЦБР_ТребуютВнимания.Задача КАК Задача,
	|	ЦБР_ТребуютВнимания.Задание КАК Задание,
	|	ЦБР_ТребуютВнимания.Задача.Заказчик КАК Заказчик,
	|	ЦБР_ТребуютВнимания.Задача.Постановщик КАК Менеджер,
	|	ЦБР_ТребуютВнимания.Основание КАК Основание,
	|	ЦБР_ТребуютВнимания.ДатаДобавления КАК ДатаДобавления,
	|	ЦБР_ТребуютВнимания.Ответственный КАК Ответственный,
	|	ЦБР_ТребуютВнимания.ТрудозатратыПлан КАК ТрудозатратыПлан
	|ПОМЕСТИТЬ ВТ_ТребуетВниманияПредобработка
	|ИЗ
	|	РегистрСведений.ЦБР_ТребуютВнимания КАК ЦБР_ТребуютВнимания
	|ГДЕ
	|	ЦБР_ТребуютВнимания.Ответственный В
	|			(ВЫБРАТЬ
	|				ВТ_Сотрудники.Пользователь
	|			ИЗ
	|				ВТ_Сотрудники)
	|	И ЦБР_ТребуютВнимания.ДатаДобавления <= &ТекущаяДатаСеанса
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦБР_ТребуютВнимания.Задача,
	|	ЦБР_ТребуютВнимания.Задание,
	|	ЦБР_ТребуютВнимания.НаименованиеДокументаЭтапа,
	|	ЦБР_ТребуютВнимания.Задача.Заказчик,
	|	ЦБР_ТребуютВнимания.Задача.Постановщик,
	|	ЦБР_ТребуютВнимания.Основание,
	|	ЦБР_ТребуютВнимания.ДатаДобавления,
	|	ЦБР_ТребуютВнимания.Ответственный,
	|	ЦБР_ТребуютВнимания.ТрудозатратыПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТребуетВниманияПредобработка.Задача КАК Задача,
	|	ВТ_ТребуетВниманияПредобработка.Заказчик КАК Клиент,
	|	ВТ_ТребуетВниманияПредобработка.Задача.Наименование КАК Наименование,
	|	ВТ_ТребуетВниманияПредобработка.Менеджер КАК Постановщик,
	|	ВТ_ТребуетВниманияПредобработка.Ответственный КАК Исполнитель,
	|	ВТ_ТребуетВниманияПредобработка.ТрудозатратыПлан КАК Трудозатраты
	|ИЗ
	|	ВТ_ТребуетВниманияПредобработка КАК ВТ_ТребуетВниманияПредобработка
	|ГДЕ
	|	НЕ ВТ_ТребуетВниманияПредобработка.Задание В
	|				(ВЫБРАТЬ
	|					ВТ_ТребуетВниманияПредобработка.Задание
	|				ИЗ
	|					ВТ_ТребуетВниманияПредобработка КАК ВТ_ТребуетВниманияПредобработка
	|				ГДЕ
	|					ВТ_ТребуетВниманияПредобработка.Основание = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ЦБР_ПричиныВнимания.ЭтоБлок))";

	Запрос.УстановитьПараметр("Руководитель", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса() - 2 * 3600);

	РезультатЗапроса = Запрос.Выполнить();
	ТребуютВниманияРуководителя.Загрузить(РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура АвтообновлениеАРМ()
	АвтообновлениеАРМНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура АвтообновлениеАРМНаСервере()
	ЗаполнитьТаблицуТребуетВнимания();  
		Элементы.ДекорацияКолВо.Заголовок = ТаблицаТребуютВнимание.Количество(); 
	Если ЭтоРуководитель Тогда
		ЗаполнитьТаблицуТребуетВниманияРуководителя();  
		Элементы.ДекорацияКолВо2.Заголовок = ТребуютВниманияРуководителя.Количество(); 
	КонецЕсли;
	
	Если Элементы.АРМЗадачи.Пометка Тогда
		ЗаполнитьТаблицыЗадачНаСервере(ОпределитьНастройкиТекущегоПользователя());
	Иначе
		ЗаполнитьТаблицыЗаданийНаСервере(ОпределитьНастройкиЗаданийТекущегоПользователя());
	КонецЕсли;
	
	УстановитьОтборВАРМНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНаправленийДляОтбора()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦБР_ГруппыСотрудников.Руководитель КАК Руководитель,
	|	ЦБР_ГруппыСотрудников.Наименование КАК Наименование,
	|	ЦБР_ГруппыСотрудников.Руководитель.Наименование КАК РуководительНаименование
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников КАК ЦБР_ГруппыСотрудников
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элементы.отборНаправление.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Руководитель, ВыборкаДетальныеЗаписи.Наименование
			+ " (" + ВыборкаДетальныеЗаписи.РуководительНаименование + ")");
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов() 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "отборИсполнитель", "Видимость", ЭтоРуководитель); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "отборНаправление", "Видимость", ЭтоПолныеПрава); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаШапкаГоризонтальная1", "Видимость", ЭтоРуководитель); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТребуютВниманияРуководителя", "Видимость", ЭтоРуководитель); 
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипСотрудника() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_ГруппыСотрудников.Руководитель КАК Руководитель
		|ИЗ
		|	Справочник.ЦБР_ГруппыСотрудников КАК ЦБР_ГруппыСотрудников
		|ГДЕ
		|	НЕ ЦБР_ГруппыСотрудников.ПометкаУдаления
		|	И ЦБР_ГруппыСотрудников.Руководитель = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
      ЭтоРуководитель = Истина;
	КонецЕсли;
	
	ЭтоПолныеПрава = РольДоступна("ПолныеПрава");
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеВыбратьКалендарьПользователяСервер()

	РаботаСРабочимКалендаремСервер.УстановитьПерсональнуюНастройку(
		"ТекущиеКалендариВсеКалендари", ПользователиКалендаря.ВыгрузитьЗначения());
	ОбновитьОтображениеСервер();

КонецПроцедуры

&НаСервере
Процедура УстановитьАвтообновление()

	НастройкиАвтообновления = Автообновление.ПолучитьНастройкиАвтообновленияФормы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьАвтообновлениеФормы()
	ПодключитьОбработчикОжидания(
			"ОбработкаАвтообновления", 15, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАвтообновления()
	
	Если ПериодОтображения = ПредопределенноеЗначение("Перечисление.ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда
		ОбновитьОтображениеКлиент();
	Иначе
		ОбновитьДанныеКалендаря();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьГрафикРаботы()

	ГрафикРаботы = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	ЗаданГрафикРаботы = ЗначениеЗаполнено(ГрафикРаботы);
	Если ЗаданГрафикРаботы Тогда
		РаботаСРабочимКалендаремСервер.ЗаполнитьРабочиеДни(
			РабочиеДни, ЗаполненныеГода, ОтображаемаяДата);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображаемуюДату(НоваяОтображаемаяДата)

	Элементы.ОтображаемаяДата.ВыделенныеДаты.Очистить();
	ОтображаемаяДата = НоваяОтображаемаяДата;
	Элементы.ОтображаемаяДата.ВыделенныеДаты.Добавить(ОтображаемаяДата);
	ВыделенныеДаты.ЗагрузитьЗначения(Элементы.ОтображаемаяДата.ВыделенныеДаты);

	ОбновитьНастройкиОтображения();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКлиент(Параметр = Неопределено, ИзмененнаяНастройка = Неопределено,
	ОбновитьНастройки = Ложь)
	
	ДатаСегодня = НачалоДня(ТекущаяДата());

	Если Параметр <> Неопределено И ПериодОтображения <> ПредопределенноеЗначение(
		"Перечисление.ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда

		РаботаСРабочимКалендаремКлиент.ОбновитьЗаписиКалендаряВПланировщике(
			Планировщик, НастройкиОтображения, Параметр);
		Возврат;

	КонецЕсли;

	СвернутыеЭлементы = РаботаСРабочимКалендаремКлиент.ПолучитьСвернутыеЭлементыПланаДня(
		Элементы.ПланДня, ПланДня);
	ОбновитьОтображениеСервер(Параметр, ИзмененнаяНастройка, ОбновитьНастройки);
	РаботаСРабочимКалендаремКлиент.ВосстановитьСостояниеПланаДня(
		Элементы.ПланДня, ПланДня, СвернутыеЭлементы, ТекущаяЗаписьКалендаря, ТекущаяДатаНачала);

#Если Не ВебКлиент Тогда
	Если ОбновитьНастройки Тогда
		УстановитьАвтообновлениеФормы();
	КонецЕсли;
#КонецЕсли
     ЗаданиеСсылка = ПредопределенноеЗначение("Документ.ЦБР_Задание.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеКалендаря(ИзмененнаяНастройка = Неопределено)

	Если ПериодОтображения = ПредопределенноеЗначение("Перечисление.ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда

		ОбновитьОтображениеКлиент( , ИзмененнаяНастройка);

	Иначе

		РаботаСРабочимКалендаремКлиент.ОбновитьОтображениеПланировщика(
			Планировщик, НастройкиОтображения, ИзмененнаяНастройка);

	КонецЕсли;

#Если МобильныйКлиент Тогда
	ОбновитьНадписьЗаголовок();
#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСервер(Параметр = Неопределено, ИзмененнаяНастройка = Неопределено,
	ОбновитьНастройки = Ложь)

	РаботаСРабочимКалендаремСервер.СохранитьНастройку(НастройкиОтображения, ИзмененнаяНастройка);

	НастройкиОтображения = РаботаСРабочимКалендаремСервер.ПолучитьНастройкиОтображения();
	НастройкиОтображения.Пользователи.Очистить();
	Для Каждого ОчереднойПользователь Из ПользователиКалендаря Цикл
		НастройкиОтображения.Пользователи.Добавить(ОчереднойПользователь.Значение);
	КонецЦикла;
	Если ПользователиКалендаря.Количество() = 1 Тогда
		ПользовательКалендаря = ПользователиКалендаря[0].Значение;
	Иначе
		ПользовательКалендаря = Неопределено;
	КонецЕсли;
	
	Если ПользователиКалендаря.Количество() > 1 Тогда
		НастройкиОтображения.ОтображатьЗанятость = Ложь;
	КонецЕсли;
	НастройкиОтображения.ОтображаемаяДата = ОтображаемаяДата;
	НастройкиОтображения.ВыделенныеДаты = ВыделенныеДаты.ВыгрузитьЗначения();
	НастройкиОтображения.ПериодОтображения = ПериодОтображения;

	УстановитьТекущуюСтраницу(Элементы, ПользователиКалендаря, ПериодОтображения);

	Если ПериодОтображения = Перечисления.ПериодОтображенияРабочегоКалендаря.ПланДня Тогда

		ПланДняЗначение = РеквизитФормыВЗначение("ПланДня");
		РаботаСРабочимКалендаремСервер.ОтобразитьПланДня(ПланДняЗначение, НастройкиОтображения);
		ЗначениеВРеквизитФормы(ПланДняЗначение, "ПланДня");

	Иначе

		РаботаСРабочимКалендаремСервер.ОтобразитьКалендарь(Планировщик, НастройкиОтображения);

		ИспользоватьБыстроеРедактирование = РаботаСРабочимКалендаремСервер.ПолучитьПерсональнуюНастройку(
					"ИспользоватьБыстроеРедактирование");

		УстановитьВидимостьЭлементов();

	КонецЕсли;

	Если ОбновитьНастройки Тогда
		УстановитьАвтообновление();
		ОтображатьЛегенду = РаботаСРабочимКалендаремСервер.ПолучитьПерсональнуюНастройку("ОтображатьЛегенду");
		УстановитьВидимостьЭлементов();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВариантРаботыФормы()

	Если Не ЗначениеЗаполнено(Параметры.ВариантРаботыФормы) Тогда
		Параметры.ВариантРаботыФормы = "ВсеКалендари";
	КонецЕсли;

	Если Параметры.ВариантРаботыФормы = "МойКалендарь" Тогда
		КлючНазначенияИспользования = "МойКалендарь";
		Заголовок = НСтр("ru = 'Мой календарь'");

		ПользователиКалендаря.Добавить(Пользователи.ТекущийПользователь());
		ПользовательКалендаря = Пользователи.ТекущийПользователь();


		Элементы.ПользователиКалендаря.Видимость = Ложь;
		Элементы.ФормаСоздатьЗанятость.Видимость = Истина;
	ИначеЕсли Параметры.ВариантРаботыФормы = "ВсеКалендари" Тогда
		КлючНазначенияИспользования = "ВсеКалендари";
		Заголовок = НСтр("ru = 'Все календари'");
		ПользователиКалендаря.ЗагрузитьЗначения(РаботаСРабочимКалендаремСервер.ПолучитьПерсональнуюНастройку(
			"ТекущиеКалендариВсеКалендари")); 
		
		ДобавитьВКалендарьТекущегоПользователя();
		
		Элементы.ПользователиКалендаря.Видимость = Истина;
		Элементы.ФормаСоздатьЗанятость.Видимость = Ложь;
	ИначеЕсли Параметры.ВариантРаботыФормы = "КалендарьСотрудника" Тогда

		КлючНазначенияИспользования = "КалендарьСотрудника";
		Заголовок = СтрШаблон(НСтр("ru = 'Календарь сотрудника %1'"), Параметры.ФизЛицоСотрудника);

		ПользователиКалендаря.Добавить(Пользователи.ТекущийПользователь());
		ПользовательКалендаря = Пользователи.ТекущийПользователь();

		Элементы.ПользователиКалендаря.Видимость = Ложь;
		Элементы.ФормаСоздатьЗанятость.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиОтображения()
	
	ДобавитьВКалендарьТекущегоПользователя();
	
	НастройкиОтображения.Пользователи.Очистить();
	Для Каждого ОчереднойПользователь Из ПользователиКалендаря Цикл
		НастройкиОтображения.Пользователи.Добавить(ОчереднойПользователь.Значение);
	КонецЦикла;
		
	Если ПользователиКалендаря.Количество() = 1 Тогда
		ПользовательКалендаря = ПользователиКалендаря[0].Значение;	
	Иначе
		ПользовательКалендаря = Неопределено;
	КонецЕсли;
	Если ПользователиКалендаря.Количество() > 1 Тогда
		НастройкиОтображения.ОтображатьЗанятость = Ложь;
	КонецЕсли;
	НастройкиОтображения.ОтображаемаяДата = ОтображаемаяДата;
	НастройкиОтображения.ВыделенныеДаты = ВыделенныеДаты.ВыгрузитьЗначения();
	НастройкиОтображения.ПериодОтображения = ПериодОтображения;

	УстановитьТекущуюСтраницу(Элементы, ПользователиКалендаря, ПериодОтображения);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКалендарьПользователя()

	ВыбранныеПользователи = Новый Массив;
	Для Каждого СтрПользовательКалендаря Из ПользователиКалендаря Цикл
		СтруктураВыбранногоАдресата = РаботаСАдреснойКнигойКлиент.СтруктураВыбранногоАдресата();
		СтруктураВыбранногоАдресата.Контакт = СтрПользовательКалендаря.Значение;
		ВыбранныеПользователи.Добавить(СтруктураВыбранногоАдресата);
	КонецЦикла;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимРаботыФормы", 2);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ОтображатьСотрудников", Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Выбор пользователей календаря'"));
	ПараметрыФормы.Вставить("ВыбранныеАдресаты", ВыбранныеПользователи);

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыбратьКалендарьПользователя", ЭтотОбъект);

	РаботаСАдреснойКнигойКлиент.ВыбратьАдресатов(ПараметрыФормы, ЭтотОбъект, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбратьКалендарьПользователя(ВыбранныеПользователи, ДопПараметры) Экспорт

	Если ВыбранныеПользователи = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПользователиКалендаря.Очистить();
	ПолучитьПользователей(ВыбранныеПользователи);

	ОбновитьНастройкиОтображения();
	ЗавершениеВыбратьКалендарьПользователяСервер();

КонецПроцедуры

&НаСервере
Процедура ПолучитьПользователей(ВыбранныеПользователи)
	Состав = ВыбранныеПользователи.ПолучитьОбъект().Состав;
	Для Каждого ВыбранныйПользователь Из Состав Цикл
		ПользователиКалендаря.Добавить(ВыбранныйПользователь.Пользователь);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущуюСтраницу(Элементы, ПользователиКалендаря, ПериодОтображения)

	УказаныПользователи = ПользователиКалендаря.Количество() <> 0;

	Если УказаныПользователи И ПериодОтображения = ПредопределенноеЗначение(
		"Перечисление.ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда
		Элементы.СтраницыПланировщика.ТекущаяСтраница = Элементы.СтраницаПланДня;
	ИначеЕсли УказаныПользователи Тогда
		Элементы.СтраницыПланировщика.ТекущаяСтраница = Элементы.СтраницаПланировщик;
	Иначе
		Элементы.СтраницыПланировщика.ТекущаяСтраница = Элементы.СтраницаПусто;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеАРМ()

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТЧСОтборомСтатусСогласован.Состояние"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; // либо задаем свой
	СписокЗначенийОтбора = Новый СписокЗначений;
	СписокЗначенийОтбора.Добавить(Перечисления.ЦБР_Состояние.ОценкаНеСогласована);
	СписокЗначенийОтбора.Добавить(Перечисления.ЦБР_Состояние.СрокиНеСогласованы);
	ЭлементОтбора.ПравоеЗначение = СписокЗначенийОтбора;
	ЭлементОтбора.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТЧСОтборомСтатусСогласованСостояние");
	ПолеОформления.Использование = Истина;
	ЭлементУсловногоОформления.Использование = Истина;

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТЧСОтборомСтатусСогласован.Состояние"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; // либо задаем свой
	СписокЗначенийОтбора = Новый СписокЗначений;
	СписокЗначенийОтбора.Добавить(Перечисления.ЦБР_Состояние.ОценкаСогласована);
	СписокЗначенийОтбора.Добавить(Перечисления.ЦБР_Состояние.СрокиСогласованы);
	СписокЗначенийОтбора.Добавить(Перечисления.ЦБР_Состояние.Согласован);
	ЭлементОтбора.ПравоеЗначение = СписокЗначенийОтбора;
	ЭлементОтбора.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТЧСОтборомСтатусСогласованСостояние");
	ПолеОформления.Использование = Истина;
	ЭлементУсловногоОформления.Использование = Истина;

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТЧСОтборомСтатусСогласован.Состояние"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; // либо задаем свой
	СписокЗначенийОтбора = Новый СписокЗначений;
	СписокЗначенийОтбора.Добавить(Перечисления.ЦБР_Состояние.НаСогласованииОценки);
	СписокЗначенийОтбора.Добавить(Перечисления.ЦБР_Состояние.НаСогласованииСроков);
	ЭлементОтбора.ПравоеЗначение = СписокЗначенийОтбора;
	ЭлементОтбора.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста",
		ЦветаСтиля.ВыборСтандартногоПериодаФонКнопки);
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТЧСОтборомСтатусСогласованСостояние");
	ПолеОформления.Использование = Истина;
	ЭлементУсловногоОформления.Использование = Истина;
	
	//ОФормление просрочки больше 2 часов
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТребуютВниманияРуководителя.ДатаДобавления"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше; // либо задаем свой
	ЭлементОтбора.ПравоеЗначение = ТекущаяДатаСеанса() - 2 * 60 * 60;
	ЭлементОтбора.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПолеСОшибкойФон);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.CRM_ЧерныйЦветТекста);
	//@skip-check new-font
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина, , , , ));
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТребуютВниманияРуководителя");
	ПолеОформления.Использование = Истина;
	ЭлементУсловногоОформления.Использование = Истина;

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТребуютВнимания.ДатаДобавления"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше; // либо задаем свой
	ЭлементОтбора.ПравоеЗначение = ТекущаяДатаСеанса() - 2 * 60 * 60;
	ЭлементОтбора.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПолеСОшибкойФон);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.CRM_ЧерныйЦветТекста);
	//@skip-check new-font
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина, , , , ));
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТребуютВнимания");
	ПолеОформления.Использование = Истина;
	ЭлементУсловногоОформления.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьВыбораДаты()

	Элементы.ГруппаДата.Видимость = Не Элементы.ГруппаДата.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьЗаголовок()

	ПредставленияПериода = "";
	Если ПериодОтображения = ПредопределенноеЗначение("Перечисление.ПериодОтображенияРабочегоКалендаря.Месяц") Тогда
		ПредставленияПериода = Формат(ОтображаемаяДата, "ДФ='MMMM yy'");

	ИначеЕсли ПериодОтображения = ПредопределенноеЗначение("Перечисление.ПериодОтображенияРабочегоКалендаря.Неделя")
		Или ПериодОтображения = ПредопределенноеЗначение("Перечисление.ПериодОтображенияРабочегоКалендаря.ТриДня")
		Или ПериодОтображения = ПредопределенноеЗначение("Перечисление.ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда

		НачалоПериода = РаботаСРабочимКалендаремКлиентСервер.ПолучитьДатуНачалаОтображаемогоПериода(
						ПериодОтображения, ОтображаемаяДата);
		КонецПериода = РаботаСРабочимКалендаремКлиентСервер.ПолучитьДатуОкончанияОтображаемогоПериода(
						ПериодОтображения, ОтображаемаяДата);
		ПредставленияПериода = СтрШаблон("%1 - %2", Формат(НачалоПериода, "ДФ=dd.MM"), Формат(КонецПериода, "ДФ=dd.MM"));

	ИначеЕсли ПериодОтображения = ПредопределенноеЗначение("Перечисление.ПериодОтображенияРабочегоКалендаря.День") Тогда
		ПредставленияПериода= Формат(ОтображаемаяДата, "ДФ='dd MMM yyyy'");

	КонецЕсли;

	Элементы.НадписьПериод.Заголовок = ПредставленияПериода;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРеквизита(Ссылка, Реквизит)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);
КонецФункции

&НаКлиенте
Процедура УстановитьОформлениеРежимаАРМ(АктивныйРежим)

	Если АктивныйРежим = "Календарь" Тогда
		УстановитьОформлениеНеактивногоТипаЗадачи(Элементы.АРМЗадания);
		УстановитьОформлениеНеактивногоТипаЗадачи(Элементы.АРМЗадачи);
		УстановитьОформлениеАктивногоТипаЗадачи(Элементы.Календарь);
	ИначеЕсли АктивныйРежим = "Задачи" Тогда
		УстановитьОформлениеАктивногоТипаЗадачи(Элементы.АРМЗадачи);
		УстановитьОформлениеНеактивногоТипаЗадачи(Элементы.АРМЗадания);
		УстановитьОформлениеНеактивногоТипаЗадачи(Элементы.Календарь);
	ИначеЕсли АктивныйРежим = "Задания" Тогда
		УстановитьОформлениеАктивногоТипаЗадачи(Элементы.АРМЗадания);
		УстановитьОформлениеНеактивногоТипаЗадачи(Элементы.АРМЗадачи);
		УстановитьОформлениеНеактивногоТипаЗадачи(Элементы.Календарь);
	КонецЕсли;
	УстановитьВидимостьГрупп(АктивныйРежим);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГрупп(Группа)

	Если ТипЗнч(Группа) <> Тип("Строка") Тогда
		ТекстСообщения = НСтр("ru = 'Неверный тип параметра'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;

	Если Группа = "Календарь" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы( Элементы, "ГруппаКалендарь", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы( Элементы, "КанбанСписки", "Видимость", Ложь);  
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы( Элементы, "ГруппаТребуютВнимание", "Видимость", Ложь);  
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы( Элементы, "ГруппаКалендарь", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы( Элементы, "КанбанСписки", "Видимость", Истина); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы( Элементы, "ГруппаТребуютВнимание", "Видимость", Истина);  
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеНеактивногоТипаЗадачи(Элемент)
	Элемент.Пометка 	= Ложь; 
	//@skip-check new-color
	Элемент.ЦветФона 	= Новый Цвет(163, 173, 187);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеАктивногоТипаЗадачи(Элемент)
	Элемент.Пометка 	= Истина;
	//@skip-check new-color
	Элемент.ЦветФона 	= Новый Цвет(30,144,255);
КонецПроцедуры

&НаСервере
Процедура РазбиватьТребуетВниманияНаДвеКолонки()
	
	НастройкиКанбанаТекущегоПользователя = ОпределитьНастройкиТекущегоПользователя();
	
	Если НастройкиКанбанаТекущегоПользователя  = Справочники.ЦБР_ШаблоныАРМ.ПустаяСсылка() Тогда
		НастройкиКанбанаТекущегоПользователя = Справочники.ЦБР_ШаблоныАРМ.Основной;
	КонецЕсли; 
	
	РазбиватьТребуетВниманияНаДвеКолонки = НастройкиКанбанаТекущегоПользователя.РазбиватьТребуетВниманияНаДвеКолонки;
	Если РазбиватьТребуетВниманияНаДвеКолонки Тогда 
		Элементы.ГруппаТребуютВнимание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;   
		Элементы.ГруппаТребуютВнимание.Ширина      = 48;
	Иначе
		Элементы.ГруппаТребуютВнимание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		Элементы.ГруппаТребуютВнимание.Ширина      = 24;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ДобавитьВКалендарьТекущегоПользователя()
	
	Если ПользователиКалендаря.Количество() = 0 Тогда
		ПользователиКалендаря.Добавить(Пользователи.ТекущийПользователь());
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОС_Календаря 

&НаКлиенте
Процедура ОС_Закончить(Команда)
	
	ВыделенныеЭлементыПланировщика = Элементы.Планировщик.ВыделенныеЭлементы;
	
	Если ВыделенныеЭлементыПланировщика.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запись календаря не найдена. Попробуйте обновить календарь");
		Возврат;
	КонецЕсли;	
	
	ЗаписьВКалендаре = ВыделенныеЭлементыПланировщика[0].Значение.Ссылка;
	
	Если Не ЦБР_ЗадачиЗаданияВызовСервера.ОС_ЕстьСтатус(ЗаписьВКалендаре, ПредопределенноеЗначение("Перечисление.ЦБР_СтатусЗаписиКалендаря.Начал")) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Команда доступна только для записей календаря в статусе ""Начал""");
		Возврат;
	КонецЕсли;
	
	РеквизитыЗаписи = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(ЗаписьВКалендаре, "ЗаданиеСсылка,ЗадачаСсылка,Описание");     
	
	Если ЗначениеЗаполнено(РеквизитыЗаписи.ЗаданиеСсылка) Тогда
		
		РеквизитыЗадания = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(РеквизитыЗаписи.ЗаданиеСсылка, "ТрудозатратыПлан, ТрудозатратыФакт, ТипОценкиЗадачи, ОплатаПоФакту");     
		
		ПоследнееДействие = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПоследнееДействие(РеквизитыЗаписи.ЗаданиеСсылка);
		Если Не ЗначениеЗаполнено(ПоследнееДействие.ДатаОкончаниеДействия) Тогда
			
			Оповещение = Новый ОписаниеОповещения("ДобавитьЭффективныеЧасыОкончание", ЭтотОбъект);
			
			ПараметрыФормы = Новый Структура;       
			ПараметрыФормы.Вставить("Задание", РеквизитыЗаписи.ЗаданиеСсылка);
			ПараметрыФормы.Вставить("Описание", РеквизитыЗаписи.Описание);  				
			ПараметрыФормы.Вставить("ЗаписьОС", ЗаписьВКалендаре); 
			
			ОткрытьФорму("Документ.ЦБР_Задание.Форма.ФормаДобавленияЭффективныхЧасов", ПараметрыФормы, ЭтотОбъект, , , ,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		КонецЕсли;	
		
	Иначе
		ЦБР_ЗадачиЗаданияВызовСервера.УстановитьОтработана(Новый Структура("ЗаписьОС,ПоПлану,РешеноПриПервомПодключении,ОписаниеВыполненнойРаботы", ЗаписьВКалендаре, Ложь, Ложь, Неопределено));	
	    Оповестить("Запись_ЗаписьКалендаря");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОС_Приступить(Команда)
	
	ВыделенныеЭлементыПланировщика = Элементы.Планировщик.ВыделенныеЭлементы;
	
	Если ВыделенныеЭлементыПланировщика.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запись календаря не найдена. Попробуйте обновить календарь");
		Возврат;
	КонецЕсли;	
	
	ЗаписьВКалендаре = ВыделенныеЭлементыПланировщика[0].Значение.Ссылка;
	
	Если Не ЦБР_ЗадачиЗаданияВызовСервера.ОС_ЕстьСтатус(ЗаписьВКалендаре, ПредопределенноеЗначение("Перечисление.ЦБР_СтатусЗаписиКалендаря.Новый")) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Команда доступна только для записей календаря в статусе ""Новый""");
		Возврат;
	КонецЕсли;	
	
	ЦБР_ЗадачиЗаданияВызовСервера.УстановитьСтарт(ЗаписьВКалендаре);

	Оповестить("Запись_ЗаписьКалендаря");

КонецПроцедуры

&НаКлиенте
Процедура ОС_Отменить(Команда)
	
	ВыделенныеЭлементыПланировщика = Элементы.Планировщик.ВыделенныеЭлементы;
	
	Если ВыделенныеЭлементыПланировщика.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запись календаря не найдена. Попробуйте обновить календарь");
		Возврат;
	КонецЕсли;	
	
	ЗаписьВКалендаре = ВыделенныеЭлементыПланировщика[0].Значение.Ссылка;
	
	ПараметрыОповещения = Новый Структура("ЗаписьВКалендаре", ЗаписьВКалендаре);
	
	Оповещение = Новый ОписаниеОповещения("ОС_ОтменитьОкончание", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВводСтроки(Оповещение,,"Укажите причину отмены ОС.", 0, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОС_ПоПлану(Команда)
	
	ВыделенныеЭлементыПланировщика = Элементы.Планировщик.ВыделенныеЭлементы;
	
	Если ВыделенныеЭлементыПланировщика.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запись календаря не найдена. Попробуйте обновить календарь");
		Возврат;
	КонецЕсли;	
	
	ЗаписьВКалендаре = ВыделенныеЭлементыПланировщика[0].Значение.Ссылка;
	
	Если Не ЦБР_ЗадачиЗаданияВызовСервера.ОС_ЕстьСтатус(ЗаписьВКалендаре, ПредопределенноеЗначение("Перечисление.ЦБР_СтатусЗаписиКалендаря.Новый")) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Команда доступна только для записей календаря в статусе ""Новый""");
		Возврат;
	КонецЕсли;
	
	РеквизитыЗаписи = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(ЗаписьВКалендаре, "ЗаданиеСсылка,ЗадачаСсылка,Описание,ДатаНачала,ДатаОкончания");     
			
	Если НачалоДня(РеквизитыЗаписи.ДатаНачала) < НачалоДня(ТекущаяДата() - 7 * 24 * 3600) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя создать ОС по плану позже " + Формат(НачалоДня(ТекущаяДата() - 7 * 24 * 3600),"ДФ=dd.MM.yyyy"));  
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыЗаписи.Описание) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните описание!");  
		Возврат;
	КонецЕсли;	
		
	КоличествоДней = (НачалоДня(РеквизитыЗаписи.ДатаОкончания) - НачалоДня(РеквизитыЗаписи.ДатаНачала)) / (60 * 60 * 24) + 1;
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьЭффективныеЧасыОкончание", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;   	
	ПараметрыФормы.Вставить("ЗаписьОС", ЗаписьВКалендаре);
	ПараметрыФормы.Вставить("Задание", РеквизитыЗаписи.ЗаданиеСсылка); 
	ПараметрыФормы.Вставить("Описание", РеквизитыЗаписи.Описание);  	
	ПараметрыФормы.Вставить("ПоказатьЗакрытьЗадание", Ложь);      
	ПараметрыФормы.Вставить("ПоПлану", Истина);       
	ПараметрыФормы.Вставить("КоличествоДней", КоличествоДней);
	Если КоличествоДней > 1 Тогда
		ПараметрыФормы.Вставить("ДатыПоДням", РазбитьЗаписиНаНесколькоДней(РеквизитыЗаписи.ДатаНачала, РеквизитыЗаписи.ДатаОкончания, КоличествоДней));
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЦБР_Задание.Форма.ФормаДобавленияЭффективныхЧасов", ПараметрыФормы, ЭтотОбъект, , , ,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьЭффективныеЧасыОкончание(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		Оповестить("Запись_ЗаписьКалендаря");
	КонецЕсли;
		
КонецПроцедуры  

&НаКлиенте
Процедура ОС_ОтменитьОкончание(Результат, Параметры) Экспорт
 
	Если Не Результат = Неопределено И ЗначениеЗаполнено(Результат) Тогда
		
		ЗаписьВКалендаре = Параметры.ЗаписьВКалендаре;
		
		ЦБР_ЗадачиЗаданияВызовСервера.УстановитьОтменена(ЗаписьВКалендаре, Результат);
			
		УстановленаПометкаУдаления = РаботаСРабочимКалендаремСервер.УстановитьПометкуУдаления(
		ЗаписьВКалендаре,
		Истина,
		Результат);
		
		Если УстановленаПометкаУдаления Тогда
			Оповестить("Запись_ЗаписьКалендаря", ЗаписьВКалендаре);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана причина отмены!");
	КонецЕсли;
 
КонецПроцедуры 

&НаСервереБезКонтекста
Функция РазбитьЗаписиНаНесколькоДней(Начало, Конец, КоличествоДней)
	
	ОсПоДням = Новый Массив;
	День = 1;
	ДатаОкончания = Конец;
	Пока День <= КоличествоДней Цикл
		Если ДеньНедели(Начало) = 6 Или ДеньНедели(Начало) = 7 Тогда
			День = День + 1;
			Начало = НачалоДня(НачалоДня(Начало) + 25 * 60 * 60) + 9 * 60 * 60;
			Продолжить;
		КонецЕсли;
		СтруктураДат = Новый Структура("Начало, Конец, Часов");
		Если День = КоличествоДней Тогда
			Конец = ДатаОкончания;
		Иначе  
			Конец = НачалоДня(Начало) + 64800;
		КонецЕсли;
		СтруктураДат.Начало = Начало;
		СтруктураДат.Конец = Конец; 
		
		КолВоЧасов = (Конец-Начало)/3600;
		
		СтруктураДат.Часов = ЦенообразованиеКлиентСервер.ОкруглитьЦену(КолВоЧасов, 1, Перечисления.ВариантыОкругления.ВсегдаВПользуПредприятия);    
		ОсПоДням.Добавить(СтруктураДат);
		День = День + 1;
		Начало = НачалоДня(НачалоДня(Начало) + 25 * 60 * 60) + 9 * 60 * 60;
	КонецЦикла;   
	
	Возврат ОсПоДням; 
	
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти


