#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область Проведение                                                          



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти      

#Область ПредставлениеОбъектов 

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    
    Поля.Добавить("НомерЗаданияВУровне");
    Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    
    Представление = СтрШаблон("%1 %2" ,Данные.НомерЗаданияВУровне , Данные.Наименование); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли